{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "2322": {
        "pageid": 2322,
        "ns": 0,
        "title": "5YearAnniversaryBritishBlackthorn",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "==Description==\n\nFor Ultima Online Forever's 5th Year Anniversary, we hosted Richard Garriott and Starr Long in the Ultima Online Forever game. As Lord British and Lord Blackthorn they were in game with the Ultima Online Forever staff and community. A video of the event can be found at: https://www.youtube.com/watch?v=5-hSkPvNtrg\n\nOn this page you will find a rough transcription of the event. Where possible it was transcribed word for word but some wording was re-ordered or skipped entirely if it was repetitive.\n\n==Who's Who==\n\nRG: Richard Garriot (Lord British)\n\nSL: Starr Long (Lord Blackthorn)\n\nS: Shane\n\nP: Pat\n\nE: Eppy\n\nF: Fay\n\nJ: JoeB\n\n==Intros==\n\n''[Lord British appears!]''\n\nS: Hail!\n\nRG: Hail! How are you?\n\nS: Good, greetings!\n\nRG: There's a lot happening in here, great to see you!\n\n[Lord Blackthorn appears!]\n\nS: Greetings Starr!\n\nSL: Hellooo\n\nS: There's quite a crowd here...\n\nSL: Alright!\n\nS: I've just been told we're now on the frontpage of Twitch\n\nSL: Coool\n\nS: Welcome everybody. This is our 5th year anniversary! Welcome Richard Garriot who is, as you all now, Lord British himself.\n\n''[Lord British waves royally]''\n\nRG: Thank you all for having me and thanks for all of you being in attendance for an amazing, amazing receiption.\n\nS: And we have Starr Long, who is Lord Blackthorn himself. Most people know who Lord British is but not as many know who Lord Blackthorn is, so welcome Starr Long. This is the original Lord Blackthorn. We have them both right here!\n\nSL: Yep, that's me! Lord Blackthorn. Thanks for having me here.\n\nS: We have Chaos and we have Order here. We have some questions for a Q&A and a couple of short events. Starr will be here for 1 hour and Richard will be here for 2.\n\nRG: We've got an audience here unlike I've seen on Ultima for many, many, many moons... Many solar cycles in fact. So congratulations to all of you both involved in the development and the community of Ultima Online Forever. It is really astounding to see you all here. It is astounding to see the service functioning so well after 20 years and the 5 year branch that you guys are building... just amazing. It's amazing to see, it's humbling to see.\n\nS: We appreciate that. We honestly cant thank you two for coming and joining us here. I think I speak for every single person in the game right here when I say thank you guys for all you have done and for joining us here on something that we are all very passionate about. Over to our developer Pat for the Q&A...\n\n\n==Q&A==\n\nP: First question we have for both of you...\n\n===What do Richard and Starr think about how there is still a lot of people that play Ultima Online.===\n\n\nRG: I'll dive in first... Even before I talk about how many people are still playing it, I'd like to do something I always do when we are talking about Ultima Online as the person who founded the Ultima series back in the late 1970s... Ultima Online is a project Starr and I kicked off against great resistance from our parent company at the time, EA, and it only came into existence through the sheer will of the two of us demanding that it begin.\nWhile I get a lot of credit for Ultima Online, as the creator of Ultima, it really is Starr who hired every member of that team, who managed every member of that team and really drove this product to be what this is. The fact that it became the fastest selling game in EA Origin's history is astounding and the good vision or good fortune we had to know that the timing was right. So I think it is important to give credit to Starr for really making Ultima Online what it was.\nNow to get to your question, we were frankly stunned... We thought it would do better than EA thought it would do but we had no idea, even remotely, that it would reach the levels that it did. And the fact then that it sustained over year after year after year and here we are more than 20 years later. And to come in now to Ultima Online Forever to see the hundreds of people that are with us here right now is frankly astounding and I can't see how anybody could have predicted it. Its amazing to see the community has thrived and continues to thrive even now.\n\n\nS: Do you think gaming is reverting back a bit, from a graphics focus back into more in depth game play?\n\n\nSL: I think that what we are in is a kind of golden age of gaming where we have both the technology, in the form of all these engines like Unity and Unreal, giving everyone access to make content, and we also have all these amazing funding models like early access on Steam, funding with Kickstarter, Indiegogo. This allows us to have both very accessible mass market game experience, those can co-exist with really deep, hardcore, old school games. I don't think its an either/or. I think, like I said, we are in this golden age where we can have both and we're able to create all these different experiences.\n\nAnd to answer the original question, when I give post-mortems about Ultima Online, I make this joke about time travel. If I could go back and talk to my 22 year old self - \"Hey you know, 25 years from now, the first game you ever made is still going to be running and have spin-offs\", I would laugh in my face. There's no possible way I could have imagined this would occur. The fact that I am standing in UOForever with hundreds of people right now... This is unbelievable. I don't believe it right now, much less trying to explain it to my 22 year old self... There's no freakin' way. None of us could have predicted the longevity of these kinds of games. There was no prior work that would say it could sustain that long. And to be frank, not many have done that. UO remains the longest running experiment like this so far. There are others that came afterwards that will get to this landmark as well but what is shows is the power of these social connections that people can form if you give them an immersive enough experience that also gives them tools to connect with each other.\n\n\nS: Well put!\n\n\nP: That segues well into the next question we have here.\n\n\n===If there's one thing you could change about Ultima Online, what would it be and why?===\n\n\nSL: Ooh that's a good one. That's actually one of my interview questions for would-be employees. I ask them to pick one of the games they have been playing lately and what they would change. I like that this has been turned back on me!\n\n\nRG: Well then, answer it! ;)\n\n\nSL: Well, I was stalling to answer it... [continues to stall by repeating question]. Well that depends, is this when it launched?\n\n\nP: Yea, I'd say when it launched.\n\n\nSL: The biggest thing I would have changed at the beginning would have been that the game was a little more stable and performant. That's my biggest issue with our launch.\n\n\nRG: [Nods vigorously in agreement]\n\n\nSL: In fact, that was so bad, it made me have a mantra going forward for the rest of my career that I still use today \"Stable, fast and fun - In that order\". Which basically means that you have to get those things done in order because until the game is stable, it doesn't matter how fast your framerate is. Once you nail that, you can worry about what the framerate is. And only after you get those two nailed, can you worry about how fun the game is.\n\n\nS: We feel we run into a lot of the issues that you guys probably already dealt with way back in those days.\n\n\nRG: Even before Starr answered, stability and performance would have been up on my list too. But I'd like to throw in another one and it'll be a point of contention based on what I can see from all the people in the throne room, who throwing out their philosophies of life and things like \"Kill Trammel\" and \"Carebears killed the world\"...\n\nWhile Starr and I were fascinated with the great joys of this truly open world that also implies that you really have to trust your guildmates and have to forge true alliances because you can otherwise be literally backstabbed, whether we want to admit it or like it or not the truth really is that this made it really difficult game to grow.\n\nWhile on the one hand it is one of the features that people love and remember the most - being ganked or walking into a gate at the bank and being teleported into the woods and having all your stuff taken from you - It remains one feature I would change is have figured out a way earlier, preferably from the beginning, to accommodate both the danger and a way to ease people into it to allow us to grow the community base, without having to do some of the things that in the long run proved not to be useful, like splitting the worlds. Despite the PvPers dislike of that, it really did solve an important problem, it was just an awkward solution. We look for better solutions these days.\n\n\nP: Based on what you just said...\n\n\n===How do you feel about griefing on Ultima Online or SotA?===\n\n\nRG: It depends on what you mean by the word griefing. If what you mean is backstabbing... That is, me walking up to an experienced player, who has no excuse not to be suspicious that something might happen, and I can convince them that they should trust me because \"Hey I'm your friend and we know each other through this guild and let me help you build a house and put up the door, let me take care of your kids... surely you can trust me with the keys to your kingdom and the passcodes to your gold warehouse\"... And they have a day, month of year where they build up to turn the tide on you and then clean out your house and clean out your bank account. I think that's fair game and its reasonable to have within the game systems.\n\nUnfortunately what is difficult to do with experienced players... and what had an example of this recently on SotA ... Is that unless you are familiar with every skill in the entire skill tree, we had a player not realise that there are these pickpocket skills that and a even relatively skilled player got all this stuff pilfered by another player. How they react to that normally depends on how aware they were that it was possible to have happen. In SotA we changed it so that you now get a message a few minutes later that says \"Your pockets feel lighter\". That way its not a surprise. Its the lack of information, lack of expectation that is really the enemy of the growth of the community.\n\nIt goes from a fun feature to being unfair and angry about it when you unaware or uninformed.\n\n\nSL: I think really what it comes down to is having a very clear set of rules and guidelines and then working to enforce them. As we learned as you will have learned, when you build a sandbox like this, at a certain point it becomes less about making a game and more like running a government...\n\n\nS: Man, you nailed it right there.\n\n\nSL: You've got basically a little nation state that you have to run and you pass laws. Every now and then you realise \"Wow the way we wrote that law doesn't quite work\". So we have a legislative session, which is basically a dev meeting, where we try to figure out how to rewrite that rule. There's actually a question later that I'd like to jump to as its a perfect illustration of what was \"griefing\" behaviour was just using the rules of the sandbox as they existed. And the later question is ...\n\n\n===What are your favourite stories?===\n\n\nSL: My favourite story from Ultima Online, beautifully illustrates this very thin line between griefing and a sandbox. What makes a sandbox beautiful is the emergent gameplay that comes out of it through the unintended use of the system. As you know, the way a 3rd person, 2D, isometric game like this works is ... its the dollhouse setup, where you walk into the building and the roof pops off ... Well before Felucca and Trammel, when you were safe in town and not safe out of town, people would run into town fully loaded and they would run to the bank. This was super early when you literally had to get inside the bank. So a couple of guys stuck a gate right inside the door way to the bank where you couldn't see it from outside. It was placed so that by the time the \"roof popped off\", it was too late and you had already stepped through the gate. And it used to be that gates didn't have prompt. So you stepped from the safe are of the city, out to the woods surrounded by a pile of dead players with PKs all around you. Before you know it, you are a ghost.\n\nOur first reaction when we were running the game was \"Those jerks!\", they are robbing all these poor innocent people. And the next minute I'm thinking \"Oh god, that's awesome. Those guys are super clever. That's a brilliant use of the system.\". They were murdering people as soon as they popped through the gates and this was at the main Britain bank, so there were a lot. This was just a train of people. By the time we realised what was happening they had murdered like 75 or more people. But the system allowed it.\n\n\nS: So you have to fix the system, not just those people.\n\n\nSL: Right, they didn't do anything wrong. It is really obnoxious but its not griefing really. Although some of the worst elements in that gang would then kill those people over and over. \n\n\nRG: If I can rip on that same that same thread. One of my favourite stories which also came from the early, wild west of days when it was really all hands on deck. We really had no idea the combination of catastrophe and success we had on our hands. All of us, myself included, would commonly join the help queue. I would go help people out as Lord British as it was fun. In this case, there was this woman repeatedly posting into the help queue saying she was a brand new player who had built a new character from scratch five times. Every time she would walk out of town, somebody would steal all of her stuff. She said the game was no fun and she's about to quit.\n\n\nS: We get that so much...\n\n\nRG: So thought I'd go help her out, to make sure she has a good game experience. I find her new character, show up as Lord British and she said \"Who's Lord British?\" ... Oh well ... And so I said, \"Fear not lady, I will escort you out of town and make sure you can get to your destination in safety.\" We take three or four steps out of town and some amazingly sophisticated player who was playing as a thief shows up.  He has macroed a level of movement commands that I did not know the game was even capable of, for all I know he might have had some speed hack going. He zips across the screen, I barely see him myself, steals everything the woman has on her and disappears off the other side of the screen, long before I can freeze him with a gamemaster command. I say to the woman \"Stay here!\" and teleport ahead three or four screens, I see the player, freeze him to the ground. I appear in front of him as Lord British and say \"How dare you steal from this poor lady who is just trying to start in the game. I want her to enjoy her time. If you do it again, I'm going to ban you!\" So the player begs for forgiveness and promises he will never do it again.\n\nI return all the stuff to the woman. And literally as soon as she has it all back in her inventory, the same guy zips past and steals all of her stuff again. I teleport over to him again, freeze him to the ground and say \"How dare you! I just told you never to do this again\". He player apologises and begs for forgiveness once more and promises he will never do it again. I warn him that's his second strike, third strike he's out.\n\nI go back to the woman, give all her stuff back. Zip. Here comes the same guy for the third time. I teleport over to him and freeze him. \"Okay, that's it, that is your third strike. You're out\". And then the guy breaks character and says \"Hey.. Richard Garriot ... I am playing by the rules. My character is a thief. I am using the skill tree you put into this game. If my thief is summoned by the king and told never to steal again, of course as a roleplayer I'm going to say I'll never steal again! But I'm a frickin' thief, what do you think I'm going to do!\" ... I thought, shit, he's right. So I teleported him to the farthest side of the planet.\n\n\nS: [LOL] We do that too...\n\n\nRG: I gave the woman her stuff back and escorted her to wherever she needed to go next. Then I go back to my team and say \"Oh my god, what have we done. What can we do about this sort of thing?\" On the one hand, you do want people to play as thieves but on the other hand you really do need new players to get into the game and not just be fodder for the experienced players. And that was always the struggle of those early days.\n\n\nS: That's a really great story.\n\n\nP: I wanted to ask both of you...\n\n\n===What is Shroud of the Avatar and how often does Ultima Online come up during day to day operations?===\n\n\n''[RG & SL chuckle]''\n\n\nRG: It comes up a lot! \n\n\nSL: Like literally every 10 minutes maybe. Our goal was to make a mashup between the linear, single-player Ultimas and sandbox experience of Ultima Online in one product. As if its not hard enough making one of those, so we had to try and make both of those in the same game - Because we're crazy! So of course Ultima Online comes up constantly because we basically trying to make another sandbox, immersive experience but with modern technology. The housing and commerce, the player driven economy, the classless system, those kind of hallmarks that Ultima Online had, that's the kind of thing you'll find in Shroud as well.\n\n\nRG: To add one little thing in there... When we finished with the Ultimas and started in on Ultima Online, we realised that telling a story in that environment was going to be frickin' difficult, so we really didn't tackle much of a story.  Yet the fact that it was being built on top of 20 years of story, gave it a framework for roleplayers. We really wanted to bring that back with Shroud of the Avatar. One of the problems we had communicating to our community, especially those who hadn't been there from the beginning, was that this was neither a sequel to Ultima Online nor was it a directly sequel to the single-player Ultimas. It really is a new kind of beast, which includes what we hope as some of the best thinking out of story telling and a lot of the open-world deep simulation but it also plays in this new mode, or set of modes, that we call selectively multi-player. You can play it completely offline because, frankly, I want to be able to play when I'm on an airplane or somewhere like that. You can play online but solo player where you still see all the shops and houses that everybody else makes. You can play online only with your friends so you still see the whole persistent evolving world but you get to just play it as a group. Or you can play it like an MMO, in this fully open setting.\n\nOne of the interesting issues we always have is people looking for the spiritual successor to Ultima Online, they are always complaining when we spend too much time on the offline or solo player story stuff. Really, each group will complain when we spend too much time focusing on one aspect of the game. Whereas we see it as one continuum, all in the same field. You can play all these things concurrently. The story is not incompatible with living in a sandbox world.\n\n\nP: This is a question for Richard...\n\n\n===With hindsight, would you sell UO again if you went back in time?===\n\n\nRG: We sold Origin prior to UO, so I presume that question means would I have sold Origin. Well its tricky to answer that question because even with the hindsight, the reality of that time was that it really would have been impossible not to. The only thing we really could of changed is who we became partnered with. We looked at other companies but at that time EA seemed to be the best choice. You can debate whether EA may or may not be worthy of their regular winning of the most evil company awards but clearly some things didn't go so well when being a part of them. Despite the fact that Starr and I had to bitch and moan and stomp our feet to get UO made, I'm not sure it would have been any easier with any other big partner as the parent company. So its hard to say we could have fixed that.\n\nThere are really only two things in my whole career that we did badly that I wish we could change from a developer standpoint. One of those was Ultima 8 when EA convinced me that we should cut the game in half in order to shorten the schedule by 20%. That was a mistake. We should have kept the other half and delayed the release by whatever was needed. The other one was in Tabula Rasa, we burned a couple of years at the beginning when we thought we had a chance of making an international partnership with our Korean partners. We spun our wheels for quite a long time and then the Korean part of our team departed and that basically made it impossible for us to continue that international partnership. That put the project way over budget and way behind schedule because of false starts. \n\nBack to Origin, even with hindsight there was no way we would couldn't have become part of a big company. We had to do that. Yes its unfortunate that there were some side effects that weren't particularly useful but that's the die we were cast.\n\n\nSL: The reality is, if Origin hadn't been sold to EA, its very unlikely that Ultima Online would have been made at all. Origin would not have had the capital to do anything beyond what they were already doing. It is extremely doubtful that they would have been able to expand beyond the linear single-player experiences and do something as risky as making an MMO when no one had made an MMO. As much as EA gets a bad rap, I would say UO and therefore the MMO industry as we know it, would not exist. So big props to EA - You've done some bad things but you gave us MMOs. We can forgive you almost everything else....\n\n\nRG: Almost, not quite everything...\n\n\n''[LOL]''\n\n\nS: So I have a question myself... I've always felt that that what makes Ultima Online so unique is that it a living layer type system which means that if you move one small layer, it has the ability to affect many other layers which can then affect a great portion of the player-base or change the overall feel of the game. \n\n\n===Was the layered, interconnected system intended?===\n\n\nSL: A lot of that was thought out. Raph Koster really wanted the intricacies  and the interactions, those layers of the economy and the dependencies between things like skills. Some of it happened by accident because when you build really big complex systems, it is literally impossible to have all of the outcomes forethought. But the general idea. that those things would interact with each other in complex ways, that was absolutely the goal.\n\n\nRG: It is also worth pointing out that there were many that did not work. Either because they were fundamentally non-balanceable or the other is another one of my favourite my favourite stories of UO. It was an entire system that we spent person-years of time on, I suspect, and a lot of money on, that was not noticed by anyone and couldn't have been noticed by anyone, and was eventually just ripped out of the game.\n\nPrior to the beta and launch, we were developing it as a modest sized game with a modest sized QA staff, and we were smart enough to realise that we were never going to be able to create content than players were able to consume it. We assumed we would have thousands of players, maybe not tens of thousands or hundreds of thousands, and a team of 10, 20 or 30 people is never going to be able to keep up with the voracious consumption of players. So we tried to put in automated systems with which to generate quests or tasks.\n\nOne of the ways we tried to do that was to create a virtual ecology. Where, for example, the grass that I see behind the castle and that you see throughout the land, would actually generate a herb crop that all the herbivores, like the deer and the sheep, would eat. A randomly spawned sheep would wander around randomly but also seeking those resources. If they found lots of grass then they would reproduce and more sheep would come into the world. Where players would build houses so that no grass was around any more, the sheep would naturally die out. Then we'd spawn wolves and bears, up in the mountain tops. They would wander around and look for meat to eat. The nearby meat might often be a deer or a sheep and they would go off and eat that. If a player cleared all the herbivores in an area, then the carnivore might wander all the way into town. If a wolf or bear ate a villager, a quest would popup saying that the wolves were attacking the town. We assumed most people would kill the wolves and then sheep would begin to spawn again to bring it all in to balance.\n\nThat worked great while there were no players in the game. The world was naturally balanced and could demonstrate just what I said. We were pleased with the way it was evolving. However, as soon as we invited in a number of players, the players killed everything. And so every sheep, every deer, every wolf, every bear was killed within moments of it being spawned. If we tried to crank up the spawn rate, all that meant was that players were killing faster. It was like ants running all over the surface, completely obliterating the natural ecology of the world. Once we realised we couldn't crank it up or balance it, we just removed it. The whole idea was just removed from the game after all that effort.\n\n\nS: We've got one more short question left and Starr has to head out.\n\n\nP: Based on your game experience...\n\n\n===What would you recommend for Ultima Online Forever to create, expand and assist the longevity?===\n\n\nSL: That's a great question. You guys have made it 5 years and that's amazing, so you're doing something right. One thing you are doing successfully is working with your community. Going back to what we were talking about where the game becomes less of a game and more like a government. One of the important lessons we learned early on about that was, just like in a real government, you really need to listen to your constituents. You really need to make sure that what you are doing is for the greater good. You can't just listen to the loudest people. You can't just listen to the people who want the thing that is most fun because the most fun thing might crater the economy or might make everything too easy. Those all have parallels with how the real world works - Sure we could have zero taxes but then we'd have no roads. You have to make those same kinds of decisions when you are running a world like this. Sure you could make all creatures have 1 hit point and die with 1 hit but then there's no challenge.\n\nAnd always make sure you are taking the subjective data from what your players are saying and matching that to objective data. Making sure you have metrics so that when they say they don't like something, you can go and look at what the data says. One of the earliest complaints we had on SotA was that one of the low level spells you learned, like ice fist, didn't do enough damage. So we looked at the code and yea while they the spells don't do much damage, they also don't use any reagents, they are insta-cast and they have no cooldown. If we increase the damage, you'd be able to just wade through anything because there's no cost and no cooldown. And the metrics showed that those spells were used more than any other spells. If we had just listened to what the players were saying and upped the damage without having re-examined the metrics, it would have been catastrophic. That's my general advice.\n\n\nRG: Mine is similar in vein... I'm going to talk about keeping everyone equally unhappy which is a phrase we hear around our office with some regularity. Shane, as you'll remember I mentioned to you, that I had people reaching out to me about what people had been saying about each others products or services... I think its so funny that if you look at our Steam early-access page, the people who have been with us from the beginning and know how hard we have worked to get here, they all seem to be pretty happy with us.\n\nBut not so for the people who join midstream or a year ago, when Shroud of the Avatar was really broken. Despite the fact that it described itself as being early access, still people would buy it and complain about the exact same thing we tried to warn them about. And literally just today, someone had been banned form our forums and were complaining about how overly moderated they were and how they weren't saying bad, they were just disagreeing with devs, and how outrageous that was, their whole guild was outraged and that they really didn't do anything wrong... I shared this with out team and the immediately said that this guy was foul-mouthed and well deserving of a ban. And just now, I had some of your trolls come and try to convince me that we, I or they should be trolling you... I thought \"Please guys, give it a rest!\" We're here trying as hard as we can to provide entertainment.\n\n\nS: We're in such an age of that trolling, that trying to keep a positive environment in your game is a full time job. You could have a team just trying to keep the positivity up with PR work and snuff our negativity straight away.\n\n\nRG: When we first started on Ultima Online, we considered the Bartle'ss four player types (https://en.wikipedia.org/wiki/Bartle_taxonomy_of_player_types) a lot which was something we learned about from Raph. \nRichard Bartle noticed in some of the early online communities, and I think it still applies today, that you have: The Achievers, who want to win, a lot of PvPers are achievers who want to reach the top of those kind of ladders; The Explorers, who want to see everything there is to do an understand all the skill trees, been everywhere and seen everything; The Roleplayers, who are happy to be the blacksmiths and miners and other sorts of things, they don't want to win, they want to speak some thee's and thou's and real stake in the flow of people that come by; and, what I call, The Dissidents, who have fun by knocking over the table, literally spoil the fun for others, messing with other people having fun - What's interesting is, you really can't stop those people. Dissident behaviour is in many ways trollish behaviour. But what I find interesting is that you really need to give them an outlet. If you just try to play whack-a-mole and push them down, that's kind of fun to them because they get your attention...\n\n\nS: You are feeding them...\n\n\nRG: ... You are feeing the trolls... You have to find another way not to feed them and instead give them another outlet. For example, we rarely go on Reddit, because that's where all the banished trolls end up ...\n\n\nS: [LOL] Its like we're talking to our own team right now. Its incredible, the similarities are insane. \n\n\nRG: They are exactly the same. Like I was saying, I just saw trolls coming to slam us totally ahead of this and I thought, yea its all the same - Its been like this forever. Its not just this gathering. I don't know how you moderate your forums - this might be an interesting dialogue versus question.\n\nOne of the things we do, in contrast to say the World of Warcraft forums, because or especially because are in development, we are actually soliciting feedback. We want to know your opinion - Is the combat balanced? Is the storyline fun? Have we fulfilled providing something that inspires virtue or otherwise? Is it a deep enough sandbox to feel like a worthy successor to Ultima and Ultima Online? We want people to weight in on that. We don't mind people saying, \"You fell well short of that, you are nothing like what you claim you are going to be.\" If somebody comes in and says \"Ok, that's important feedback, I needed to know it\" and whether or not I agree is less important as long as the feedback was honest and sincere. There's no harm done if its told in this way. On the other hand, if they come in and saying vulgarly \"You guys are a bunch of dirty word, dirty word, dirty word, dirty word ... You're ripping me off and I'm going to sue you and I'm going to send somebody to shoot your children\" then I'm going to ban them for that. That is not tolerated. We have a zero tolerance for threats and vulgarity. Those people we ban.\n\nIf you look at the World of Warcraft forums, they don't allow you to have any critical feedback at all. Compared to other big games, we feel we are lightly moderated but we still have lots of people coming up and complaining about how they got banned for no good reason, when in fact we have a nice paper trail of their offences. \n\n\nS: I agree with you on that. Hold on one second here, what's going on with JoeB in game...\n\n\n===Rainz!===\n\n\nRG: Ah, somebody found a backdoor? \n\nP: Oh wow, it looks like its Rainz. \n\nS: Is that Rainz?\n\nSL: Yea someone was claiming that he was Rainz earlier.\n\nS: Is that a fire field? \n\nSL: Should I step in it?\n\nRG: Don't forget we're immortal Starr. \n\nSL: So I could probably just step in that right?\n\n''[Starr walks towards firefield]''\n\nRG: I'm not sure I'd trust that Starr. Wait wait, no no...\n\nSL: Rainz is coming through, he's coming to redeem himself.\n\nRG: How'd he get up on that stage?\n\nP: Uh oh, what is Rainz doing?\n\nSL: He won't be able to hurt me will he...\n\n''[Rainz lays the smack down on Lord Blackthorn]''\n\n''[Much shock and laughter]''\n\nSL: Whaaaaat... Impossible!\n\nS: Rainz strikes again!\n\nRG: Hey, can we loot that corpse?\n\nSL: Now we can both say that we have died at the hands of Rainz. A truly historic moment.\n\n''[Much laughter]''\n\nRG: Outrageous! Outrageous! \n\nS: We have to get him resurrected back up here.\n\nSL: Are you going to slay everyone with demons like I did or show some restraint? \n\nRG: Oh, I wouldn't show restraint. When the roles were reversed, it was basically the end of all visitors.\n\nSL: I have to share my favourite anecdote real quick about that story. You had a person who was a not particularly mentally stable person break into your house before you were killed in the game. So there was already some concerns about stalkers and unstable people. When you were killed in the game, someone ran down the hall saying \"Richard is dead\". So there was a moment where a few people in the office who did not know whether they were saying Richard was dead in the game or literally dead in the real world, killed by a crazy stalker. That's a little know part of the Rainz-Lord British incident that doesn't get told very often. \n\nRG: Of course Lord British being dead is something that happened in every Ultima since everyone always loved to kill Lord British. But it was a miracle that Lord British had gone through the entire beta process without being killed. \n\n''[The Dissidents strike, spamming the screen]''\n\nP: As you can see and as you were mentioning, the trolls have come out. \n\nS: Well, we'll take a 10 minute break and say farewell to Starr. We can't thank you enough for being a part of this. \n\nSL: Thanks, its been great!\n\n==Five Year Beacon==\n\n[Event returns with the unveiling of a beacon outside of Lord British's castle]\n\n\nS: Outside here we have a beacon - a 5th year beacon which we'd like you to light. If you double click the blaze torch in your backpack and then target one of the braziers.\n\n\nRG: Let me just offer a congratulations and off we go...\n\n\n[Lord British lights the 5 year beacon]\n\n\nRG: As Starr was saying, the fact that you've made it past the 5 year mark  is not only an amazing feat which you deserve much praise for but its also means that as long as all your hearts stay in it, at least it implies to me, that there is no expiration date on your future. As shown by many MMOs, once you've reach a critical mass of players and the community stays committed to the team and the team stay committed to the community, then you can probably sustain it literally forever, as your name suggests... \n\n\nS: Ultima Online Forever, thank you very much. We can't thank you and Starr enough, this is incredible. We grew up playing your games so having you here is amazing and I can't show my appreciation enough here. And I can't thank our players and foremost our team enough. The team I have is absolutely incredible. There no way I could do this myself. It takes a team and everyone on this team brings something to the table. And every piece of that is very valuable and I appreciate that a lot.\n\n\nRG: Reflecting again something that Starr was saying about how its as much governance as it is development... One of the early lessons of Ultima Online was, the 30 or so people we had in the core development team or the 5 of you here, compared to the hundreds we have here on screen, it becomes difficult to respond to every message you receive. It becomes easy for the community to think you aren't listening or don't care. For us in the early days, we found everyone to be complaining about basically the same thing, the server instability, the lack of balance, etc. There definitely a clear list of complaints but we didn't have any way to communicate with everybody. We couldn't really go to each person and say I hear you. We had to instead deal with all the guild leaders and town leaders, in the same way that real world communication works - No that many people speak directly with their president, or their senator or their congressman. But everyone can talk to the PT at their school and their community organisations and then all that data feeds up and down in both directions. So the fact that you've done so well here already for 5 years implies that you have also learned those lessons and its obvious you have a healthy community here. Its a pleasure to see and be a part of. \n\n\nS: Some day soon we hope to return the favour to Shroud of the Avatar. I knew there were some similarities but hearing you talk tonight about dealing with the community and game, it literally felt like it was the staff talking amongst ourselves.\n\n\nRG: I don't know if you can see this behind me. This computer right there is the original Apple II.\n\n\n''[Staff nerdgasm]''\n\n\nRG: And it is actually running Akalabeth. And there's an older teletype machine that is currently in a museum that I wrote my first game for which I called D&D1, obviously as an homage to Dungeons and Dragons. And we've actually built into Shroud of the Avatar a teletype and we gave that code to the community and they ported it into Unity to put it in Shroud of the Avatar. So the point is, we already have one historic game playing in Shroud of the Avatar... You never know, we might find a way to shell out from Shroud of the Avatar into Ultima Online Forever. \n\n\nS: When I first tried Shroud of the Avatar a year ago, I was kind of shrugging it off but when I tried it again recently I was really impressed and it has already come a long way. Do you think you jumped the gun with the release or do you think the alpha stage release worked out?\n\n\nRG: We've been live for 50 months.\n\n\nS: Wow, has it been that long?\n\n\nRG: Yea so let me describe why we released so early. We were very pleased to be the second largest crowd funded game in history. Kickstarted brought in 2 million dollars. In theory, if people chose not to continue giving money after Kickstarter, we would have to deliver a game like we had promised for 2 million dollars which is going to be hard!  And we knew it would be hard and that our ability to bring in money from other users was unknown at that time. So there was some chance that we would fail to deliver that product at all. There are plenty of Kickstarters that don't ultimately deliver because they run out of money or bite off more than they can chew.\n\nFor us, the worst thing we could imagine would be to take money from our hardcore fanbase and not only fail to deliver them a game but if they thought that we were paying ourselves sweet salaries, occupying really nice offices or not creating the features they thought we were creating with their money - any thing like that - we thought would be worse than an embarrassment. So we made sure at every standup - we're an agile team that does a stand up meeting - as soon as we had that standup, we'd publish the notes to all of our backers.\n\nStarr writes up a plan from these standups of all the features that we are planning to release. He also writes up a post mortem every month to show the tasks that were completed. He adds in italics the things that were emergent that we didn't think of and did them anyway. And he leaves on there the tasks that got pushed and didn't actually make the delivery. And everyone can see that - We're very transparent about every penny and how it is being spent. Then we also decided that from the first day we could, we'd release it to the players so that they were at least having some fun with us along this ride, to give them as much entertainment as we could even if the project failed after 10 months.\n\nThe first release was literally what we called the Chicken Room. It was a room with a chair in that you could sit on and stand up, a torch you could turn on and off and a chicken that if you walked into it would go cluck, cluck, cluck and then walk away from you... And that was it. That was release 1. One month later, instead of being a room, it was a town. You couldn't leave the town but it had buildings and paths, trees and NPCs. You couldn't interact with them but at least you were in a town. Month 3 you could talk to them. Month 4 you could kill them. Month 5 they had conversations. Month 6 they was a shop you could buy and sell things from. So the players who joined us from Kickstarter knew that every month there was something significantly better than there was before.\n\nBut what you experienced is what a lot of the Steam players experienced. If you didn't know that it started with a chicken room, you'd think \"Why is this game in early access, it is completely broken\". But what you saw already kind of looked like a game, so you were frustrated with the game. \n\n\nS: I think that created a lot of hype. Believe me, we've been through the same thing. If I say \"Kingdoms 2016\", there will be a lot of chuckling. So what's the gameplan?\n\n\nRG: We're launching our first release candidate in March. We did a big fundraising push last summer and we're going to be doing a big marketing push here in a couple of months. We've had 65,000 backers who are with us. A few thousand of those players have been playing ever since the first month. There are many who are waiting until we have release one, a full release. We think that we've only tapped about 20% of our audience. That's based on going to shows where we don't pay for our booth but we piggyback on someone else's booth - Like Razer for example. And they'll have a bunch of games setup. If someone likes the look of ours and asks for an early access code, we first ask the two questions: 1) Have you heard of Ultima before - the answer is usually 50/50; 2) Before right now, have you heard of Shroud of the Avatar - And usually 80% have not heard of it before. So 80% of the people who self-select our game having not heard of it before. We're confident that we'll pick up more players with a good marketing campaign. \n\n\nS: Without good marketing, you can have the best product in the world but it won't mean anything if no one sees it!\n\n\n''[Richard nods]''\n\n==Invasion==\n\nS: So next we'll start an invasion here...\n\nRG: Outrageous! Who's invading? How dare they!\n\nS: There are some evildoers, some creatures from the shadows.\n\n[Invasion begins]\n\n[Lord British rolls back the years and lays the smack down on the invading monsters]\n\n[Much monster slaying]\n\n[Lord British turns grey looting a blue corpse, much to the delight of the staff]\n\n\n==Cheers & Farewells==\n\n\nS: We're going to leave the stream shortly. Richard, you are welcome to keep killing the monsters here. I'd like again to thank my staff, without you guys none of this would be possible. Richard Garriot, having you and Starr here was absolutely incredible - We can't thank you enough! Perhaps we will be able to return the favour to Shroud of the Avatar some day. And thanks to all our viewers and players, the community here is absolutely amazing. Some of them really go above and beyond. Thank you all so much. \n\n\nRG: If I may throw in a parting comment here too. Thanks for having me and Starr. We were excited when you all emerged on the scene 5 years ago. Its very obvious how much its grown. I'm thrilled to be here with you today, thrilled to meet the rest of you on the team, thrilled to be here again with the community. I too look forward to future collaborations, where perhaps we can show up in each others games or switch roles, whatever it takes. We're all in this together, celebrating this unique style of gameplay. Congrats on 5 years and here...\n\n\n[Richard raises his brandy milk punch, Ultima Online Forever raise their drinks]\n\nRG: Here's to the next 5 years and the 5 after that and on to forever. Cheers!\n\nS: Salute!\n\n[Drinks are quaffed and the event ends]"
          }
        ]
      }
    }
  }
}