{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "3582": {
        "pageid": 3582,
        "ns": 0,
        "title": "Accounts",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Help]][[Category:Guides]]\n[[File:Accounts_Login_Preview.PNG|thumb|The Login Preview of the Account Login Page of the Ultima Online Forever Client.]]\n\n__TOC__\n=Accounts=\nIn order to play on Ultima Online Forever, you will first need to create an account in order to create characters and play the game. You may have up to 3 accounts per IP/Household and each account will need to be verified through an email account as well. \n\n==Creating Accounts==\nAfter you have installed the UOF Client, you will need to create an account by typing a new unique Account Name in the Login ID field and give it a new password.  The Account name can be up to 16 characters long and must be unique! If the Account Name is available and you have provided a password it will begin creating an account:\n\n[[File:Accounts_Login_Menu.PNG|The Login Menu that has the Login ID, Password, and the ability to save your Account Name and turn on/off the Music that pays when running the application.]]\n\nYou can reach this wiki page from the \"Help\" button in the Ultima Online Forever shown in the picture above!\n\n==Validating Email==\nOnce you log in and create your first character you will see the Email Validation menu and your character will be Invulnerable (not attackable) and frozen in place until the email has been validated:\n\n[[File:Accounts_Login_Frozen_Message.PNG|You are frozen message that occurs before your email has been validated.]]\n\n[[File:Accounts_Login_Invulnerable.PNG|You are invulnerable while until your email has been validated.]]\n\nFirst, you will need to provide your email account into the Email Validation Menu:\n\n[[File:Accounts_Login_Email_Validation_Menu_Step_1.PNG|First, you will need to provide your email account into the Email Validation Menu.]]\n\n[[File:Accounts_Login_Email_Validation_Message.PNG|The email verification message.]]\n\nSecond, you will need to give the Verification Code that has been sent to the email address you have provided:\n\n[[File:Accounts_Login_Email_Validation_Menu_Step_2.PNG|Second, you will need to give the Verification Code that has been sent to the email address you have provided.]]\n\n=Discord Linking=\nAfter you have validated your email, you can link your in game account to your Discord account which will allow access all the chats including the buy/sell and vendor threads in [[Discord]]. \n\n==Link==\nTo link your discord, you must be logged into the game on a character that you which to use as a your [[Discord|Discord Nickname]] in the Ultima Online Forever Discord server. After you are logged into the game, type !link in #landing-pad channel which the UOForever Bot will see and send you a direct message in [[Discord]] asking you to type your Account Name:\n\n[[File:Accounts_Login_Discord_Link.PNG|The !link command used to initiate the linking process of your in game account to DIscord.]]\n\n[[File:Accounts_Login_Discord_Validation_Bot_Message_Step_1.PNG|350px|After you are logged into the game, type !link in #landing-pad channel which the UOForever Bot will see and send you a direct message in Discord.]]\n\nAfter the Bot verifies that account, the bot will ask you to copy/paste the code into the Discord Validation Menu in the game:\n\n[[File:Accounts_Login_Discord_Validation_Bot_Message_Step_2.PNG|350px|After the Bot verifies that account, the bot will ask you to copy/paste the code into the Discord Validation Menu in the game.]]\n\n[[File:Accounts_Login_Discord_Validation_Menu.PNG|The Discord Validation Menu in the Ultima Online Forever game.]]\n\nIf you're having trouble linking, you can always reach out for help in the #Landing-pad or #help channels in [[Discord]]. The most common issue is related to the [[Accounts#Discord_Security_Settings|Default Discord Security Settings]] that the Bot will need resolved before you can receive direct messages from any Discord Bots.\n\n==Unlink==\nIf you would like to change your [[Discord]] nickname to another character name you have on that account, you can use the \"!unlink\" command in the [[Discord]] server, then you can relink it by using \"!link\" and following the process again.\n\n[[File:Accounts_Login_Discord_Unlink.PNG|The !unlink command used to remove your name and access to the link-level Discord channels.]]\n\n[[File:Accounts_Login_Discord_Unlink_Message.PNG|The !unlink message from the UOForever Bot after a successful unlinking.]]\n\n=Help=\nHere are some errors you may or may not run into during the process and how to resolve them:\n\n==Incorrect Password==\nThe Incorrect Password message will show when the wrong password is given to an account name in the login screen. Check the spelling of your account name and password and try again.\n\n[[File:Accounts_Login_Password_Failed.PNG|The Incorrect Password message that occurs when the wrong password is given to an account name in the login screen.]]\n\n==Unable to Create New Account==\nThe Unable to Create New Account message will show when you have tried to make too many accounts, or a generic error occurs when making a new account.\n\n[[File:Accounts_Login_Unable_To_Create_New_Account.PNG|The Unable to create ne account message from the login creation process in Ultima Online Forever.]]\n\n==Too Many Login Attempts==\nThe Too Many Attempts message will occur if you have tried to log into Ultima Online Forever too many times. There is a 10 minute delay before any new attempt will register, so you should take a break, check your credentials, make sure you are under the 3 account limit and try again in 10 minutes.\n\n[[File:Accounts_Login_Too_Many_Attempts.PNG|The Too Many Login Attempts message that occurs when attempting to log into Ultima Online Forever too many times.]]\n\n==Discord Security Settings==\nIn order to receive messages from the UOForever Bot, you can set your privacy settings globally to allow direct messages:\n\n[[File:Accounts_Discord_Security_Allow_Direct_Messages_Accountwide.PNG|350px|Account wide allowing of direct messages in Discord.]]\n\nOr you can set the security setting on the UOForever server only via the context menu and security settings:\n\n[[File:Accounts_Discord_Security_Allow_Direct_Messages_Serverwide_Context_Menu.PNG|Server specific context menu for allowing of direct messages in Discord.]]\n\n[[File:Accounts_Discord_Security_Allow_Direct_Messages_Serverwide_Privacy_Setting.PNG|350px|The Privacy Settings on the Ultima Online Forever server to allow direct messages from server members.]]\n\n=Rules=\nAll the rules that come along with the Terms of Service can be viewed here: https://www.uoforever.com/rules.php\n\n==Account Related Rules==\n* You may have THREE (3) game accounts PER IP/HOUSE HOLD (1)\n* Sharing accounts is NOT ALLOWED. Do not give your account information to any other player for any reason. Doing so will put all parties linked accounts at risk of banning.\n* DO NOT name your characters using connotations for racial slurs. Characters with a racially offensive name will be renamed. New names will be chosen by an admin.\n\n==Multi-Clienting Rules==\n* MULTI-CLIENTING in Player VS Player situations is forbidden. You may only have one character engaged in world Player Vs Player at any given time.\n* Using online services to bypass the three (3) account rule is strictly forbidden.\n\n=Contributors=\nThe community would like to thank the following brave adventurers who contributed their time and experiences for others to enjoy:\n* Skye\n* Smil"
          }
        ]
      }
    }
  }
}