{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "2321": {
        "pageid": 2321,
        "ns": 0,
        "title": "AMA 5Year",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "J: Joe\n\nE: Eppy\n\nS: Shane\n\nF: Fay\n\nP: Pat\n\nD: Doggo\n\n\n''[BEEP BEEP!]''\n\nE: Someone backing up a large truck?\n\nJ: That's my oven cookin' up some broooownies.\n\n== AMA ==\n'''1. How do you arrive at decisions regarding new content?'''\n\nS: I think it goes based off all of our experience from previous servers or from playing back in the day on OSI. If it was done before, will it work out for us. We know our player base, we have a pretty good idea what people do or don't want. Development wise that's a whole different ball game.\n\n\n'''2. How did you get Richard Garriot involved in a player run shard?'''\n\nS: I had his contact from long ago. We've kept in contact over the years. He was more than open to it. He's a very easy going humble guy.\n\n\n'''3. Will there ever be a Meta Crafter?'''\n\nS: I've told some people before that there's plans for a Meta Crafter but its not going to be what anybody thinks. Its not like a pet or talisman. Its kind of like a suit that only crafter can wear and you build on the suit. Its like a mecha suit but I don't like the word mecha. I forget the word we came up with.\n\nD: WOOF! WOOF!\n\n''[Lost Sound]''\n\n\n'''Begging at Donation Vendor'''\n\nE: But it was crashing a lot of people. It was because of the speech hue on some of the vendors, when they were speaking it crashed some people.\n\nJ: Its an old April Fool's joke.\n\nS: What was that for?\n\nJ: The begging on the dono vendor:\n\nS: Yea it actually did end up crashing the server. Adam said \"You'll never believe what is crashing the server\". Just unreal, who would have thought.\n\n\n'''4. Eppy breaks protocol and doesn't read the question!!! Something about boats?'''\n\nE: There's a bunch of questions about boats. People like boats I guess. I don't know what to say about boats really. We added the new boats and the water champ. I think it works pretty well now. But adding more stuff, that's not really on my plate at the moment.\n\nS: Could do more with whirlpools maybe.\n\nE: Yea whirlpools are pretty easy to add too.\n\nS: It would be more to add more SOSs too.\n\nJ: I really wish we could get melee mobs to board the boat.\n\n\n'''5. Name change deeds'''\n\nE: I don't think we have any desire to do that whatsoever.\n\nJ: Nah.\n\nE: I guess that's a fun topic really. I guess people would expect us to do that eventually but I think it has worked really awesome not having them personally.\n\n[Something E has to come back to developing, needs harder mobs]\n\n\n'''6. Making levelling easier'''\n\nP: Quite often we have double XP and skill gain. I would just grind during those times.\n\nE: I've been looking at all the things you have to macro all the time. I'd like to get rid of more of those things. Especially things like crafting slayers which is just a crafting macro grind. Things like that which are super boring should be changed in my opinion.\n\n\n'''7: Where is the future of UOF going to?'''\n\nP: There's endless possibilities! I'm sure that's not the answer you wanted to hear.\n\n\n'''8: Can we get poison arrows?'''\n\nP: No. You cannot.\n\nS: Why?\n\nP: In a PvP sense, no. I know we talked about an archer talisman. That was one of the possibilities. There are quite a few options there like piercing, frozen arrows, stuff like that. I don't really know where that went but we did talk about it.\n\nE: The zerker infected wounds relic works with archery.\n\nD: Woof!\n\n\n'''9. Something about who has most gold?'''\n\nE: I actually have no idea. You can check their gold but that's not...\n\nS: Yea, you gotta add up all their houses.\n\nP: Probably Duck Face.\n\nS: Yea, that guy has a lot of stuff.\n\n[Beard & Flannel Shirt talk]\n\n\n'''10. New dono items'''\n\nE: We have to add Fay's dono stuff - We know that. It is ready to go, we just need to put it in the game.\n\n\n''[Live banning action]''\n\n''[Much not reading questions...]''\n\n\n'''New Art'''\n\nE: Not many people are willing to make UO art. It's a little rough.\n\n'''Shadow Elementals'''\n\nJ: We got rid of the shadow elemental XP because people were abusing them, right Eppy?\n\nE: Yea they were trying to sit there and macro on it all day.\n\n'''Locke Cole Statue'''\n\nE: We actually do have the Locke Cole statue fixed, we just have to add that to the launcher.\n\n\n''[Mic chat]''\n\n''[Super trippy echo begins]''\n\n\nF: Someone is still breathing on the mic ಠ_ಠ\n\n\n'''11. 120 Bowcraft'''\n\nE: I've kind of thought about doing that, giving them out as rewards. I can't see a whole lot of points in 120, who uses heavy crossbows anyway.\n\n\n'''12. Wedding Deeds'''\n\nJ: Eppy do you have any comments on that?\n\nE: I don't know what they would let you do. Someone once said it could let you teleport to the person once per day. I just don't know how that would be useful.\n\nP: I've always loved the idea of UO weddings, back in the day those were so much fun. The issue is finding out if its realistic or not. 90% of the time its just a troll.\n\n''[Lost sound]''\n\nE: So weddings deeds and divorce deeds is what the crowd wants. UO weddings just turn into troll events on UOForever. I think we've had a couple.\n\nJ: We ruined the wedding area didn't we with someone's tree house over there? We're going to have to move that.\n\n\n'''13. Poison Cakes? and Tinker Traps'''\n\nP: Poison cakes? I think you can make them.\n\nE: I would really like to do tinker traps but I'm afraid it would turn into nonstop trolling.\n\n\n'''14. PK Groups'''\n\nE: I don't think we favour PK groups at all.\n\n''[Headphone chat]''\n\nE: I can't believe you don't like the steed firebreath\n\nJ: Firebreath steed, what do you mean by that?\n\nE: I guess because I trolled them with a 1 damage firebreath but I did make the firebreath the same hue as the steed.\n\nF: Someone's breathing on their mic...\n\n''[Echo disappears...]''\n\nJ: I'm going to drive to Canada and slap you Shane and then go hang out with Pat.\n\n\n'''15. New landmass for house'''\n\nJ: Build new landmass for housing? I don't know about that.\n\nE: I don't know that we that short on houses.\n\n\n'''16. Militia capture point in the ocean'''\n\nE: I think we need some more people in Militias before we tackle that. I'd like to re-do some of the capture points. I don't like how they work that much.\n\n\n'''17. New Art again'''\n\nF: The new art is in the game, its up to Shane to decide when he wants to release it. If anyone has any ideas of something for me to add, just let me know and I'll work on it.\n\n\n'''18: BODs are mind-numbing'''\n\nE: Yes I know how mind-numbing it is to do Bulk Order Deeds.\n\nJ: But that's the way its always been.\n\nE: If I could change them, I would do that. If people wouldn't freak out, then I would just let you get them one after another but that would require you to actually fill all of them.\n\n\n'''19. Will melee tanks be a viable option in the future, the magic mitigation is a problem when fighting harder difficulty mobs.'''\n\nP: I think that's what the resilience talisman is for.\n\nE: Yea and slayer armor. If you have slayer armor and a talisman you can pretty much take on anything you want.\n\n\n'''20. Any updates on militia perk to allow gate/res with less fail rate?'''\n\nE: Yea we can do that but what would the cost be. 1 bounty per attempt would be reasonable but it would still be expensive. I would have to up the bounty rate from capture points. Its no big deal to implement though.\n\n\n'''21. Changing Monster of the Month spawns.'''\n\nE: I don't think we need to have it as common monsters every month. It gets people to go different places. Ettins and Earth Eles are probably the worst months for me. I know its probably more fun but drop chance is so high that when you kill a million a month, it can really lower the relic market quite a bit.\n\n\n'''22. Are there any plans to change the murder head bounty system to more risk/reward?'''\n\nP: I think this is referring to perma-stat loss as the more risk but I'm not sure what the better rewards would be. I know there's been discussion of a points system that lets you turn in heads and you can use those points to get something but that system can be abused quite easily. To answer the question, there are no plans.\n\nS: [Talks a lot but is muted]\n\nP: Hold on Shane, they can't hear you.\n\nE: The only thing about stat loss, you'd have to keep taming out of it. Which we can do, its not a big deal. I don't think its practical to lower taming like that.\n\n[More muting shenanigans. Eppy heckles Shane.]\n\n\n'''23. Owner only refreshes house'''\n\nE: I don't know that that would ever work out. Its an ok idea but it would annoy me personally quite a bit having to refresh with the proper characters. \n\n\n'''24. Could there be a raffle to have a stable master for your house?'''\n\nP: I don't really know how I feel about that. I don't hate it.\n\nS: It's not a horrible idea. We'll definitely never do bankers.\n\n\n'''25. Is there any chance of a reward for infected wounds?'''\n\nE: I've redone that once. I don't know what to do with it that won't make berserkers even more ridiculous than they already are. They are pretty much the best damage in the game - They are right up there with Quicksilver. Adding more to that would make it even more unbalanced. I did have some code in there to spread the infection to other mobs in the area. But if you take that to a champ, you are going to get giant scores.\n\nS: Once of the first things we do when we want to implement something new is try to understand how will people break it or how will people abuse the system. \n\nJ: Half the time we do think like that and they still find another way!\n\n\n'''26. T2A'''\n\nP: I don't think we have plans to open T2A lands.\n\nS: I would rather open up a different land. Anything other than T2A. The spawns aren't great, the towns are meh. I'd rather design our own land, like we did we with Booty Island. I think we could use T2A for an event, like we do for the Zombie event which we can now also run more often.\n\nP: Quite a few people say T2A sucks\n\nS: I liked the gameplay but its tough to mix T2A and UOR.\n\n\n'''27: What was the rationale for removing factions and do you consider militias a successful replacement so far?'''\n\nS: Factions was removed because we worked on it more than any other system and still at the end people weren't happy and weren't using it. New players were scared of the system as its very in depth. To learn all about it took a long time. We wanted to go back to a base system. Militias isn't there yet but it will get there over time.\n\nE: We had a lot of issues with factions. It was causing tons of pages. It got pretty old honestly. Other things just weren't being used like the sigils. It took to long to do them. I want something quick, something people can do in 2 hours. Most people that log on here only have a couple of hours.\n\nP: Factions on paper is a great system but in reality it never worked out as intended. Sigils were never capped. On paper the idea was that you could join a faction with other people you don't know and work with them. But in reality that never happened. So we converted them into a guild militia where you can fight with the people you have always fought with in the game. There's still a lot to be worked on, like more capture points. We're open to suggestions.\n\n\n'''28. ZOMBIE LANDS'''\n\nE: We do need to run it more than once a year but the problem I have with it, as with many big events, is the rewards. You end up with a couple of people powergaming the crap out of it, ruining the rewards for everybody else. I think we have to come up with a different way of doing that.\n\nJ: Rewards are a nightmare.\n\n\n'''29. Is there anyway the town politics system could be added back in?'''\n\nP: I agree it was a cool fun thing in factions. I imagine the code is pretty complex but its definitely an option.\n\nS: We want people to get into PvP and making a system way too complex is not the way to do that. That's how I feel. We have to make it easy.\n\nE: I don't know how we can implement it without it being powergamed by a group of players.\n\n\n'''30. Are there any plans to bring back the old battle system?'''\n\nP: I've always wanted to rework that but the issue is always rewards. Rewards is always the biggest issue we have. We can't give something out that gives you a competitive advantage in PvM. We can give you resources but it has to actually give you incentive to do these things, so its a tough balance. We could give cool statues or deco items...\n\nE: The issue with that kind of stuff is that once you have 100 or 200 of them on the server, they're worthless and you have to re-do them again.\n\nP: If you come up with a suggestion where the rewards make sense, its way easier for us to do. \n\nS: Shout out to Jibreel for moderating Twitch!\n\n\n'''PvP Seasons'''\n\nE: Doing seasons had the same problem. You had to come up with new stuff each time. That's why we only had two seasons. Season 2 was there for two years.\n\nS: I never really liked the seasons idea.\n\nE: The best rewards we have come up with by far are the ones that are use or time limited because then we can keep giving them. I don't mind giving up very good stuff, as long as its going to be gone shortly.\n\n\n'''Huzzah For Fay'''\n\nP: Fay, you got any cool ideas you are working on right now?\n\nE: Shout out to Fay for all the invasions you've done. They've been amazing. I know how much work it is to set those up, I'm not sure people appreciate how much work you've put into that.\n\nF: I enjoy doing them for you guys.\n\nS: Any deco ideas?\n\nF: Probably some more orc or pirate stuff.\n\nS: People love pirate stuff for sure.\n\nF: Just message me if you have any ideas.\n\n\n'''31. Can be have stealable rares back?'''\n\nP: For those who don't know, we made them rares on mobs rather than spawning at locations. People were basically running timed scripts and dominating the rares market.\n\nJ: I had them on week long and even month long timers.\n\nS: Rares started in UO as an accident. They were statics that weren't locked down and they kept spawning. Back then the gamer mentality was no where near what people know now. People know so much and they have client assistants and scripts. Its nostalgic but you have to find a way around the automation.\n\nP: Joe even tried moving them around and people were still finding them.\n\nS: People were editing their clients to show the items as a big square.\n\nJ: You can set ranges for the spawn but if you set too big of a range, it could spawn in the ground.\n\n\n'''32. Will blessed militia weapons be implemented?'''\nP: I think I really like the idea if its done correctly, using militia points for example.\nE: The old ones had limits on them. They would be destroyed if you attacked a blue and they were time limited. I don't know if I like the way of crafting them. We could use bounty points.\n\n\n'''Statues'''\n\nE: Statues is something I've wanted to address. Maybe doing monster of the month hue statues.\n\nS: Statues went over a lot better than I thought it would.\n\nP: Can we add statues to the raffle system?\n\nE: No, we never added that.\n\nP: That's something we could do to sink them.\n\nE: Or we could put a chest for people to put them in and run a manual raffle off of that. I hate messing with the dono/lottery vendor because it works and it scares me to mess with it.\n\n\n'''Golems / Chicken Fights'''\n\nE: Golems ... Who wants golems.\n\nS: Gooolems.\n\nE: You can't heal them right now, so they are limited use.\n\nS: I think they are bigger on the official servers right now. I think people use them a lot.\n\nE: They are good on here, they have a stun attack but I'm not sure we want people running around with them.\n\nS: We could do something with them.\n\nE: I took out skill loss for pets under 150 hitpoints so if anyone wanted to do chicken fights again, they could do that without having to go through skill loss.\n\nS: You could make it so chickens can learn special abilities over time. Double peck.\n\nJ: People would be so pissed if they got merced by a chicken.\n\n\n'''Special mount for dexxers'''\n\nE: I think dexxers do have a special mount, they get swampies.\n\n\n'''Random monster spawns in ocean'''\n\nE: I'd like to do that but you will annoy all the fisherman.\n\nJ: I tried to make mini invasions for oceans but can only be casting mobs because mobs can't board the boat.\n\nE: I could probably make the mobs teleport. Make them damage the boat? That would be hard. There is no AI for mobs attacking objects.\n\n\n'''33. Is Fay making Valentines deco?'''\n\nF: Sure, if people want them.\n\nE: There's a bunch of hearts in the art work.\n\n\n'''Waterfall or Agile?'''\n\nE: Boy thats a nerd question. We use a cowboy development process.\n\n'''Test Driven Development'''\n\nP: Its difficult to get people to test stuff before it goes live.\n\nE: The code is insane enough as it is. If I had to do unit testing, I would quit. I wouldn't even know how to do that with all the random number generation used. Its difficult to get enough people to test stuff. I can get one or two people to test it out but you aren't going to get a real life test of it until its on live.\n\n\n'''34. Dropping a portal frag for top damage per second.'''\n\nE: I don't like doing guaranteed rewards to anything based on score on anything like that. Its just so demoralising for others. You'll get one guy who is really good at it and he'll get the reward every time. That's just not fun. Its fun for that one guy, but thats about it.\n\n\n'''35. What about switching relics on and off?'''\n\nE: I think I've adjusted phase shift now to the point where it only jumps once. You can choose when you phase shift by attacking it.\n\n\n'''36. What about level 7 treasure maps?'''\n\nE: I just haven't had time to finish it yet.\n\nS: They are close though aren't they?\n\nE: They work but not how I would like yet.\n\n\n'''37. Is there a chance in the future to trade our talisman?'''\n\nP: I would say no. I don't really see why. I don't see the benefits to trade.\n\nS: I like the idea that people just have to work up a new one.\n\nE: Honestly I don't like the trading. It makes an industry that we don't want to have to monitor. People would macro them up, we'd have to police it. Its better for you to invest better into it for yourself.\n\nP: One thing that has worked well was raffling off a talisman that someone has levelled up. That doesn't really answer anyones question but we liked that.\n\nE: Yea we've done a couple of those.\n\nP: You can't really compare tamers to talisman (in terms of trading pets vs talisman). You should consider them as two separate things.\n\n\n''[Shout out to Parsnip (hey, that's me!) for the wiki work]''\n\n\n'''38. What's everyones favourite monster of the month?'''\n\nS: I like earth elementals.\n\nE: Ratmen is the best hue by far.\n\nS: Shame Level 1 is always so busy in that month, its nostalgic.\n\nP: Dragons are good for that too in Destard.\n\n\n'''39. Is anything going to be done about huge guilds?'''\n\nP: I've always like the idea of capping guilds. I can see pros \nand cons to both.\n\nS: I think we all want that except the people in the big guilds.\n\nP: That's something we could bring to the player base. Eliminating alliances and putting caps in. PvPers would love it but the casual PvM players hate that, they love their alliances.\n\nS: Alliances are supported to be for small guilds, not huge guilds. Its not something we can change on a whim, we've learned that.\n\nP: You could have a limit if you guild is over X amount, then you can only have one alliance.\n\nE: We do already have a cap on alliance size in the code - A max of 100. We could turn of green for alliances.\n\nP: Jibreel suggested making the alliance numbers be included in the guild cap.\n\n\n'''40. Would you consider reducing the taming requirement of death beetles?'''\n\nP: I think people undervalue how good death beetles are but I don't hate that idea.\n\nE: They'll destroy a level 6 dragon with no relics. We've already lowered the requirements once from 115 to 110. We could lower it to 105 but you have to be careful not to go too low or people will start PvPing with them.\n\n\n''LE FIN''"
          }
        ]
      }
    }
  }
}