{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "205": {
        "pageid": 205,
        "ns": 0,
        "title": "Animal Taming",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[File:TamingFlag.gif|thumb]]\n__TOC__\n==Description==\n[[Animal Taming]] is a skill that allows you to tame pets to become your allies. These pets will follow your commands. Higher levels in taming allow you to train much tougher creatures such as Dragons while lower level taming allows you to tame basic animals such as horses. Clicking on an animal once (if it's tamable) will bring up a \"Tame\" button, you will attempt to reason with the animal or monster until you either fail or succeed. If you succeed, the animal or monster will now listen to your typed commands (Listed below)\n\nYour Animal Taming and [[Animal Lore]] skills affect your ability to both tame the creature as well as command it. If your [[Animal Lore]] skill is too low, the creature will ignore your commands and get upset. Animal Taming allows you to acquire [[Meta Pets]].\n\n===Notes===\n* [[Power Scrolls]] and [[Skill Scroll]]s are available for this skill.\n* For a complete list of tameable creatures you can refer to the [[Tameables#Taming_Charts|Taming Charts]]\n\n==Recommended Training==\nAs one of the famously hardest skill to level, it is recommended to follow guides in order to maximize the Taming gains during training. Taming gains are difficulty based, meaning that you will not gain skill when Taming something that is considered too easy or too hard. Taming can also be passively trained whenever a tamed pet, or pets, kill a creature. The chance to gain is based on the relative strength of the pet used, the damage the pet dealt, and the tamers skill level. The [[Tameables#Taming_Charts|Tamed Creature's Minimum Taming Requirement]] must be within 5 skill points of the Tamer's current skill level. Relative Strength of your pet is based on the following:\n* Armor\n* Maximum Hitpoints\n* Strength\n* Dexterity\n* Skill levels\n* Special Abilities such as Relics or Boss Abilities\n\nNotes:\n* You cannot gain taming from gated mobs.\n\n==Guides==\n===Basic Guide===\nIn this guide, employing five tames consistently is highly recommended. The process involves two distinct phases: the battle phase and the tame phase, both of which you'll repeat multiple times. The rationale behind this strategy is that you earn 0.1 skill for each tame that successfully strikes an enemy before its demise.\n\nDuring the Battle Phase, you can acquire 0.5 skill per kill, making it a swift process to accumulate several skill points within minutes. Occasionally, you may find it necessary to conduct a manual tame phase to gain skill, usually yielding around 1.0 points, after which you'll return to the battle phase. It's crucial to ensure that each of your tames lands at least one hit during the battle phase to maximize skill acquisition. These skill points are visible in the show real, so ensure that this option is selected.\n\nFollowing the battle phase, it's advisable to release and eliminate your current tames. Whenever you require tames for a battle phase, they can be transferred to you from a GM+ tamer.\n\nYou can also create your own guide or modify these ones using the [[Tameables#Pet_Taming_Chart|list of tameable pets chart]]!\n\n===0-115 Guide===\nThe following guide was created by [https://www.uoforum.com/threads/fast-gm-animal-taming-11-23-2023.110252/ cliNt torreZ & Nokins] from the UOForever discord/forums. With this guide you can GM+ taming within a day or two of normal play. Like 8 or less hours of play. We have shared this with several people and they have found the great benefits of it with out having to spend 80+ hours trying to level it or millions of gold buying scrolls. Please enjoy. The original thread can be found [https://www.uoforum.com/threads/fast-gm-animal-taming-11-23-2023.110252/ here].\n\n====Time Required====\n* 50-115: Some have been able to accomplish this with the guide with 8 or less hours of gameplay. This of course includes the use of taming skill scrolls at 100+ skill range. \n\n====Details====\n\n* 0-47.1 \n** Location:Town NPCs\n** Go train your taming skill at various town NPCs at stable masters.\n\n* 47.1-52.2 Battle Phase\n** Location:Kill various world mobs on dagger island, or earth elementals in shame\n** You will need 5 tamed scropions that you will use to kill the mobs listed above. \n\n* 52.2-53.2 Taming Phase\n** Locations: [[Shame]] Levels 1, Dagger Isle\n** Scorpions (47.1) in Shame or Polar Bears on Dagger Isle are by far the best option.\n\n* 53.2-58.2 Battle Phase\n** Locations: [[Minoc]] and [[Moonglow]] moongates or again Dagger Isle.\n** This phase will need 5 Panthers, Snow Leopards, Grey Wolves, or a combo of all three. Take them and kill earth elementals with them in shame.\n\n* 58.2-59.2 Taming Phase\n** Locations: [[Shame]] Levels 1, Dagger Isle\n** Tame Scorpions or Polar Bears\n\n* 59.2-63.2 Battle Phase\n** Locations: [[Minoc]] and [[Moonglow]] moongates\n** Tame 5 Great Hearts or Grizzly Bears or a combo thereof. Take them and kill earth elementals with them in shame.\n\n* 63.2-65.2 Taming Phase\n** Locations: [[Shame]] Levels 1, Dagger Isle\n** Tame Scorpions, Polar Bears, Snow Leopards to 64.2. Tame Scorpions only until 65.2.\n\n* 65.2-70.2 Battle Phase\n** Locations: Dagger Isle\n** For this you will need 5 White Wolves (found on dagger Island) and either kill spawn on Dagger Island or earth elementals with them in shame until 70.2.\n\n* 70.2-71.2 Taming Phase\n** Locations: [[Shame]] Levels 1\n** Tame Scorpions to 71.2\n\n* 71.2-76.2 Battle Phase\n** Locations: [[Minoc]] and [[Moonglow]] moongates or Fire Cave/Compassion Desert\n** You will need 5 Bulls or Small Hellcats, take them and kill earth elementals with them in shame.\n\n* 71.2-76.2 Battle Phase\n** Locations: [[Minoc]] and [[Moonglow]] moongates or Fire Cave/Compassion Desert\n** You will need 5 Bulls or Small Hellcats, take them and kill earth elementals with them in shame.\n\n* 76.2-77.2 Taming Phase\n** Locations: [[Ice Dungeon]]\n** Tame frost spiders.\n\n* 77.2-80.9 Battle Phase\n** Locations: [[Ice Dungeon]]\n** Take the Frost Spiders Take them and kill earth elementals with them in shame.\n\n* 80.9-81.9 Taming Phase\n** Locations: Delucia Pass\n** Tame Lava Lizards.\n\n* 81.9-85.9 Battle Phase\n** Locations: Delucia Pass\n** Take 5 Lava Lizards and kill earth elementals with them in shame.\n\n* 85.9-90.6 Battle Phase\n** Locations: [[Fire Dungeon]]\n** Take 5 Hell Hounds and kill earth elementals with them in shame.\n\n* 90.6-94.2 Battle Phase\n** Locations: [[Fire Dungeon]]\n** Take 5 Big Hell Cats and kill earth elementals with them in shame.\n\nAt this point you will need to tame or have transferred to you a dragon.\n\n* 94.1- 98.9 Battle Phase\n** Locations: [[Destard]]\n** Take a Dragon and use either 2 Energy vortex if you have Margery or us two other single slot tames. You will need to Kill Ogre lords or Ice Ogre Lords.\n\n* 98.9-101.4 Battle Phase\n** Locations: [[Ice Dungeon]]\n** You will need 2 White Wyrms and kill Ogre Lords or Ice Ogre Lords.\n\n* 101.4-104.2 Battle Phase\n** Locations: [[Asylum]]\n** Tame Asylum Imps and kill Ogre Lords.\n\nFrom this point you will have to grind out taming on lava lizards until 105.7 or Use Taming skill scrolls.\n\n* 105.7-110.8 Battle Phase\n** Locations: [[Montor]] or Grinch area in Hythloth\n** Avian Steed (7 day spawn best to purchase or borrow) At this point you have to kill shadow wyrms/balrons for gains.\n\n* 110.8-115 Battle Phase\n** Locations: [[Ice Dungeon]]\n** Death Beetle (daily spawn, tamed in the area off ice dungeon) Kill Daemons for easy gains.\n\n====Template====\nThese are the recommended skills while levelling:\n* 100 Music - Essential\n* 100 Peacemaking - Essential for Dungeon Taming\n* 100 Provoke - Utility skill to kite pets to surrounding spawn to kill off.\n* 100 Magery - Utility skill to Recall/Heal/PK defense (GM not essential during grind)\n* 100 Meditation - Helps to keep Mana topped off\n* 100 Hiding - I wound up dropping it at 90 taming so I could control tames better\n* Animal Lore - Picked up at 90 taming to send tames to surrounding mobs to kill off, works better then provoke IMO.\n* Animal Vet - Will drop Peace for Vet at 100 Taming\n* Taming What it’s all about.\n\n====Supplies====\n* 30 of Each Reagent\n* 1 Bard Instrument\n* Food (usually just ate what dropped)\nI banked at either 8-10 reagent left or if I hit 2000 gold. Travel light and death should be irrelevant.\n\n==See Also==\n* [[Animal_Lore|Animal Lore]]\n* [[Controlling_Pets|Controlling Pets]]\n* [[Peacemaking]]\n* [[Discordance]]\n* [[Pets]]\n* [[Protecting_Your_Pets|Protecting Your Pets]]\n* [[Stable|Stables]]\n* [[Tameables]]\n* [[Veterinary]]\n\n[[Category:Skills]]"
          }
        ]
      }
    }
  }
}