{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "1617": {
        "pageid": 1617,
        "ns": 0,
        "title": "Backpack",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[image:Backpack_small.jpg|frame]]\n__TOC__\n==Description== \n[[image:backpack.png|frame]]The backpack, or pack, serves as the primary storage for individual characters. The backpack is always displayed in the [[Paperdoll]]. To open the backpack, double-click it in the [[Paperdoll]] window or use the default keyboard command, Alt + I. A small version of the backpack can be had by single clicking the buckle of the backpack, which is located at center, bottom of the pack. However, gold at least will not stack when placed in the backpack via the small version.\n\n==Maximum==\nThe maximum weight a backpack holds is 400 stones, whether or not the character can carry more is immaterial, only 400 will fit into the pack. If you are crafting items and exceed the maximum weight, any additional crafted objects will fall to the ground. \n\nThe maximum item count for the backpack is 125. If you are crafting items and exceed the maximum item count, any additional crafted objects will fall to the ground.\nIt should be noted that a character can be up to 3-stones overweight and still walk without [[Stamina]] loss and [[Recall]] or [[Gate Travel]].\n\n==Item Drops==\nSeveral types of items are delivered directly to a character's backpack, such as rare gifts created by staff, magically created food, token redemptions, faction [[Silver]]. If the backpack is full, the character's Bank Box is used instead. The prioritization of character storage is to make sure that such an item drop does not overload a character.\n\n[[Category:Interface]]"
          }
        ]
      }
    }
  }
}