{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "3666": {
        "pageid": 3666,
        "ns": 0,
        "title": "Bomberman",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Events]][[Category:Player Run Events]]\n[[File:Bomberman_7x7_Allnames_07_15_2023.png|425px|thumb|right|A Bomberman Arena quite packed with players! This famously addicting event is a fast paced and fun event that can support up to 8 players at a time with 7 different Arena types that range from 7x7 to 25x25 in size!]]\n__TOC__\n\n=Description=\nBomberman is an event modeled after the real Bomberman game. Players are sent into a customizable arena and are given a special [[Bomberman#Bomb_Bag|Bomb Bag]] that can be used to blow up walls to collect [[Bomberman#Powerups|Powerups]] and reach (and eliminate!) the other players. This event is always available and the [[Community_Island#Bomberman|Bomberman Arena]] can host multiple Bomberman games at one time. Each game can have up 8 players with with 7 different [[Bomberman#Arena_Types|Bomberman Arena Types]] that can range from 7x7 to 25x25 tiles. It should be noted that while player pets are allowed in the [[Community_Island#Bomberman|Bomberman Arena]], you cannot have any current Pet Slots in use if you wish to join or start a game. This includes Ethereal mounts, pets sitting in a home, or Hirelings/Summons.\n\n[[File:Bomberman_Preview.gif|425px|Bomberman Event! Players use their bombs to knock down walls and their opponents.]]\n\n=How to Play=\nThe objective is to blow up walls and players with bombs. When the game begins all players are given a [[Bomberman#Bomb_Bag|Bomb Bag]] in their backpack and teleported to one of the even distributed points on the edge of the arena. When a player uses the [[Bomberman#Bomb_Bag|Bomb Bag]], a bomb is placed at their feet which will detonate after a short period of time. The explosion hits all adjacent tiles, if a player or a destroyable wall is on this these tiles, they are destroyed! Destroyed walls have a chance to leave behind [[Bomberman#Powerups|Powerups]], while destroyed players are kicked out of the game. The players need to blast their way through the destroyable walls in order to reach other players, but be careful as the bombs will blow you up if you get in the blast zone. The game ends when there is zero to one players left, make sure that if you want to win and not create a tie, that you blow up the other person without leaving yourself in the blast zone as well!\n\n[[File:Bomberman_Placing_Bombs.gif|Bomberman Event where a player is placing down bombs using the Bomb Bag in the Bomberman Arena.]]\n\n==Joining the Game==\nTo join a game you need to look for an Active Bomberman Stone:\n\n[[File:Bomberman_Statue_Active.PNG|The Bomberman Stone in the Active status waiting for players to join.]]\n\nDouble clicking this stone will produce a menu to join the game with the green button or cancel with the red button. While you are choosing an option you will have a debuf of paralyzed until you make the decision.:\n\n[[File:Bomberman_Player_Signup_Menu.PNG|425px|The Player viewpoint of joining a Bomberman match. You can a join the game with the green button or cancel with the red button. While you are choosing an option you will have a debuf of paralyzed until you make the decision.]]\n\nOnce you have accept to join the game you will see the message that lets you know you are waiting for other players to join, and you can click the red button anytime to exit the queue:\n\n[[File:Bomberman_Players_Waiting_Or_Cancel_Message.PNG|The Bomberman Player is waiting on more players to join the Bomberman active stone or to cancel from the waiting queue.]]\n\nThe Bomberman stone will also produce a message that you have joined the game, and if the Bomberman Arena Style has not been confirmed it will announce that as well:\n\n[[File:Bomberman_Stone_Confirm_Style_Message.PNG|425px|The Bomberman Stone message that lets everyone know that someone has been added to the game queue. This message also shows that the Bomberman Stone Owner still needs to confirm the Arena style.]]\n\n==Bomb Bag==\n[[File:Bomberman_Bomb_Bag.PNG|thumb|right|The Bomberman Event Bomb Bag which is used to place bombs on the Bomberman Arena.]]\nBomb Bags are placed into a players inventory when they are teleported into the Bomberman Arena. These bags cannot be moved, it is suggested to create a macro in order to use the bag. There are two options for the macro, you can use a \"last target\" and at the beginning of the match make sure you manually double click the bag for the first time you use it. The Second option is to set up a macro that uses a \"bag\" type of item and make sure that you do not have any other \"bag\" types of item in your backpack. Traditionally players bind these macros to the \"spacebar\", however you this is entirely optional feel free to manually double click your bomb bag!\n\n[[File:Bomberman_Last_Object_Macro.PNG|425px|Bomberman Macro suggested default is the space bar using the Last Object functionality.]]\n\nThe Bomb Bag can be used multiple times and it starts with 2 bombs in your bag. Once these 2 bombs have been placed you must wait until a bomb has detonated before you can place another bomb. Bombs placed near other bombs(including your own) will trigger detitanations on other bombs within the blast zone. This can lead to very wide and long explosions, as well as quickly return bombs back to your bag so you may lay more bombs down. There are [[Bomberman#Powerups|Powerups]] that can effect the number of bombs you can lay down, the penetration of the walls, and how wide your bombs will explode before hitting any wall.\n\n[[File:Bomberman_Players_Bomb.PNG|A players Bomb created from a Bomb Bag in the Bomberman Event Arena.]]\n\n==Powerups==\nPower ups are upgrades to your bombs and the effects stack if you acquire more than one. You can also have multiple affects going on on your bombs at the same time. These powerups can be found on a small chance when destroying a destroyable wall and will disappear after a short time if not picked up. Upgrades can also be destroyed by bombs, so be careful not to place bombs near them! \n\n[[File:Bomberman_Blowing_Up_Powerups.gif|Bomberman Bag Bomb upgrades can be destroyed by bombs, so be careful not to place bombs near them!]]\n\nThere are 3 known powerups:\n* [[Bomberman#Bomb_Count_Upgrade|Bomb Count Upgrade]] -  This is the multiple bomb icon which increases the amount of bombs that can be placed before they detonate, due to item delay the maximum count is around 6 bombs at a time.\n* [[Bomberman#Blast_Strength_Upgrade|Blast Strength Upgrade]] - This is the flower icon which increases the size of the explosion before it is stopped by a wall.\n* [[Bomberman#Big_Badaboom_Upgrade|Big Badaboom Upgrade]] - This is the skull candle icon which allows wall penetration, however you wont notice this effect until you have acquired at least 2 of these.\n\n===Bomb Count Upgrade===\n\nThe Bomb Count Upgrade allows you to have more bombs in your [[Bomberman#Bomb_Bag|Bomb Bag]] before needing to wait for a bomb to detonate and return to your bag. This effect can stack infinitely, but due to item delay limits you can really only get to 6 bombs on the field at any given time.\n\n[[File:Bomberman_Powerup_Bomb_Count_Upgrade.PNG|The Bomberman Upgrade that allows you to increase the Bomb Count.]]\n\n===Blast Strength Upgrade===\nThe Blast Strength Upgrade allows your bombs to reach farther with their explosion before hitting a wall.\n\n[[File:Bomberman_Powerup_Blast_Strength_Upgrade.PNG|The Bomberman Upgrade that allows you to increase the blast range of your bombs before hitting a wall.]]\n\n===Big Badaboom Upgrade===\nThe Big Badaboom Upgrade increases the blast penetration of your bombs detonation. This affect is not noticeable until you have picked up this upgrade twice, then for every 2 Big Badaboom Upgrades you find it will allow your explosions to go through another tile past a wall.\n\n[[File:Bomberman_Powerup_Big_Badaboom_Upgrade.PNG|The Bomberman Upgrade that allows you to increase the blast penetration of your bombs before stopping.]]\n\n=Setting Up The Game=\nIn order to start a Bomberman game you will need to find an Inactive Bomberman Stone:\n\n[[File:Bomberman_Statue_Inactive.PNG|The Inactive Bomberman Stone, which when used sets the player as the Bomberman Arena Owner allowing them to customize the Arena Type and start the game.]]\n\nDouble clicking the Inactive Bomberman Stone will give you this menu that allows the number of players to be picked and has a description of the rules:\n\n[[File:Bomberman_Menu_Preview.PNG|The Bomberman Menu Preview as seen from the Bomberman Arena Owner, which is the first person to double click the stone. This allows you to see the rules and description, and set the number of players.]]\n\nAfter selecting the number of players, you will be taken to the Board configuration menu that will allow you to select an Arena Type, the size of the Arena, change the number of players, and set the game in a \"Ready to Start\" state:\n\n[[File:Bomberman_Menu_Board_Preview.PNG|The Bomberman Board Style menu that allows you to set the number of players, the type of Arena, the size of the Arena, and be able to set the game into a \"Ready to Start\" state.]]\n\nIn addition to adding you as a player to the game, it also assigns you as the Board Game Owner which allows you to make these changes, which is announced from the stone:\n\n[[File:Bomberman_Stone_Assignment_Message.PNG|The Assignment message of both a player and the Owner of a Bomberman game. Here you can see how many players are left to start the match as well.]]\n\nIf everyone leaves at this point the Bomberman Game Controller will reset and the next person to use it will be assigned as the Board Game Owner:\n\n[[File:Bomberman_Players_Removing_Players_And_Canceling_Message.PNG|The Bomberman stone resetting due to the all players leaving the game.]]\n\nHowever, if there are players ready to play, the Game Board Owner will need to check the box \"Ready to Start\" which will lock in the number of players, the Arena Style, and the Arena Size. You can also know that you are ready because the background of the menu will change as well:\n\n[[File:Bomberman_Menu_Board_Ready_Preview.PNG|A Ready to Start Bomberman menu.]]\n\nOnce the requested number of players joined have been reached, everyone involved in the game will be teleported into the field in a corner or wall in a evenly distributed fashion and the game will begin!\n\n==Arena Types==\n[[File:Bomberman_Menu_Board_Ready_Preview.PNG|thumb|right|The Bomberman Board Style Menu that allows you to choose the type of Bomberman Arena to play on.]]\nThere are currently 7 different arena types:\n* Default - Cut Marble Stonework with Green Tile flooring.\n* Rocky - Large Rough Marble boulders with smaller destroyable rocks on a cave floor.\n* Woodland - Large cut Tree Stumps block the path with smaller destroyable bushes and ferns on a grassy meadow.\n* Warehouse - Wooden Walls that contain a warehouse of destroyable crates on wooden floors.\n* Ruins - Crumbling Sandstone walls with smaller destroyable sandstone ruins on ancient sandstone tiles.\n* Graveyard - Tough Tombstones with destroyable piles of skulls on gravel earth.\n* Crystal - Exotic Blue Crystalline Walls with [[Random_Dungeon_Adventure#Resources|Crystal that can be found in RDAs]] on cracked earthen floors. \n\n<gallery class=\"inline\" widths=\"100px\" heights=\"100px\" mode=\"slideshow\" showthumbnails>\nFile:Bomberman_Board_Default.PNG|The Default Bomberman Board Style that has not been filled yet.\nFile:Bomberman_Board_Default_Filled.PNG|The Default Bomberman Board Style that has been filled out.\nFile:Bomberman_Board_Rocky.PNG|The Rocky Bomberman Board Style that has not been filled yet.\nFile:Bomberman_Board_Rocky_Filled.PNG|The Rocky Bomberman Board Style that has been filled out.\nFile:Bomberman_Board_Woodland.PNG|The Woodland Bomberman Board Style that has not been filled yet.\nFile:Bomberman_Board_Woodland_Filled.PNG|The Woodland Bomberman Board Style that has been filled out.\nFile:Bomberman_Board_Warehouse.PNG|The Warehouse Bomberman Board Style that has not been filled yet.\nFile:Bomberman_Board_Warehouse_Filled.PNG|The Warehouse Bomberman Board Style that has been filled out.\nFile:Bomberman_Board_Ruins.PNG|The Ruins Bomberman Board Style that has not been filled yet.\nFile:Bomberman_Board_Ruins_Filled.PNG|The Ruins Bomberman Board Style that has been filled out.\nFile:Bomberman_Board_Graveyward.PNG|The Graveyard Bomberman Board Style that has not been filled yet.\nFile:Bomberman_Board_Graveyward_Filled.PNG|The Graveyard Bomberman Board Style that has been filled out.\nFile:Bomberman_Board_Crystal.PNG|The Crystal Bomberman Board Style that has not been filled yet.\nFile:Bomberman_Board_Crystal_Filled.PNG|The Crystal Bomberman Board Style that has been filled out.\n</gallery>\n\n=Rules=\nWhile most of the rules are handled within the game itself, the following rules should be kept in mind:\n* Elect someone to handle using the Bomberman Game Controller Stone, and if you are not that person, please do not hold the stone as it will stop others from joining.\n* You will need to unmounted, and have no current Animal Control Slots in use in order to start or use the Bomberman Game Controller Stone which is required to start or join a game. If you have any Pets, Mounts, Summons, or NPC hirelings/escorts you will need to stable or abandon them in order to play.\n* If the current Bomberman Game is full, you are welcome to hang around and watch or wait for your turn at the next match, but keep in mind there are other Bomberman Games Controllers that operate another Bombergame nearby!\n* You should create a macro to use the [[Bomberman#Bomb_Bag|Bomb Bag]], however if you already have a \"use last item\" macro or hotkey created, that should be good enough!\n* Do not use food, [[Potions#Types_of_Potions|Red Potions]], or anything else to recover stamina during the event.\n* Do not use buffs, or anything else that would give you an advantage during the game.\n* Do not use magic or items to place objects onto the field that may obstruct player movement.\n* Do not attempt to exit the event through spells, or other whacky ways to leave. You do not actually \"die\" when you blow up from [[Bomberman#Bomb_Bag|Bomb Bags]], so there is no fear of losing items or risking stat loss during play.\n\n=Contributors=\nThe community would like to thank the following brave adventurers who contributed their time and experiences for others to enjoy:\n* Bo\n* MsBabyDoll\n\n=See Also=\n*[[Community_Island|Community Island]]"
          }
        ]
      }
    }
  }
}