{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "1526": {
        "pageid": 1526,
        "ns": 0,
        "title": "Bulk Order Deed",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Quests]][[Category:Crafting]]\n[[File:Bulk_order_deed_blacksmithing_small.png|right]]\n__TOC__\n</br></br></br>\n==Description==\nBulk Order Deeds are special orders given by NPC Vendors which ask a player crafter to create a bulk amount of items.\n\nThere are two types of Bulk Order Deeds, small and large:\n*A small Bulk Order Deed will require you to make 10, 15 or 20 of a required item.</br>[[File:Bulk_order_deed_blacksmithing_small_order.PNG]]\n*A large Bulk Order Deed will require you to fill multiple small Bulk Order Deeds, in order to fill the large Bulk Order Deed. Large Bulk Order Deeds generally return a better reward.</br>[[File:Bulk_order_deed_blacksmithing_large.PNG]]\n\nBulk Order Deeds can be obtained once every 6 hours at at least 55.1 skill, however at 120.0 skill this time is reduced to once every 5 hours.\n\nCurrently, these are the [[crafting|crafting skills]] available to receive Bulk Order Deeds:\n*[[Tailoring]]\n*[[Blacksmithing]]\n==Process==\n===Locating the Bulk Orderer===\nYou begin by visiting the necessary NPC Vendor, this must be a vendor related to the Bulk Order Deeds crafting skills you are looking for. For example you will need to find a [[Blacksmith|blacksmiths]] and [[Weaponsmith|weaponsmiths]] for orders with blacksmithing item requirements and [[Tailor|tailors]] for tailoring item requirements. Guildmaster versions of the NPC Vendors will not give Bulk Order Deeds.\n[[File:Aldrick_the_britain_crafters_blacksmith.JPG|center|350px]]\n</br></br>\n===Checking Eligibility===\n[[File:Bulk_order_deed_bulk_order_info.jpg|right]]\nNext you will want to check if you are currently eligible to receive a Bulk Order. Using the [[Context Menu]] on the NPC Vendor, you can find the \"Bulk Order Info\" Option.\n\nClicking this option will give you a message of either:\n*The rejection of attempting to receive a Bulk Order Deed which comes from the NPC Vendor and states how long until the next Bulk Order is available.</br>[[File:Bulk_order_deed_bulk_order_info_not_eligible.jpg]]\n*The eligibility message after attempting to receive a Bulk Order Deed. The message comes from the System and appears in the [[Journal]].</br>[[File:Bulk_order_deed_bulk_order_info_eligible.jpg]]\n\nBulk orders are available every 6 hours(5 hours if you have 120.0 skill) regardless if they are filled out, and it should be noted that turning in a completed Bulk Order Deed will reset this timer so make sure to get your new deed first before turning in a completed one!\n</br></br>\n\n===Receiving the Bulk Order Deed===\nOnce you have established with the NPC Vendor that you can receive a Bulk Order, it is time to prove you are ready for one.</br>[[File:Bulk_order_deed_bulk_order_offer.jpg|350px]]</br>\n\nThe NPC Vendor will expect you to sell items that they would normally buy, and after each sale there is a chance they NPC Vendor will provide a Bulk Order Deed. When attempting to get a Bulk Order Deed, it is best to sell one item individual as this is by each sale, not each item within the sale. It could take 1 sell or it could take 20 sells, patience and perseverance is required to receive the Bulk Order Deed. Eventually, the NPC Vendor will offer you the Bulk Order Deed, if you accept, a Bulk Order Deed deed will be placed in your backpack(or the ground if there is no room).<br/>[[File:Bulk_order_deed_bulk_order_info_accepted.jpg]]\n</br></br>\n===Completing the Bulk Order Deed===\nIn order to complete a Small Bulk Order Deed, you will need to first craft the designated items. Then use the Small Bulk Order Deed menu by Double Clicking the Small Bulk Order Deed then select \"Combine this deed with the item requested\" and target the crafted items. Note that the Material and Quality of items are specific and must be followed to complete the Bulk Order Deed. \n</br>[[File:Bulk_order_deed_blacksmithing_small_order.PNG]]\n</br></br>\nWhen you have combined all the items into the Small Bulk Order Deed you have 2 options:\n*Drag and drop the Small Bulk Order Deed onto the NPC Vendor to receive a [[Bulk_Order_Deed#Rewards|reward]] and some gold.</br>\n*Combine the Small Bulk Order Deed into a Large Bulk Order Deed.</br>\n\nYou may find yourself with an abundance of Bulk Order Deeds, it would be wise to use [[Bulk Order Deed Book|Bulk Order Deed Books]] which can be crafted with [[Inscription]] to help organize and hold Bulk Order Deeds.\n\n==Rewards==\nRewards are specific to the individual Bulk Order Deed and Crafting Skill type, currently only Blacksmithy and Tailoring have Bulk Order deeds, you can find there rewards here:\n*[[Tailoring BOD Rewards]]\n*[[Blacksmithing BOD Rewards]]\n*Reward percentage information was taken from [http://tor.bplaced.net/bods-srw.htm Tower of Roses].\n\nThere are additional rewards related to the [[Antique_of_the_Artisan| Antique of the Artisan Crafting Meta Talisman]], which can only be received while wearing an active Talisman when turning in the Bulk Order Deed:\n* A chance to receive a [[Meta_Talismans#Relic_Fragments|Small Relic Fragment]] for the [[Antique_of_the_Artisan#Relics|Recycler, Empower, Frugality, Imbueologist, or Perfectionist relics]].\n* A high chance to receive either Mythical Thread for [[Tailoring BOD Rewards]] or Mythical Resin for [[Blacksmithing BOD Rewards]].\n\n==Notes==\n*Turning in a BOD will reset the timer to 6 hours(5 hours if you have 120.0 skill).\n*Not all Crafting Skills have a Bulk Order Deed Type.\n*In the event that Bulk Order Deed Requires a non-exceptional item, you can use exceptional items in their place in order to complete the deeds.\n*Guildmasters/Guildmistresses do not give Bulk Order Deeds.\n*When attempting to get a Bulk Order Deed, it is best to sell one item individual as this is by each sale, not each item within the sale."
          }
        ]
      }
    }
  }
}