{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "1687": {
        "pageid": 1687,
        "ns": 0,
        "title": "Butler",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Items]][[Category:Housing]]\n[[File:Butler_Preview.PNG|thumb|The Butler which is a house add on that allows the storage and organization of items you would use to adventure with such as Reagents, Potions, Bandages, Arrows, Orange Petals and the butler will even store and help you don your Leather Armor!]]\n\n__TOC__\n=Description=\nThe Butler is an NPC(Non-Playable Character) which can be used like a house addon that allows the storage and retrieval of items you would normally use to adventure with such as [[Reagents]], [[Potions]], [[Bandages]], [[Arrows]], [[Orange_Petals|Orange Petals]] and the butler will even store and help you don your [[Armor#Leather|Leather Armor]]! This is an instant transfer of your stored items to your character that can even be chosen to be bagged up or equipped which allows only a few clicks to become restocked. In addition to this quick restock, the items contained on the Butler do not count against the homes storage limit, which makes a great addition to your home maximum storage limits!\n\nThe Butler works much like a Barkeep or Player Vendor Rental Contract where you have a deed you purchase to place in your home and then options to dress and give commands to the NPC. The Butler Contracts are available from the [[Exotic_Item_Vendor|Nadine the Exotic Item Donation Vendor]] located in front of the [[Britain|West Britain Bank]] and is purchasable with [[Donation_Coin|25000 Donation Coins]]. You can have a maximum of 2 butlers per home, however this can be increased with [[Butler_increase_deed|Butlers Increase Deeds]] up to a maximum of 10 Butlers per home! However, for those with more extravagant homesteads, separate Butlers can be assigned to the outside of these homes which could increase the maximum number of Butlers to 20 for a particular property.\n\n==Patch Notes==\n* [https://www.uoforum.com/threads/new-quality-of-life-items.110193/ New Quality of Life Items!]\n* [https://uoforum.com/threads/patch-notes-8-3-0-1-4.110048/ Patch Notes 8.3.0.1-4]\n* [https://uoforum.com/threads/patch-notes-8-0-1-0.109794/ Patch Notes: Patch Notes: 8.0.1.0]\n* [https://uoforum.com/threads/patch-notes-7-0-7-5-housing-update.109077/ Patch Notes: 7.0.7.5 (Housing Update)]\n\n=Contract=\nThe Butler Contracts are available from the [[Exotic_Item_Vendor|Nadine the Exotic Item Donation Vendor]] located in front of the [[Britain|West Britain Bank]] and is purchasable with [[Donation_Coin|10000 Donation Coins]].\n\n[[File:Butler_Location.PNG|The Butler Contract which is available from Nadine the Exotic Item Donation Vendor for 25000 Donation Coins. There is a Blue and Green deed version, however there is no difference between the 2 Contracts. When a Butler is chopped with an axe to be re-deeded you will get a Green deed back.]]\n\nThere is a Blue and Green deed version, however there is no difference between the 2 Contracts. When a Butler is chopped with an axe to be re-deeded you will get a Green deed back. Butlers keep all inventory, names, sex, hairstyles, items worn, current stock, and profiles when they are returned back into a Butler contract.\n\n[[File:Butler_Deeds.PNG|Butler Contracts, on the left is a newly purchased, never used been used contract which is indicated by the blue color. The right is the same contract but has been placed one before. Butler keep all inventory, names, and items worn when they are returned back into a butler contract.]]\n\n==Placing your Butler==\nIn order to place a Butler within a home, you must be a co-owner/bi-owner, or owner of the house and there must be enough available Butler Slots. You can see the current maximum number of Butlers in your home from the House sign Menu under \"Storage\":\n\n[[File:Butler_Increase_Deed_House_Sign_Count.PNG|The House Sign Menu's Storage selection where you can see the current and maximum number of Butlers a home can have.]]\n\nIf you home is eligible for this butler, now is the time to find a place for the butler to stay, you will want to make sure you place the butler in an area that can be reached within 2 tiles in order to access the Butler. When you find an appropriate home tile, double click the deed and the butler will be placed where you are standing:\n\n[[File:Butler_Deeds.PNG|Butler Contracts, on the left is a newly purchased, never used been used contract which is indicated by the blue color. The right is the same contract but has been placed one before. Butler keep all inventory, names, and items worn when they are returned back into a butler contract.]]\n\nIf you misplace the Butler, or find a better spot to place them, you can use an Axe to chop the Butler which will \"redeed\" them. Butlers keep all inventory, names, sex, hairstyles, items worn, current stock, and profiles when they are returned back into a Butler contract.\n==Security Levels==\nThe first thing that any home owner should do is change the [[Custom_Housing#Home_Security|Access Levels]] of Butler to keep greedy hands out of their pockets! You can set the [[Custom_Housing#Home_Security|Access Levels]] like any other container in a home by clicking on the Butler to get the context menu and selecting \"Set Security\":\n\n[[File:Butler_Preview.PNG|The Butler which is a house add on that allows the storage and organization of items you would use to adventure with such as Reagents, Potions, Bandages, Arrows, Orange Petals and the butler will even store and help you don your Leather Armor!]]\n\n==Nickname==\nYou can assign your Butler a new nickname(even against their will) from the same Context menu which can be reached by clicking on the Butler and selecting \"Rename\". Butlers do have some standards, and inappropriate names will be filtered out. Violating the filter will be reported to the authorities of the land and may result in fines or other punishments!\n\n[[File:Butler_Rename_Menu.PNG|The Butler Renaming Menu, these names are checked for appropriateness so please be kind to your Butler, or they may be consequences!]]\n\n==Dress Code==\nSetting the dress code is of utmost importance, as the Butler is the face of your home when you are away. Make sure you present to your neighbors, and the average passerby, how you want them to respect your property! You can use the Context Menu by clicking the Butler and selecting  \"Open Paperdoll\". As long as you are within 2 spaces of the Butler, you can remove and place new items on the Butler. The backpack of the butler is unavailable to the home owner to place items into, however you can use this as an opportunity to raise your [[Snooping|Snooping skill]]!\n\n[[File:Butler_Paperdoll.PNG|Butler Paperdoll, this is a freshly placed Butler that comes stock with Fancy Boots, Fancy Pants, Fancy Tunic and shirt.]]\n\n=Service=\nThe Butler provides a few services from the Butler Menu which can be accessed by double clicking the Butler within 2 tiles of your character that has the correct access level:\n\n[[File:Butler_Menu.PNG|The Butler Menu, there are many options available to you and these options can be saved under 2 profiles. The butler can hold up to 5000 of each item which can be collected via the \"Restock Butler?\" button or by dragging and dropping single or bagged items onto the Butler.]]\n\n==Restocking Butlers==\nThe Butler can hold up to 5000 of each item which can be collected by dragging and dropping single or bagged items(including [[Potions|kegs of potions]]) onto the Butler or through the \"Restock Butler?\" button which can select a container that belongs to the home with the correct [[Custom_Housing#Home_Security|Access Levels]]. If the butler is full on a specific category of item, the items will remain in the place there were once before. You can initiate the Butler Menu from two tiles, then walk to a container away from the Butlers Range in order to pull items from, this can be useful if your butler needs to be able to restock from chests that are outside of the room the butler is currently placed in!\n\nIt is important to note that only the following items can be restocked:\n* [[Potions|All Potion Colors except Nightsight(Black Potions)]] but only store [[Potions|Greater Potions]] with exceptions to the Green Potion which is a [[Potions|Deadly Poison Potion]].\n* [[Potions|Empty Bottles]]\n* [[Reagents|All Reagent types]]\n* [[Bandages|Bandages (Even dyed ones, although retrieving them may lose the color of the bandage!)]]\n* [[Arrows|Normal Arrows and Bolts]] [[Fletching#Rare_Wood_Arrows_and_Bolts|(Rare Arrows and Bolts cannot be stored on the Butler at this time.)]]\n* Store-bought normal Empty Bags(or full bags that have been completely emptied by the Butler and only the bag is left)\n* [[Orange_Petals|Orange Petals]]\n* [[Armor#Leather|Exceptional Undamaged Leather Armor]] [[Tailoring#Leather_Types|(This includes Rare Leather types like Spined, Horned, and Barbed Armor)]]\n\nWhile there are many items that the Butler cannot accept, here are some common items you would think would be accepted, but not:\n* Bags created from [[Server_Commands|[organizeme command]]\n* [[Fletching#Rare_Wood_Arrows_and_Bolts|Rare Arrows and Bolts]]\n* [[Armor#Leather|Studded, Bone, Metal, or Dragon Scale Armor]]\n* [[Armor#Leather|Non-Exceptional Leather Armor]]\n* [[Armor#Leather|Damage Exceptional Leather Armor]]\n\n[[File:Butler_Restock_Leather_Warning.PNG|The Butler Leather Armor Restock warning. The Butler currently only accepts Exceptional Non-Damaged Leather of Normal, Spined, Horned, or Barbed Leather Materials. Magical, damaged, or regular quality Leather will be ignored and show this message for each item found.]]\n\n==Potions, Reagents, Misc, and Ammo Section==\nThe Butler Menu Potions, Reagents, Misc, and Ammo Section is in the right side of the Butler Menu and for sanity's sake we have color coded the separate sections by their functionality:\n\n[[File:Butler_Menu_Regs_Potions_Misc_Arrows_Area.PNG|The Butler Menu Potions, Reagents, Misc, and Ammo Section is in the right side of the Butler Menu and for sanity's sake we have color coded the separate sections by their functionality. The Red Section is for the reagents. The Blue Section is for the Potions. The Green Section is for choosing whether or not to bag the items when retrieved. The Purple Section is for Misc items such as bags, empty bottles, bandages and Orange Petals. The Yellow section is for Ammo such as arrows and bolts.]]\n\n* The Red Section is for the [[Reagents]]. \n* The Blue Section is for the [[Potions]]. \n* The Green Section is for choosing whether or not to bag the items when retrieved. \n* The Purple Section is for Misc items such as bags, [[Potions|empty bottles]], [[Bandages]] and [[Orange_Petals|Orange Petals]]. \n* The Yellow section is for Ammo such as [[Arrows|arrows and bolts]].\n\n===Potions, Bottles, and Kegs===\nWhen a [[Potions|Potions]] is added to the Butler, the [[Potions|Potions]] is separated from its bottle and both the [[Potions|Potions]] its now empty bottle are stored in their respective stocks. You will see the Blue Section stock number increase for the color of the [[Potions|Potions]] added, as well as, the empty bottle in the Yellow Section increase. When it comes to the adding Kegs of [[Potions|Potions]] to the Butler however, these [[Potions|Potions]] are not associated with empty bottles as they came from a keg, which means that the [[Potions|Potions]] themselves are added to the stock but the empty bottle count does not increase. In order to retrieve your [[Potions|Potions]] after filling a butler with a Keg, you will want to make sure that your Butler is stocked with plenty of empty bottles in which to fill the requested [[Potions|Potions]] with!\n\n===Empty Bags===\nIn the Green Section you have 2 options that can be set to bag [[Reagents]] and or bag [[Potions]]. Selecting either of these options requires that the there are available empty bags in the Yellow Section. The only acceptable bags are stored-bought bags, you cannot use the Bags created from [[Server_Commands|[organizeme command]].\n\n==Leather Armor Section==\nThe Butler Menu Leather Armor Section can be found in the top left corner and for sanity's sake, we have color coded the separate sections by their functionality:\n\n[[File:Butler_Menu_Leather_Area.PNG|The Butler Menu Leather Armor Section. In the Yellow Section is the quantity of each Leather Armor piece, which must be undamaged and exceptional. The Blue Section is the option to select if you want the armor that is removed to be equipped. The Red Section is selector for what type of Leather to pull out, this can be Normal, Spined, Horned, or Barbed. The Green Section is the area used to dye the leather that is pulled out or equipped. The Green Section requires a Leather Dye Tub to be placed onto the Butler and you can change the colors from the Enhanced Hue Selection with the \"Change Leather Hue?\" button or get the Leather Dye Tub back if you select the \"Remove Leather Tub?\" button.]]\n\n* The Yellow Section is the quantity of each [[Armor#Leather|Leather Armor piece]], which must be undamaged and exceptional. \n* The Blue Section is the option to select if you want the armor that is removed to be equipped to your character. \n* The Red Section is selector for what type of [[Tailoring#Leather_Types|Leather]] to pull out, this can be Normal, Spined, Horned, or Barbed. \n* The Green Section is the area used to dye the Leather that is pulled out or equipped. The Green Section requires a [[Dye_Tub#Leather_Dye_Tub|Leather Dye Tub]] to be placed onto the Butler and you can change the colors from the [[Dye_Tub#Enhanced_Color_Menu|Enhanced Hue Selection]] with the \"Change Leather Hue?\" button or get the [[Dye_Tub#Leather_Dye_Tub|Leather Dye Tub]] back if you select the \"Remove Leather Tub?\" button.\n\n==Withdrawing Selections==\nIn order to withdraw items from the Butler, you must specify how many of a specific item you are looking to remove! Next to each items image you will find columns named  \"Amount\" and \"Stock\". The Amount field is used to request how many to take out, and the Stock Field is how many of those items are in the butler currently. Although the Amount fields will normally show \"0\" you can click on them to change those numbers. When you do the following will occur:\n* Requesting any number of items beyond the 5000 item limit will result with the maximum current stock, which would be up to 5000 of a single item type.\n* Requesting an amount of items that would exceed the Item Count limit of your backpack will stop the restock process, you cannot go beyond 125 items in a players backpack.\n* Requesting [[Reagents]] and/or [[Potions]] to be bagged, requires that the butler has bags in inventory to use, this counts against your item limit for a players backpack.\n* Requesting [[Armor#Leather|Leather Armor]] to be equipped does not count against the players backpack limit, as long as the leather armor has a location to be equipped on.\n* Requesting an amount of items that would go beyond the 425 weight limit of your backpack will not stop the withdrawal action, you can go way beyond the weight limit as long as the 125 items are not exceeded.\n\n[[File:Butler_Withdraw_Beyond_Weight_Limit.PNG|The Butler can allow your backpack to go beyond the 425 stone limit, but not beyond the 125 item limit. While this is impressive, it is not practical as you lose all of your stamina when attempting to move overloaded like this. This is helpful, however for transferring goods between butlers!]]\n\n==Profiles==\nThe Butler has the ability to remember 2 profiles per butler that will allow you switch between specific loadouts. In order to do this, you must first fill out the numbers on the menu of what you would normally take out during a use of that profile, then click the \"Left Arrow\" Save button. You can switch to the another profile by clicking the Apply \"Ok\" button which would auto populate the numbers you would use for that particular profile. These are optional, but very handy if you intend to take out a set number of bagged [[Reagents]] and [[Bandages]] every time you go to the Butler. You will notice that switching profiles will not change the \"Stock\" values as this is shared between the profiles.\n\nThese Profile Buttons can be found in the lower left corner of the menu. The Blue Row Represents Profile 1, the Purple Row Represents Profile 2. You can use the Yellow Column to Save the current profile, and the Green Column to immediately switch to a previously Applied Profile.\n\n[[File:Butler_Menu_Profile_Area.PNG|The Butler Menu Profile Section. The Blue Row Represents Profile 1, the Purple Row Represents Profile 2. You can use the Yellow Column to Save the current profile, and the Green Column to immediately switch to a previously Applied Profile.]]\n\n==Notes==\n* Butlers only store [[Potions|Greater Potions]] with exceptions to the Green Potion which is a [[Potions|Deadly Poison Potion]].\n* Butlers can not currently store any of the [[Fletching#Rare_Wood_Arrows_and_Bolts|Rare Arrow or Bolt]] types, they can only use normal wood arrows or bolts.\n* Butlers will REMOVE magical properties from any [[Armor#Leather|Barbed or Runic Leather Armor]] when requesting to withdrawal [[Armor#Leather|Leather Armor]].\n\n=Contributors=\nThe community would like to thank the following brave adventurers who contributed their time and experiences for others to enjoy:\n* Ahjuna\n* Lion King\n* MadMedic\n* Phrygian"
          }
        ]
      }
    }
  }
}