{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "30": {
        "pageid": 30,
        "ns": 0,
        "title": "Carpentry",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[File:CarpentryFlag.gif|thumb]]\n__TOC__\n==Description==\nAs your skill improves you may learn special Carpentry Recipes and create items out of special forms of Lumber. With the proper research, a Grand Master may learn the secrets of Masonry. Once a player obtains GM they may \"mark\" any exceptional crafted *weapon* created with his/her name - not furniture. Lady/Lord titles are included in the mark. \n\n===Notes===\n* Carpenter's that are crafting in the [[Britain Crafting Area]] will also have a chance to create [[Slayer Types]] weapons.\n* When using [[Wood|special wood types]] in the [[Britain Crafting Area]], you will have a chance to create weapons with up to 3 magical properties. The more rare a [[Wood|wood type]] is, the better chance at greater properties!\n* [[Slayer Deeds]] can be applied to crafted wood weapons as long as they are exceptional and have at least two other modifiers.\n* [[Power Scrolls]] and [[Skill Scroll]] are available for this skill.\n* Special Crafting Recipes can be found to add to the types of items available on the Crafting menu.\n\n==Usage==\nBy double clicking a Carpentry tool (Such as a saw or a hammer) you get to the Carpentry menu where you can select the Wooden Items you want to make, view the success chance, ingredients needed, and minimal Carpentry skill to attempt making the item. If you have below the level needed, it will tell you that you’re not skilled enough to try.\n\n===Tools of the Trade===\nCarpenter's tools come in all shapes and sizes. However, it is less the tool than the skill of the craftsman, and no one tool provides benefits over the others. They can be bought from a Carpenter or Tinker NPC Vendor or crafted using the Tinkering skill.\n\n{| class=\"wikitable\"\n! Tools \n|-\n| Dovetail Saw \n| Draw Knife \n| Froe \n| Hammer \n| Inshave \n| Jointing Plane \n| Molding Planes \n| Nails \n| Saw \n| Scorp \n| Smoothing Plane \n|}\n\n===Wood Types===\nThere are various different types of wood which grant different bonuses to items crafted by Carpentry as well as [[Fletching]]. To collect colored woods from trees you will need 100 or higher [[Lumberjacking]].\n\n{| class=\"wikitable\"\n! Wood\n|-\n| [[File:plainLog.png]]Plain\n|-\n| [[File:oakLog.png]]Oak\n|-\n| [[File:ashLog.png]]Ash\n|-\n| [[File:yewLog.png]]Yew\n|-\n| [[File:heartwoodLog.png]]Heartwood\n|-\n| [[File:bloodwoodLog.png]]Bloodwood\n|-\n| [[File:frostwoodLog.png]]Frostwood\n|}\n\n==Related Skill Crafting==\nA Carpenter that has been cross trained with other crafting skills will have the ability to create specialized items. These items are generally useful to the type of skill that the crafter is cross trained in, for instance if you have enough [[Blacksmithing]] you can create forges and anvils for your home. You can see what is required from any of the [[Carpentry#Tools of the Trade|wooden crafting tools]]:\n\n[[File:CarpentryMenuSmallForge.PNG]]\n\n===Related Skills===\n* [[Blacksmithing]]\n* [[Fishing]]\n* [[Magery]]\n* [[Musicianship]]\n* [[Tailoring]]\n* [[Tinkering]]\n\n==Stonecrafting==\n[[Stone_crafter|Stonecrafting(Masonry)]] is also available to GM Carpenters, the stone crafter is at the [[Provisioner]] in [[Minoc|Minoc - The Survival Shop]]. Purchase the book called \"Making Valuables with Stonecrafting\" and a mallet and chisel and gather some [[Mining|Quality Granite]] to start creating furniture and decorations from Stone! Quality Granite can be mined with a GM Miner and only after the book \"Mining for Quality Stone\" has been read. The Stone crafted items retain the hue of the Quality Granite, which can be any of the Metal Ore colors.\n\n==Ships==\n[[Galleons|Ships]] can be crafted from the Carpentry menu once you have reached 100 skill and have used the specific [[Galleons|Galleon Recipe]]. There are many required materials and not all of them are craftable like the \"ship parts\", you can refer to the [[Galleons#Crafting_Materials|Galleons list of Crafting Materials]] for more information on crafting ships!\n\n[[File:CarpentryMenuTokunoGalleon.PNG]]\n\n==Recommended Leveling==\n:0-50: Buy from NPC\n:50-68: Wooden Shields\n:68-74: Fishing Poles (Requires 40.0 displayed tailoring skill, train from NPC)\n:74-80: Quarter Staff\n:80-100: Gnarled Staff\n\n==See Also==\n* [[Blacksmithing]]\n* [[Fishing]]\n* [[Lumberjacking]]\n* [[Galleons]]\n* [[Magery]]\n* [[Musicianship]]\n* [[Stone crafter]]\n* [[Tailoring]]\n* [[Tinkering]]\n* [[Wood]]\n\n[[Category:Skills]]\n[[Category:Crafting]]"
          }
        ]
      }
    }
  }
}