{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "1469": {
        "pageid": 1469,
        "ns": 0,
        "title": "Cartography",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[File:Flag_cartography.gif|thumb]]\n__TOC__\n==Description==\nThe Cartography skill is used to create Maps of your surroundings and the world. It's a primary skill for Treasure Hunters in order to decode maps found on creatures. In order to craft maps you just need blank scrolls and mapmaker's pens.\n\n==Usage==\nMaps can be crafted using a mapmaker's pen and scrolls. Simply click the mapmaker's pen and choose what type of map you would like to create. There are Local Maps, City Maps, Sea charts and World maps. Crafting these maps is skill dependent.\n\n[[File:Map.gif]] [[Treasure Map]]s show the location of where a Treasure Chest is buried. The maps require [[Cartography]] skill to decode at which point it will no longer say it is tattered but will display the location of the buried treasure chest.\n\nA map may decoded by another person, but the person digging up the map must still have the minimum required [[Cartography]] skill for the level of [[Treasure Map]]. Mining skill helps, as high skill allows you to dig for the chest without being more than a tile away.\n\nAll treasure chests are trapped and Remove Trap skill will take care of it, but the skill is not required as many players simply cast Telekinesis on the chest to trigger the trap from a safe distance of five or more steps away.\n\nA high skill level in [[Lockpicking]] is useful as it vastly reduces the number of lockpick attempts required to open a chest. For each failed attempt, an item in the chest may be destroyed.\n\nMining skill is not required to dig up a treasure chest. However, the higher a character's Mining skill, the further away from the exact spot they can be when attempting to dig up the chest. With no Mining skill, the digger must be directly on the correct spot where the chest is buried. See [[Treasure Map]]\n\n==Recommended Leveling==\nBuy plenty of scrolls and mapmaker's pens.\n:0-50: Buy from NPC\n:50-65: City Maps\n:65-99.5: World Maps\n:99.5 - 100 - Level 3 and 4 [[Treasure Map]]s\n\n'''Note:''' You only need 70 Cartography to decipher up to level 6 maps but it may take a few attempts.\n\n==See Also==\n*[[Lockpicking]]\n*[[Treasure Map]]\n\n[[Category:Skills]]"
          }
        ]
      }
    }
  }
}