{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "3736": {
        "pageid": 3736,
        "ns": 0,
        "title": "Celebration Cake",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Items]][[Category:Events]]\n[[File:Celebration_Cakes_Preview.PNG|thumb|A Celebration Cake for the Player Appreciation Event on 11/12/2023.]]\n__TOC__\n=Description=\nCelebration Cakes are given out during [[Events|special events]] such as the [[Player_Appreciation_Event|Player Appreciation Week]]. Each cake is bound to a player, however when used the bonuses apply to all characters on that account. Cakes have a [[Celebration_Cake#Buffs|rotting time]], meaning that they will no longer be usable after a certain period of time, so if you do not use it within this [[Celebration_Cake#Buffs|rotting time]], you will miss out of the benefits of the cake. All cakes have a duration of how long the [[Celebration_Cake#Buffs|Buffs]] last, these [[Celebration_Cake#Buffs|Buffs]] can '''NOT''' extend the cakes usable time beyond the [[Celebration_Cake#Buffs|rotting time]]. Cake Buffs can be used in conjunction with [[Consumable_Perks|Consumable Perks]] for example, during Special Events where Double Experience is given, the bonus is additive, which means that using any [[Consumable_Perks#Perks|Experience Based Perk]] during these times will set your bonus to Triple Experience for the duration of the perk.\n\nIn order to get these benefits, you simply need to double click the cake, after doing so will receive see this message and the corresponding [[Celebration_Cake#Buffs|Buffs]] will appear in the Buff bar:\n\n[[File:Celebration_Cakes_Consume_Message.PNG]]\n\n==Notes==\n* Cakes are not intended to be traded, and thus, cannot be placed within containers or traded with other players.\n* Cakes are bound to the Player, and only that player can eat the cake [[Celebration_Cake#Buffs|before it rots]].\n* Any [[Celebration_Cake#Buffs|Buffs]] received from these cakes that are tied to an event will end when the event ends, regardless of the time left reported on the [[Status#Buff_Bar|Buff Bar]].\n* Not all cakes will have the same buffs, they are custom made for the type of celebration, and may have not have all the following listed [[Celebration_Cake#Buffs|Buffs]].\n* The [[Status#Buff_Bar|Buff Bar]] can be re-enabled with the Blue Gem on the [[Status#Graphical_Extended_Status|Status Bar]], it can also be expanded and shrunk using the Blue Gem on the [[Status#Buff_Bar|Buff Bar]].\n\n[[File:Status_Buff_Bar_Preview.PNG|The Buff Bar can be re-enabled with the blue gem on the Status Bar, it can also be expanded and shrunk using the Blue Gem on the Buff Bar.]]\n\n=Rot=\nAll cakes have an expiry time known as Rot. If a player does not consume the cake before this Rot timer, the cake will not be useable, furthermore, any [[Celebration_Cake#Buffs|Buffs]] received from these cakes will end when the cake was supposed to Rot as well. The [[Celebration_Cake#Buffs|Buffs]] will be removed at the time the cake is supposed to rot, regardless of the time left reported on the [[Status#Buff_Bar|Buff Bar]]. If a player waits to use the cake when there are 5 minutes left before the cake would rot, and there is a 2 day duration of the [[Celebration_Cake#Buffs|Buffs]] on the cake, the [[Celebration_Cake#Buffs|Buffs]] will last for 5 minutes. Rot timers are generally associated to the length of an event, so be sure to use your cake during the intended event or it will become unusable!\n\n=Buffs=\nThere are many different types of buffs that can appear on a cake, and when consuming a cake you will receive icons related to the specific buffs on your [[Status#Buff_Bar|Buff Bar]]. These buffs persist for as long as is shown from the tooltips on the bar or when the [[Celebration_Cake#Buffs|cake would rot]], whichever comes first. The buffs are generally represented in percentage, for example '''Gold Multiplier: 200%'''. This indicates that whatever amount of random gold would drop from a monster would have 2 times as much gold, i.e: if a Harpy drops 150 gp it will now drop 300 gp. In regards to drops that do not have a 100% rate to be in the corpse of a monster, such as a [[Skill_Scroll|Skill Scroll]], the '''Special Multiplier: 200%''' would mean that if the [[Skill_Scroll|Skill Scroll]] chance was 1/50 chance to drop, it now has 2/50(or 1/25). Keep in mind that these are not real numbers of the drop chance of a [[Skill_Scroll|Skill Scroll]], this was just an example.\n\n==Gold==\nThe Gold Multiplier bonus will apply to any monster that is slain by you or your pets. This does not apply to [[Treasure_Map|Treasure Maps Gold values]], NPC gold sales, quest reward gold, or anything else that is not directly related to you killing a monster. \n\n[[File:Celebration_Cakes_Gold_Multiplier_Buff.PNG]]\n\n==Skill==\nThe Skill Gain Multiplier will apply only to [[Skills]], not Experience for [[Meta_Talismans#Training_Meta_Talismans|Meta Talisman Experience or Relic Experience]] or [[Meta_Pets|Meta Pet Experience or Relic Experience]]. [[Skill_Gain|Skill Gain Modifiers]] still apply when using this cake, so if you are training in the West Britain Bank, you can expect to have no skill gain as it is a -100% skill gain area.\n\n[[File:Celebration_Cakes_Skill_Multiplier_Buff.PNG]]\n\n==Special==\nThe Special Multiplier is designed for both Experience and Drop Chance. Experience based systems such as [[Meta_Talismans#Training_Meta_Talismans|Meta Talisman Experience or Relic Experience]] or [[Meta_Pets|Meta Pet Experience or Relic Experience]]. [[Skill_Gain|Skill Gain Modifiers]] are affected by this buff. Drop Chance applies to many different items and scenarios, some examples are [[Meta_Talismans#Relics_and_Abilities|Meta Talisman Relics]], [[Meta_Pets#Relics_and_Abilities|Meta Pet Relics]], [[Random_Dungeon_Adventure#Fragments|RDA Fragments]], [[Skill_Scroll|Skill Scrolls]], [[Dungeon_Cloth|Dungeon Cloth]], [[Monster_of_the_Week#Rewards|Monster of the Week Rewards]], etc...\n\n[[File:Celebration_Cakes_Special_Multiplier_Buff.PNG]]\n\n=See Also=\n*[[Consumable_Perks|Consumable Perks]]\n*[[Handouts]]\n*[[Meta_Talismans|Meta Talismans]]\n*[[Meta_Pets|Meta Pets]]\n*[[Skills]]\n*[[Skill_Gain|Skill Gain Modifiers]]"
          }
        ]
      }
    }
  }
}