{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "224": {
        "pageid": 224,
        "ns": 0,
        "title": "Champion Spawns",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Quests]][[Category:Player vs Monster]]\n__TOC__\n==General Information==\nChampion spawns are on a 3-4 hour timer that starts from when the champion was last killed. To activate a champion spawn, 4 players must be standing on or near the altar. If the champion spawn is ready to be activated and there are 4 players near the altar, everyone in the champion spawn region will get a warning notifying them that spawn will begin. 30 seconds after the warning, the champion spawn will start. Champion spawns will release waves of Monsters that will get harder as you progress through the spawn and eventually leading to the champion. As Monsters are killed, white candles will appear in the middle of the altar. After 4 white candles, they will disappear and a red candle will appear on the outer edge of the altar. There are 4 sides of a champion spawn altar. Each side represents a different level and there are 4 levels. Once you have red candles surrounding the altar and 4 white candles in the middle of the altar, the champion will spawn. If you kill Monsters too slowly or leave the area, the progress will reverse and candles will disappear. \n\nNotes:\n* In rare cases, when a Champion Spawn has been inactive for 7 hours or more, the Champion Spawn can be started with only 3 characters, keep in mind that it would take very brave and very strong adventures to defeat these waves with any efficiency in order to complete the event! \n* You can also restart a Champion Spawn Cooldown with the use of a [[Consumable_Perks|Champion Perk]] which will reset a Champion Spawn on Cooldown and allow the event to be set off again.\n\n==Champion Spawn Rewards==\n* [[Meta Pets|Meta Pet Relic]] \n* 3 [[Power Scrolls]] (will appear in your backpack after the champion dies)\n* [[Consumable Perks]]\n* [[Antique_of_the_Artisan#Mythical Crafting|Mythical Crafting Recipe]]\n* A champion skull (will appear in your backpack after the champion dies)\n* [[Titles_and_Hues_Guide#Custom_Titles|Title scrolls]]\n* Chance of a clothing bless deed (will drop on the corpse of the champion)\n* Over 50,000 gold (will drop on the ground in the area of the champions death)\n\nTo be eligible for a prize, you must score at least 5000 points.\n\n==Reward Mechanics==\n[[Power Scrolls]] are awarded to players based on a weighted lottery system. Points are awarded according to the damage dealt by both the player and any controlled pets/summons. Direct melee damage is awarded the highest tier of points, while the damage done by pets and summons are the lowest tier. Ranged damage done by archers is only slightly penalized. Damage done to the champion itself is given a 2x bonus.\n\n'''Given 4 players the lottery works as follows:'''\n* Player A receives 80/100 possible points and is granted an 80% chance of a scroll.\n* Player B has 10/100 would only have a 10% chance.\n* Player C has 9/100 would only have a 9% chance.\n* Player D has 1/100 would only have a 1% chance.\n\n==Champion Spawns==\n===Barracoon - Skull of Greed===\n[[File:barracoonBoss.png|right]]\n*'''Location:'''  [[Despise]] Level 2 (Far Northeast corner)\n*'''Slayer:'''  Repond\n*'''Level 1:'''  Slimes & Rabid Rats\n*'''Level 2:'''  Rat archers & Dire Wolves\n*'''Level 3:'''  Rat mages & Hell Hounds\n*'''Level 4:'''  Silver Serpents, Titans, & Ogre Lords\n\n====Notes====\n*First level of barracoon has rats that have the ability to force tamer pets onto the owner. If not paying attention your pet will kill you.\n*When Barracoon hits players or pets he has a chance to turn them into a Ratman (will also flag you as criminal).\n*Casting spells or shooting Barracoon with arrows will also turn you into a Ratman (which will flag you as criminal). To avoid this, you should apply savage paint to your character, polymorph or incognito.\n*When Barracoon is hit with melee weapons, he has a chance to spawn ratmen, rat archers, and rat mages.\n*Baracoon also teleports to random people in his area so watch out!\n\n===Semidar - Skull of Pain===\n[[File:semidar.gif|right]]\n*'''Location:''' [[Abyss]] (there is a red portal on top of the temple at Fire Temple)\n*'''Slayer:''' Exorcism\n*'''Level 1:''' Imps & Greater Mongbats\n*'''Level 2:''' Gargoyles & Harpies\n*'''Level 3:''' Stone Gargoyles & Scorched Gargoyles\n*'''Level 4:''' Deamons & Succubi\n\n====Notes====\n*Semidar has an AoE life leech.\n*Semidar will do more damage to male characters than female.\n\n\n===Neira - Skull of Death===\n[[File:neira.png|right]]\n*'''Location:''' [[Deceit]] level 3\n*'''Slayer:''' Silver\n*'''Level 1:''' Wraiths, Shades, Bogles & Ghouls\n*'''Level 2:''' Bone Mages, Skeletal Mages, & Mummies\n*'''Level 3:''' Bone Knights & Liches\n*'''Level 4:''' Lich Lords & Rotting Corpses\n\n====Notes====\n*Neira throws bones at players when hit with weapons and spells.\n*Neira will spawn random undead when damaged.\n\n\n===Mephitis - Skull of Venom===\n[[File:MephBoss.png|right]]\n*'''Location:''' [[Terathan Keep]]\n*'''Slayer:''' Arachnid\n*'''Level 1:''' Scorpions & Spiders\n*'''Level 2:''' Terathan Drones & Terathan Warriors\n*'''Level 3''': Dread Spiders & Terathan Matriarchs\n*'''Level 4:''' Poison Elementals & Terathan Avengers\n\n====Notes====\n*Mephitis, the spider god, will pull random people to him with webs.\n\n\n===Rikktor - Skull of Power===\n[[File:RikktorBoss.png|right]]\n*'''Location:''' [[Destard]] level 1\n*'''Slayer:''' Reptile\n*'''Level 1:''' Giant Serpents & Lizardmen\n*'''Level 2:''' Lava Lizards & Ophidian Warriors\n*'''Level 3:''' Drakes & Ophidian Mages\n*'''Level 4:''' Dragons & Ophidian Avengers\n\n====Notes====\n*Rikktor casts earthquake which is an AoE.\n\n\n===Lord Oaks - Skull of Enlightenment===\n[[File:Lord_oaks.png|right|200px]]\n*'''Location:''' Just outside of the dungeon [[Wrong]]\n*'''Slayer:''' Fey\n*'''Level 1:''' Pixies & Shadow Wisps\n*'''Level 2:''' Kirins & Wisps\n*'''Level 3:''' Unicorns & Centaurs\n*'''Level 4:''' Ethereal Warriors & Serpentine Dragons\n\n====Notes====\n*After Lord Oaks is damaged, he will spawn his queen, Silvani. Silvani will heal Lord Oaks as well as significantly reduce the damage Lord Oaks takes.\n*Silvani will need to be killed before Lord Oaks but she will summon pixies on her attackers.\n*When damaging Lord Oaks, your health, mana, and stamina will be drained so it is best to kill him with a mage.\n\n\n===Corpse Devourer - Random Champion Skull===\n[[File:corpsedevourer.png|right]]\n*'''Location:''' [[Covetous]] Level 5 (far Southeast corner)\n*'''Slayer:''' Silver\n*'''Level 1:''' Wraiths, Shades, & Infernal Creepers\n*'''Level 2:''' Skeletal Mages & Damned Souls\n*'''Level 3:''' Skeletal Knights & Liches\n*'''Level 4:''' Lich Lords & Rotting Corpses\n\n====Notes====\n*When the Corpse Devourer is poisoned, all damage he receives is converted to health. So, do NOT attack him while he is poisoned! Wait for him to cure himself or have someone cure him\n*If the Corpse Devourer kills you, he will eat your corpse, devouring all of your loot (minus blessed/newbied Items).\n*The Corpse Devourer will change his AI switching from magery to archery to melee as he loots players corpses.\n*Has several AoE abilities. One looks like a green cloud moving outward from him. If this cloud touches you, you will be paralyzed. Another AoE ability is a fire spell that also shoots outward from the champion.\n*One of his attacks creates an effect on your client which causes it to darken and makes various tombstones and symbols float across your game screen. Don't worry, your computer hasn't been hacked ;) The effect ends after a few seconds.\n\n===Osiredon - Random Champion Skull(except Skull of Enlightenment)===\n[[File:waterchampboss.png|right]]\n*'''Location:''' Middle of the sea! Approximately 64° 14'S, 128° 15'W.\n*'''Slayer:''' Elemental for Level 1, Reptile for Level 2 and 3\n*'''Level 1:''' Water Elementals & Sea Serpents\n*'''Level 2:''' Water Elementals & Deep Water Elementals\n*'''Level 3:''' Crystal Sea Serpents & Deep Sea Serpents\n*'''Level 4:''' Urchins and Isopods\n\n====Notes====\n* Has poison based melee hits that apply lethal poison.\n* It is highly recommended to do this champ with boats.\n* He has the ability to two shot defense talisman players wearing full armor.\n\n===Gorde - Random Champion Skull(except Skull of Enlightenment) ===\n[[File:gorde.png|Gorde|right]]\n*'''Location:''' [[Shame]]\n*'''Slayer:''' Elemental\n*'''Level 1:''' Scoprions & Earth Elementals\n*'''Level 2:''' Water Elementals\n*'''Level 3:''' Air Elementals\n*'''Level 4:''' Blood Elementals & Poison Elementals\n\n====Notes====\n* Brave explorers are still gathering this information!\n\n\n===Gruumsh - Random Champion Skull(except Skull of Enlightenment)===\n[[File:Orcboss.png|Gruumsh|right]]\n*'''Location:''' [[Orc Cave]]\n*'''Slayer:''' Repond\n*'''Level 1:''' Orcs / Grey Orcs\n*'''Level 2:''' Orcish Brutes / Orcish Lord\n*'''Level 3:''' Orcish Bomber / Orc Mages\n*'''Level 4:''' Orcish Leader / Orc Brutes\n\n====Notes====\n* Gruumsh will go after you even if your wearing an orc mask, which will cause it to blow up resulting is your characters demise.\n* Casting spells or shooting Gruumsh with arrows will also turn you into a orc (which will flag you as criminal). To avoid this, you should apply savage paint to your character, polymorph or incognito.\n* Gruumsh, Orcish Leader and Orc Brutes will summon more orcs if magic spells are cast on them - Best for mages to use Energy Vortexes against them.\n* Added in September 2017: [https://www.uoforum.com/threads/uh-tribuut-tu-gruumsh-oomie-blud-onlee-tribuut-hoowah.97621/ Original Thread]\n\n\n===Queen of the Snow - Ice Witch===\n[[File:Queenofthesnow-256.png|Queen of the Snow|right]]\n*'''Location:''' [[Ice Dungeon]]\n*'''Slayer:''' Elemental Ban / Repond\n*'''Level 1:''' Snow Harpy / Ice Serpent\n*'''Level 2:''' Snow Elementals / Ice Elementals / Arctic Ogre Lords\n*'''Level 3:''' Glacial Giants / White Drakes / Ratman Mages\n*'''Level 4:''' Ice Fiends \n\n====Notes====\n* Be weary, if you attack the Ice Witch directly you will be turned into an Ogre (which will flag you as criminal). Try casting Incognito to fool her.\n* She has a powerful ability to bring giant balls of ice crashing down upon those around her, killing them instantly if they do not heed the summoning warning.\n* Be on guard as disciples of the snow will be summoned to defend her.\n* Added in Jan 2022: [https://youtu.be/ivTxyoU9kDo Original Video Release]\n\n==Double Champ Island==\nDouble Champ Island is located at 179\" 28'N, 68\" 41'W and consists of both the [[Champion_Spawns#Semidar|Semidar Champion]] and the [[Champion_Spawns#Semidar|Rikktor Champion]]. Double the spawn, double the champions, double the rewards!\n[[File:Double_Champ_Island.JPG|center]]\n\n==Whats Next!?==\n===The Harrower===\n[[File:harrower.png|right|Harrower]]\n\nAfter all 6 champions have been defeated and all of the champion skulls have been obtained players can spawn The Harrower! To spawn The Harrower, a player must take the 6 champion skulls to the Star Room and place them on the altar. After all 6 champion skulls are placed on the altar, The Harrower will spawn in a random dungeon on a random level. \n\n[[File:trueHarrower.png|right|True Harrower]]\n\nWhen The Harrower is about to die, he will transform into his true form. Once The Harrower is in his true form, he will be unable to move. He will also spawn several Tentacles of the Harrower around him. These tentacles do an area AoE life leech that will heal themselves and The Harrower but they are easily taken out with archers. After all of the tentacles have been killed, The Harrower is vulnerable to attack! The Harrower will also pull in random people and attack them! [[File:tentaclesofHarrower.png|right]]\n\n*'''Location:''' Random dungeon\n*'''Slayer:''' None\n*'''Rewards From Killing The Harrower:'''\n* 6 [[Power Scrolls]] (appears in your backpack after The Harrower is killed)\n* Over 100,000 gold (drops on the ground after The Harrower is defeated)\n* Skull of Death\n\n[[File:ChampSpawns9.jpg|thumb|200px|Star Room]]\n\n[[Category:Player vs Monster]]"
          }
        ]
      }
    }
  }
}