{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "3643": {
        "pageid": 3643,
        "ns": 0,
        "title": "Community Island",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Events]][[Category:Player Run Events]][[Category:Atlas]][[Category:Places of Note‏‎]]\n[[File:Community_Isle_Radar.PNG|425px|thumb|right|The Community Island as a radar view, up to date as of July, 2023. The Radar view was tilted so that entire image could be caught, please note that North is actually the top of the image, whereas normally North is the Top Right corner.]]\n__TOC__\n\n=Description=\nWelcome to the Community Island! Established in September 2020, the Community Isle has been available for Community Event goers and runners for many years. The Community Island is masterfully designed and decorated by Staff Member Fay, and is under constant updates and construction as the players requests and needs grow! There are so many sites to see and places to visit, most folks are probably familiar with a small part of the Community Island if they have ever attended a [[Community_Auction|Community Auction]] or have trained in the [[Community_Island#Companion_Keep|Companion Keep]], however this is only a very small fraction of what the Island provides. The Community Island has been created at the request of the community, and you may find that there are many places that have been inspired by specific players such as [[Community_Island#Exotic_Zoo|Joe Exotic's Zoo]] and the bakery that was installed for Old Granny's cookies she serves on [[Community_Auction|Community Auction]] nights. There are many [[Community_Island#Community_Events|Community Events]] that are already installed in the island, but the staff is always willing to entertain new community events!\n\n==Location==\nThe Community Island is known as an \"instanced area\" and is only reachable via special moongates. There is a permanent moongate available in the West Britain Bank area known as the West Britain Guard Outpost. When Community Events are currently running, there are generally Staff created moongates that go right to the specific event that only last as long as the event runs. Sometimes if the event runs longer than the intended time, the gates may close, however you can always use the West Britain Guard Outpost moongate to get back to the main part of the island, and then travel on foot/mount to the area of the island where the event is being held!\n\n<gallery widths=300px heights=200px>\nFile:Community_Isle_Britain_Guard_Outpost_Moongate.PNG|The West Britain Guard Outpost where a permanent moongate to the Community Island can be found. This is also a return point for all of the various exit moongates found within the Community Isle.\nFile:Community_Isle_Britian_Radar.PNG|The West Britain Radar Map where the West Britain Guard Outpost and West Britain Bank(WBB) can be seen.\n</gallery>\n\n==Notes==\n* Due to the Islands very large area and multiple event zones, there is not a consistent set of zoning laws for the entire island, and are subject to change based on current events, and where you are in the island. While it is mostly safe to roam around the island, be cautious that you may enter an ungarded zone, a no mount zone, or some other special ruling zone!\n* The island is very large, and if you find yourself dead you may have to wander around to find a teleporter, there are several on the island that will all lead you to the same place in West Britain Bank. However if you cannot find your way out, dont forget you can use a help request to be transferred to a town or your [[Ring_of_Forgiveness|Ring of Forgiveness]] to go to the West Britain Healers.\n\n=Community Events=\nCommunity Events are events that have been designed so that the community participate and in some cases, even run them on their own! Every Community Event is a little bit unique and are always some sort of customization that the staff is able to produce for the players. Staff is always willing to hear new ideas and looking for folks to help run them, so dont be shy, if you like these sorts of events, reach out to them to see how you can run your own!\n\n==Known Community Events==\nHere is a listing of the Known Community Events that are currently available on the Community Island:\n* [[Bomberman|Bomberman]]\n* [[Pet_Fights#Chicken_Fights|Chicken Fights]]\n* [[Community_Auction|Community Auction]]\n* [[Jousting|Jousting]]\n* [[Pet_Fights|Pet Fights]]\n* [[Riddler|Riddler Events]]\n* [[Tournaments]]\n\n==Bomberman==\n[[File:Community_Isle_Bomberman_Radar.PNG|thumb|right|The Map from the Main Teleporter on the Community Island to the Bomberman Arenas located in the East side of the Island.]]\n[[Bomberman|Bomberman]] is an event modeled after the '''Bomberman game'''. Players are sent into a customizable arena and are given a special bomb bag that can be used to blow up walls to collect powerups and reach (and eliminate!) the other players. This event is always available and the '''Bomberman Arena''' can host multiple '''Bomberman games''' at one time. Each game can have up 8 players with with 7 different '''Bomberman Arena''' Types that can range from 7x7 to 25x25 tiles. It should be noted that while player pets are allowed in the Community Island, you cannot have any current Pet Slots in use if you wish to join or start a game. This includes Ethereal mounts, pets sitting in a home, or Hirelings/Summons.\n\n<gallery widths=300px heights=200px>\nFile:Bomberman_7x7_Allnames_07_15_2023.png|A Bomberman Arena quite packed with players! This famously addicting event is a fast paced and fun event that can support up to 8 players at a time with 7 different Arena types that range from 7x7 to 25x25 in size!\nFile:Bomberman_7x7_Big_Explosion_07_15_2023.png|A Bomberman Arena in action with a huge explosion! There many different powerups you can collect while playing the game in order to change the way your bombs work in the field!\nFile:Bomberman_7x7_Blowing_Yourself_Up_07_15_2023.png|A Bomberman Arena with one of the most common results... blowing yourself up! Bombs block player movement, which includes yours as well! Make sure you dont trap yourself while trying to dig to other players.\n</gallery>\n\n==Community Auction==\nThe [[Community_Auction|Community Auction]] is one of the longest and consistently player run events on the '''Community Island'''. The [[Community_Auction|Community Auction]] is every Tuesday from 8 to 10 pm CST and completely run by players on the stage, and from player submissions from the community. The [[Community_Auction|Community Auction]] works very closely to how real auctions are run, however due to the nature of the Ultima Online there may be some differences in the rules that traditional auctions have. Basically players will have submissions which will be processed from '''Auctioneers''' and staged for a particular Auction Night. Folks in the crowd, known as '''Auctionees''', will bid on the items presented on stage during the night of the auction. Bids will be repeated from the '''Auction Lead''', and once an '''Auctionee''' wins an item with the highest bid, the '''Auction Assistant''' will trade and record the record in live time to a public record. There are giveaways, trivia, and special events such as Mystery Chest that can happen during this 2 hour event. Once the Auction has completed, players that had an item sell will receive notifications from the '''Auction Conductor''' 24 hours hours after the event. A small percentage of the sale goes to fund these giveaways and the fill the Mystery Chests as well as fund other other events on the '''Community Island'''! Everyone is welcome to join the community during this public event, no bidding is required to hang out with the crowd and us on a Tuesday night! For more information you can visit the [[Community_Auction|Community Auction]] page.\n\n<gallery widths=300px heights=200px>\nFile:Auction_house.png|'''Welcome to the Community Auction!'''<br \\>Community Island Stage 2022 with Shane, Tony, Fay, Bo, Phnogg, bAdNaMe, and Auction Assistee\nFile:Community_Auction_Island_2021_05.jpg|'''Community Auction at the Community Island 2021'''<br />For the Horses Player Event Promotion from Carl Delinden with Fay, Bo, bAdNaMe, Noemi, and Auction Assistee\nFile:Community_Auction_Island_2021_04.jpg|'''Community Auction at the Community Island 2021'''<br />Trivia Giveaway Event hosted during the final minutes of each Auction with Fay, Bo, bAdNaMe, and Auction Assistee\nFile:Community_Auction_Lyceum_2018.jpg|'''Community Auction at the Lyceum 2018'''<br />Halloween Event 2018 with Fay, Irina and Auction Assistee\n</gallery>\n\n==Jousting==\n[[Jousting|Jousting]] is an event where brave knights challenge each other with [[Jousting#Lance|Jousting Lances]] in order to win Honor for their houses. The tournament event is simple and almost everyone can participate as long as they have met the base requirements to use a [[Jousting#Lance|Jousting Lance]]. This is a tournament style event where 2 combatants will run at each other, while staying their lane, and meet in the middle to deliver a '''Jousting Blow'''. The '''Combatants''' will then continue down the lane until they have touched the other side of the lane, turn around and then meet in the middle again. This will continue until one combatant yields or dies in the field, the winning combatant will continue on to the next contender until the last standing combatant is named Champion! While it is always 2 Combatants in a single Joust, there is an area available designed to host multiple '''Jousts''' at one time.\n\n<gallery widths=300px heights=200px>\nFile:Jousting_Begin_07_15_2023.png|The Jousting Multiple Arena starting a Match! There are currently 8 Contestants fighting in 4 Jousts to compete for Championship.\nFile:Jousting_Confirming_Rules_07_15_2023.png|The Jousting Multiple Arena loading in the Contestants into the individual Jousting Arenas and explaining the rules to each Contestant.\nFile:Jousting_Multiplayer_Action_07_15_2023.png|The Jousting Multiple Arena in full swing! As Contestants lose they can collect their gear and return to their seats in the stands or the balcony.\n</gallery>\n\n=Amenities=\nThere are many amenities available on the island that can be found such as:\n* The Companion Keep\n* Banks and Casinos\n* Taverns and Zoos\n* Healers and Moongates\n\n==Bank==\nThe Community Island Bank is located just south of the Main Gate and north of the Jousting Arena.\n\n[[File:Community_Isle_Bank.PNG|450px|The Community Island Bank just south of the Main Gate and north of the Jousting Arena.]]\n\n==Casino==\nThe Casino is located south of the Jousting Arena and north of the [[Community_Island#Companion_Keep|Companion Keep]]. This multi-level building has Slot Machines, Poker, and even a below ground Nightclub!\n\n===Nightclub===\nThe Night Club entrance is located straight east of the main entrance and contains a Main Stage, Bar, and VIP Lounge with bar.\n\n<gallery widths=300px heights=200px>\nFile:Community_Isle_Casino_Nightclub_Main_Stage.PNG|The Main Stage of the Community Island Casino Nightclub.\nFile:Community_Isle_Casino_Nightclub_Bar.PNG|The Community Island Casino Nightclub Bar.\nFile:Community_Isle_Casino_Nightclub_Lounge_Bar.PNG|The Community Island Casino Nightclub VIP Lounge and bar.\n</gallery>\n\n===Poker===\nThe Community Island Casino Poker Tables located in the Southeast area of the Casino between the pool and Nightclub entrance.\n\n[[File:Community_Isle_Casino_Poker.PNG|450px|The Community Island Casino Poker Tables located in the Southeast area of the Casino between the pool and Nightclub entrance.]]\n\n===Slot Machines===\nThe Community Island Casino Slot Machines located at the entrance of the building.\n\n<gallery widths=300px heights=200px>\nFile:Community_Isle_Casino_Slots.PNG|The Community Island Casino Slot Machines located at the entrance of the building.\nFile:Community_Isle_Casino_Slots_Lady_Luck.PNG|The Lady Luck Slot Machine menu, where you can see all the options and information including last winner and value of the pot!\n</gallery>\n\n==Companion Keep==\nThe Companion Keep is a facility for the [[Companions]] and [[Young_Player_Status|Young Players]] to come and train various skills, meet with [[Companions]], and get access to some equipment and resources. There are Various NPCs that you can learn skills from, locations with strategic setups to train skills such as [[Provocation]] and [[Fishing]], and there is even teleporters to the [[Young_Player_Dungeon|Young Player Dungeon]]. While the access to the keep is not exclusive to Young Players, the resources and teleporters are restricted to the [[Companions]] and [[Young_Player_Status|Young Players]]. The Companion Keep is connected to the Elder Hall north of the [[Britain|West Britain Bank]] by a teleporter that only the [[Companions]] and [[Young_Player_Status|Young Players]] have access to. This Hall is used to service Young Players and belongs to the Companions as a store house for the equipment and resources that Young Players may need. This is also a meeting place for most of their events and contains a teleporter to the Community Island for Companions and Young Players!\n\n<gallery widths=300px heights=200px>\nFile:Community_Isle_Companion_Keep_Entrance.PNG|The Main Entrance to the Community Island Companion Keep located south of the Casino.\nFile:Community_Isle_Companion_Keep_Elders_Hall.PNG|The Elders Hall which is north of the West Britain Bank. This Hall is used to service Young Players and belongs to the Companions as a store house for the equipment and resources that Young Players may need. This is also a meeting place for most of their events and contains a teleporter to the Community Island for Companions and Young Players!\n</gallery>\n\n===Bakery and Farm===\nThis is the Community Island Companion Keep Bakery and Farm where you can train [[Cooking]] and harvest wheat and other things that grow near the kitchen.\n\n[[File:Community_Isle_Companion_Keep_Bakery_And_Farm.PNG|450px|This is the Community Island Companion Keep Bakery and Farm where you can train Cooking and harvest wheat and other things that grow near the kitchen.]]\n\n===Bard Room===\nThis is the Community Island Companion Keep Bard Room where you can train [[Discordance]], [[Musicianship]], [[Peacemaking]], and [[Provocation]] and purchase instruments as well. There is a pair of mongbats in the center of the room that can be provoked on each other to gain skill off of!\n\n[[File:Community_Isle_Companion_Keep_Bard_Room.PNG|450px|This is the Community Island Companion Keep Bard Room where you can train and purchase Bard related skills and instruments. There is a pair of mongbats in the center of the room that can be provoked on each other to gain skill off of!]]\n\n===Combat Training Room===\nThis is the Community Island Companion Hall Combat Training Room which contains NPCs to sell you weapons and bows which you can use against the Skeletal Knight trapped in the halls.\n\n[[File:Community_Isle_Companion_Keep_Combat_Training_Room.PNG|450px|This is the Community Island Companion Hall Combat Training Room which contains NPCs to sell you weapons and bows which you can use against the Skeletal Knight trapped in the halls.]]\n\n===Docks===\nThe Community Island Companion Hall Docks where you can learn and practice your [[Fishing]] skills.\n\n[[File:Community_Isle_Companion_Keep_Docks.PNG|450px|The Community Island Companion Hall Docks where you can learn and practice your Fishing skills.]]\n\n===Lockpicking Training Room===\nThis is the Community Island Companion Hall Lockpicking Training Room located in the South East corner of the first level of the Keep. There you will find 3 crates to train your [[Lockpicking|Lockpicking Skill]] on up to 94.7 Real Skill and a book written by Colin explaining the process. The left most crate can be used to around 62 skill, the middle crate can take you to 75 skill, and the right crate can take you to 94.7. You can create a macro where you double click the key next to the crate to lock the crate, then use your lock picks to unlock the crate.\n\n[[File:Community_Isle_Companion_Keep_Lockpick_Training_Area.PNG|450px|This is the Community Island Companion Hall Lockpicking Training Room which contains 3 crates to train your Lockpicking Skill on up to 94.7 Real Skill.]]\n\n===Magery Training Room===\nThis is the Community Island Companion Hall Combat Magery Training Room which contains some NPCs that can train and sell resources for [[Alchemy]], [[Inscription]], [[Magery]], [[Resisting_Spells|Resisting Spells]]. There are 2 trapped mongbats to cast harmful spells on and there is a farm in the corner of the room that grows [[Reagents]] very slowly.\n\n[[File:Community_Isle_Companion_Keep_Magery_Training_Room.PNG|450px|This is the Community Island Companion Hall Combat Magery Training Room which contains some NPCs that can train and sell resources for Alchemy, Inscription, Magery, Resisting Spells. There are 2 trapped mongbats to cast harmful spells on and there is a farm in the corner of the room that grows Reagents very slowly.]]\n\n===Stables===\nThis is the Community Island Companion Hall Stables where you can learn the skills required for taming, training, and caring for animals such as [[Animal_Taming|Animal Taming]], [[Animal_Lore|Animal Lore]], and [[Veterinary]].\n\n[[File:Community_Isle_Companion_Keep_Stables.PNG|450px|This is the Community Island Companion Hall Stables where you can learn the skills required for taming, training, and caring for animals.]]\n\n===Workshop===\nThis is the Community Island Companion Hall Workshop where you can find all the NPCs required for your [[Blacksmithing]], [[Carpentry]], [[Tailoring]], and [[Tinkering]] training and resources.\n\n[[File:Community_Isle_Companion_Keep_Workshop.PNG|450px|This is the Community Island Companion Hall Workshop where you can find all the NPCs required for your blacksmithy, woodworking, and tailoring training and resources.]]\n\n===Young Dungeon and Healer===\nThis is the Community Island Companion Hall [[Young_Player_Dungeon|Young Dungeon]] Moongate and Healer room. This also functions as a meeting hall for storming the Young Dungeon!\n\n[[File:Community_Isle_Companion_Keep_Young_Dungeon_Moongate_And_Healer.PNG|450px|This is the Community Island Companion Hall Young Dungeon Moongate and Healer room. This also functions as a meeting hall for storming the Young Dungeon!]]\n\n==Teleporters==\nThere are many Moongates located on the Island all of these are exits that go back to the [[Britain|West Britain Bank]]. Permanent Moongates get added as more community events are added to the Community Island, however you may find Temporary Moongates during the actual events themselves! The following Moongates are the known Permanent Moongates on the Community Island.\n\n===Amphitrite Moongate===\nThis is the Community Island Amphitrite Moongate located in the North East corner of the Community Island.\n\n[[File:Community_Isle_Amphitrite_Moongate.PNG|450px|This is the Community Island Amphitrite Moongate located in the North East corner of the Community Island.]]\n\n===Bomberman Moongate===\nThis is the Community Island Bomberman Moongate located in the Northern Point of the Bomberman Arena on the East side of the Community Island.\n\n[[File:Community_Isle_Bomberman_Moongate.PNG|450px|This is the Community Island Bomberman Moongate located in the Northern Point of the Bomberman Arena on the East side of the Community Island.]]\n\n===Jousting Moongate===\nThis is the Community Island Jousting Moongate located between the Community Auction Stage and behind the Jousting Arena on the West side of the Community Island.\n\n[[File:Community_Isle_Jousting_Moongate.PNG|450px|This is the Community Island Jousting Moongate located between the Community Auction Stage and behind the Jousting Arena on the West side of the Community Island.]]\n\n===Main Moongate===\nThis is the Community Island Main Moongate which is on the West side of the Community Island. This is where you will end up coming from [[Britain]] and will also send you back to the [[Britain|West Britain Guard Outpost]].\n\n[[File:Community_Isle_Main_Moongate.PNG|450px|This is the Community Island Main Moongate which is on the West side of the Community Island. This is where you will end up coming from Britain and will also send you back to the West Britain Guard Outpost.]]\n\n===Riddler Moongate===\nThis is the Community Island Riddler Moongate which is located on the East side of the Community Island across from the [[Community_Island#Companion_Hall|Companion Hall]].\n\n[[File:Community_Isle_Riddler_Moongate.PNG|450px|This is the Community Island Riddler Moongate which is located on the East side of the Community Island across from the Companion Hall.]]\n\n===Tavern Moongate===\nThis is the Community Island Tavern Moongate located in the center of the Community Island right in front of the [[Pet_Fights|Pet Fights Arena]].\n\n[[File:Community_Isle_Tavern_Moongate.PNG|450px|This is the Community Island Tavern Moongate located in the center of the Community Island right in front of the Pet Fights Arena.]]\n\n===Exotic Zoo Moongate===\nThis is the Community Island Exotic Zoo Moongate located in the North part of the Community Island between the [[Community_Auction|Community Auction]] Stage and the [[Community_Island#Exotic_Zoo|Exotic Zoo]].\n\n[[File:Community_Isle_Zoo_Moongate.PNG|450px|This is the Community Island Exotic Zoo Moongate located in the North part of the Community Island between the Community Auction Stage and the Exotic Zoo.]]\n\n==Exotic Zoo==\nThis is the Community Island Exotic Zoo which was donated to the public after heroic and valiant efforts of campaigning by Joe Exotic and his collective colleagues. The Exotic Zoo animal change every once in a while, and you can find exotic animal sights that can be seen no where else in Sosaria!\n\n===Exotic Display===\nThese Animals seem to rotate out every once in a while, and is a popular attraction to visit before [[Community_Auction|Community Auction]] events start!\n\n<gallery class=\"inline\" widths=300px heights=200px mode=\"slideshow\">\nFile:Community_Isle_Joes_Zoo_Elephants.PNG|This is the Community Island Exotic Zoo where the Elephants can be found!\nFile:Community_Isle_Joes_Zoo_Gorillas.PNG|This is the Community Island Exotic Zoo where the Gorillas can be found!\nFile:Community_Isle_Joes_Zoo_Lions.PNG|This is the Community Island Exotic Zoo where the Lions can be found!\nFile:Community_Isle_Joes_Zoo_Magma_Lizards.PNG|This is the Community Island Exotic Zoo where the Magma Lizards can be found!\nFile:Community_Isle_Joes_Zoo_Panda_Bears.PNG|This is the Community Island Exotic Zoo where the Pandas can be found!\nFile:Community_Isle_Joes_Zoo_Polar_Bears.PNG|This is the Community Island Exotic Zoo where the Polar Bears can be found!\nFile:Community_Isle_Joes_Zoo_Tiger_Cubs.PNG|This is the Community Island Exotic Zoo where the Tiger Cubs can be found!\nFile:Community_Isle_Joes_Zoo_Unicorns.PNG|This is the Community Island Exotic Zoo where the Unicorns can be found!\n</gallery>\n\n==Healers==\nThere are a few locations where you can receive resurrections and healing services on the Community Island. There is a main healer and spa located in the center of the Community Island directly across [[Community_Island#Main_Moongate|Main Moongate]], a West side back alley healer between the [[Community_Auction|Community Auction Stage]] and the [[Jousting|Jousting Arena]], and then the healer in the [[Community_Island#Companion_Keep|Companion Keep]].\n\n<gallery widths=300px heights=200px>\nFile:Community_Isle_Healer.PNG|This is the Community Island Healer and Spa tent located in the center of the Community Island and directly across from the Main Moongate.\nFile:Community_Isle_Healer_Auction.PNG|This is the Community Island Back Alley Healer located between the Community Auction Stage and the Jousting Arena on the West side of the Community Island.\nFile:Community_Isle_Companion_Keep_Young_Dungeon_Moongate_And_Healer.PNG|450px|This is the Community Island Companion Hall Young Dungeon Moongate and Healer room.\n</gallery>\n\n==Tavern==\nThis is the Community Island Tavern located in the center of the Community Island directly across from the Main Moongate and south of the Pet Fights Arena.\n\n[[File:Community_Isle_Tavern.PNG|450px|This is the Community Island Tavern located in the center of the Community Island directly across from the Main Moongate and south of the Pet Fights Arena.]]\n\n=Contributors=\nThe community would like to thank the following brave adventurers who contributed their time and experiences for others to enjoy:\n* Bo\n* Buttercup\n* Colin\n* Deadpool\n* Fay\n* Joe Exotic\n* MsBabyDoll\n* Old Granny\n* Piper\n* Skye\n* Stradh\n* Tapecaster"
          }
        ]
      }
    }
  }
}