{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "2363": {
        "pageid": 2363,
        "ns": 0,
        "title": "Community Auction",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Events]][[Category:Player Run Events]]\n<div style=\"float:left\">__TOC__</div>\n<gallery class=\"inline\" widths=\"100px\" heights=\"100px\" mode=\"slideshow\">\nFile:Auction_house.png|'''Welcome to the Community Auction!'''<br \\>Community Island Stage 2022 with Shane, Tony, Fay, Bo, Phnogg, bAdNaMe, and Auction Assistee\nFile:Community_Auction_Island_2022_05_10.png|'''Community Auction at the Community Island 2022'''<br />Community Island Stage 2022 with Shane, Ares-, Bo, pancing, Nevada, and Auction Assistee\nFile:Community_Auction_Island_2022_04_19.png|'''Community Auction at the Community Island 2022'''<br />Community Island Stage 2022 with Fay, Carl, Bo, G-, Pancing, and Auction Assistee\nFile:Community_Auction_Island_2022_03_15.jpeg|'''Community Auction at the Community Island 2022'''<br />Community Island Stage 2022 with Shane, Bo, Tapecaster(The Riddler), Pancing, and Auction Assistee\nFile:Community_Auction_Island_2022_01.jpg|'''Community Auction at the Community Island 2022'''<br />Community Island Stage 2022 with Shane, Tony, Fay, Bo, Phnogg, bAdNaMe, and Auction Assistee\nFile:Community_Auction_Island_2021_04.jpg|'''Community Auction at the Community Island 2021'''<br />Trivia Giveaway Event hosted during the final minutes of each Auction with Fay, Bo, bAdNaMe, and Auction Assistee\nFile:Community_Auction_Fall_Bazaar_2021.jpg|'''Community Auction at the Fall Bazaar 2021'''<br />Halloween Event 2021 with Fay, Bo, Winston, Nevada, and Auction Assistee\nFile:Community_Auction_Island_2021_05.jpg|'''Community Auction at the Community Island 2021'''<br />For the Horses Player Event Promotion from Carl Delinden with Fay, Bo, bAdNaMe, Noemi, and Auction Assistee\nFile:Community_Auction_Island_2021_02.jpg|'''Community Auction at the Community Island 2021'''<br />120 Animal Taming Power Scroll with Fay, Bo, Winston, bAdNaMe, and Auction Assistee\nFile:Community_Auction_Island_2021_01.png|'''Community Auction at the Community Island 2021'''<br />Hellkite Wyrm with Fay, Tony, Carl, Bo, Runelady, and Auction Assistee\nFile:Community_Auction_Island_2021_03.jpg|'''Community Auction at the Community Island 2021'''<br />Community Island Stage 2021 with Shane, Fay, Bo, bAdNaMe, and Auction Assistee\nFile:Community_Auction_Nujelm_2020_02.jpg|'''Community Auction at Nujelm 2020'''<br />Nujelm Stage with Fay, Tone, Runelady, Nevada, and Auction Assistee\nFile:Community_Auction_Nujelm_2020_01.jpg|'''Community Auction at Nujelm 2020'''<br />Nujelm Stage with Fay, Tony, and Auction Assistee\nFile:Community_Auction_Winter_Bazaar_2019.jpg|'''Community Auction at the Winter Bazaar 2019'''<br />Winter Stage with Fay, Irina, and Auction Assistee\nFile:Community_Auction_Summer_Bazaar_2019.jpg|'''Community Auction at the Summer Bazaar 2019'''<br />Beach Front Stage with Fay, Irina, and Auction Assistee\nFile:Community_Auction_Nujelm_2019.jpg|'''Community Auction at Nujelm 2019'''<br />House Addon Entry with Fay, Tony, Advct, and Auction Assistee\nFile:Community_Auction_Lyceum_2018.jpg|'''Community Auction at the Lyceum 2018'''<br />Halloween Event 2018 with Fay, Irina and Auction Assistee\n</gallery>\n\n==General Information==\nWelcome fellow Sosarians to the Ultima Online Forever Community Auction Event, where you will find all the information you need to enjoy one of the longest standing weekly events!\nThe Player Run Auction has been a tradition in the Ultima Online experience for as long as Sosarians could remember. The concept is simple really, Players gather around a common location, items are presented on the stage, Players offer a prices they are willing to pay, and the highest price stated wins the item. This Player Run Auction is no different, however this is a much larger scale event and to keep it running smoothly... we present to you a guideline with everything you need to know from announcements to winning items, entering items to payouts, special events, and all the rules in-between that keep this event fun for everyone!\n\n===Location===\nThe Community Auction is held on the Community Island which is a special event area for Community run events!\nMoongates will be available prior to the event, however feel free to explore the island, and if you get lost you can find the event here:<br \\>\n<gallery class=\"center\" widths=\"100px\" heights=\"100px\" mode=\"slideshow\" showthumbnails>\nFile:Community_Island_Moongate_Brit.JPG|'''Community Island Moongate West Britain City Side'''<br />Simply walk West from the West Britain Bank, into the small tower, and up to the blue Moongate.\nFile:Community_Island_Moongate_Island.JPG|'''Community Island Moongate Community Island Side'''<br />Exit the Platform East, then walk North until you see reach the Zoo, then walk West to enter the Stadium.\nFile:Community_Island_Moongate_Auction_House.JPG|'''Community Island Moongate Community Island Zoo Side'''<br />When the Event Gates are turned on, they will put you here, where you can simply walk West to reach the Stadium.\n</gallery>\n\n===Announcements===\nThe Community Auction is held on the first Tuesday night of every Month starting at 9:00PM EST, the announcement can be found in the [https://discord.uoforever.com/ UOF Discord] under the #announcements and #community-auction channels.<br \\>Every Announcement comes with a preview of the potential items available during the event, this preview is also available up to 24 hours in advance.<br \\>\n\n==Winning Items from the Stage==\nSee some items that interest you from the preview? Winning them is a breeze!<br \\>\nSimply attend the Community Auction during it's [[Community_Auction#Announcements|event time]] at it's [[Community_Auction#Location|location]] and make sure you pay attention to the [[Community_Auction#Bidding_Rules|bidding rules]].<br \\>\nThere is a simple 2 step process for winning an item; [[Community_Auction#How_to_Bid|Placing a Bid]] and [[Community_Auction#Where_to_Retrieve_the_Item|Retrieving the Item]].\n\n===How to Bid===\nWhen you see an item you are ready to place a bid on, simply say the number you wish to bid and wait for the Lead Auctioneer to repeat your bid or another bid that is higher.<br \\>\n<div class=\"center\">[[File:Community_Auction_Winning_An_Item_Bidding.JPG|Frame|Upright|Placing a Bid]]</div>\n\nThe Lead Auctioneer will repeat the name of the highest bidder and the amount of the bid, followed by \"Going once!\", \"Going Twice!\". If there are no other bids the Lead Auctioneer will say \"Sold!\" followed by the Winners Name and the Amount of the Sale.<br \\>\n<div class=\"center\">[[File:Community_Auction_Winning_An_Item_Winning.png|Frame|Upright|Placing a Bid]]</div>\n\n===Where to Retrieve the Item===\nTo the West and East of the main stage is where you pay for the items for your winning bid. Payment is required to be made before the next item can start the bids, so please make sure you briskly move to the Trade Area to trade with the current Auction Assistant to keep the Community Auction running smoothly!<br \\>\n<div class=\"center\">[[File:Community_Auction_Winning_An_Item_Trading.png|Frame|Upright|Retrieving the Item]]</div>\n\n===Auction Bidding Rules===\nIn order to move the bidding process as quickly as possible, please make sure you understand the following rules:\n# The Bidding increments can be found on signs posted around the Community Auction House.\n# Bidding Increments need to be a minimum of 5k or above the previous highest bid to be accepted. Once bidding reaches 1 million the increments need to be a minimum of 100k or above. (1k-999k Increments of 5k or more, 1m+ increments of 100k or more)\n# While we encourage open discussions between players at the Community Auction, please note that any numbers stated during these conversations may be accepted as bids. There are many folks attempting to place bids and we cannot determine in real-time which number was a bid vs a casual conversation involving numbers. If you wish to speak so someone, feel free to use the [[Party|Party System]] to create a silent chat with a group of up to 10 Players, or use the guild/alliance chats if you already belong to those.\n# Please do not spam, if you have macros that involve a lot of spamming, please turn off your assistant programs. Spamming makes the Journal move very fast and we may miss bids if we cannot validate them in the Journal.\n# If a bid is placed, it is assumed that the Player has the payment, in gold, in the bank, on the character that made the bid whom will be making the trade, and will be paying this amount after the bidding has stopped. Failure to do so is a waste of the Auction Community's time and will be met with removal/jail/bans if necessary.\n# However we understand that in the excitement of bidding, we can get confused or forget how much money we have in the bank, please make sure you check the balance of your bank before placing a bid in the event you are unsure. You can silently check this with a \"Ctrl + Left Click\" to retrieve the options from the banker and select \"Check Balance\" which will only show in your own personal Journal.\n\n==Submitting Entries to the Stage==\nEnjoyed winning things in the Community Auction?<br \\>\nWant to make some of that money back, perhaps you have an interesting Item laying around, or would personally like to see a particular item on the stage?<br \\>\nGood News! Submitting Entries into the Community Auction is also an easy 2 step process; [[Community_Auction#How_to_Drop_Off_Items|Dropping Off Items]] and [[Community_Auction#How_to_Get_Paid|Getting Paid]].\n\n===How to Drop Off Items===\nTo begin a Drop Off of your items, first you will need to contact one of the Auction Staff via [https://discord.uoforever.com/ UOF Discord]:<br \\>\nBo🍑#2219 <br \\>\nAuction Assistee#1725<br \\>\n\nWe will answer any questions you may have and offer to meet you at the [[Britain#Shops|West Britain Bank(WBB)]], where you will be able to trade with us. We ask that if you have any bagged items, to please make sure to open them, so we may take a screen shot of the transaction.\n<div class=\"left\">[[File:Community_Island_Submitting_Entries_Drop_Off.JPG|Frame|250px|Dropping Off Items]]</div>\n\n===How to Get Paid===\nOnce your items have sold, around 24 hours after the sale, the Auction Conductor will reach out to the [https://discord.uoforever.com/ UOF Discord] User to meet at the [[Britain#Shops|West Britain Bank(WBB)]] for payment which will be confirmed in the Discord chat:\n<div class=\"left\">[[File:Community_Island_Submitting_Entries_Getting_Paid.JPG|Frame|Upright|Getting Paid]]</div>\n\nThe reason for the 24 hold on payouts is due to the post-processing that goes on behind the scenes. Each event is recorded via [https://www.twitch.tv/ Twitch] and through journal logs captures which are thoroughly reviewed to ensure that the payouts are correct before reaching out to you with your earnings.\n\n===Auction Entries Rules===\nIn order to make the process of entering items into the Community Auction as easy as possible, please make sure you are aware of the following rules:\n# 10% of the selling price goes to the Auction House, which 9% is used to pay the Auction Staff and 1% goes to the Auction Hold which is used for [[Community_Auction#Special_Events|Special Events]].\n# Auction Entries will have No Reserves set( meaning no set minimum value). These do not do well and you should consider using a [[Player Vendor]], [https://discord.uoforever.com/ UOF Discord] #buying-selling channel, or [https://www.uoforum.com/ Forum Auctions] to get the price you are expecting.\n# We require a minimum relative value of items to be 50,000 gp or greater before bundling.\n# Up to 5 of your entries may appear in any given Community Auction. However, you are free to submit more than 5 entries at a time and any extras roll into upcoming Auctions.\n# An Entry can consist of multiple bagged items, or if you are not sure how to group them, you can leave them to our discretion. We may refuse items at this time if we feel the demand is not high enough, or there are too many duplicate entries at this time.\n# Unless specified, items will be designated/grouped/separated by the Auction Staff, in order to get the most value from your items.\n# Once an item has been released on a [[Community_Auction#Announcements|Community Auction Preview]] it can no longer be returned. However if you have other Entries that have not been advertised, you are welcome to contact us to return them!\n# If you do not claim your rejected items within 5 months you can no longer claim your items and they will be donated to the Auction Hold which is used for [[Community_Auction#Special_Events|Special Events]].\n# If you do not claim your Payout within 5 months you can no longer claim your checks and they will be donated to the Auction Hold which is used for [[Community_Auction#Special_Events|Special Events]].\n\n==Special Events==\nEvery Community Auction Event will have at least 1 Special Event towards the end of the Auction. This is our way of thanking you, the Players that keep this Auction running, with something extra at the end of the event. These Special Events are completely funded from donations, the 1% cut, and our own personal bank accounts. We truly appreciate the Community effort it takes to make this happen, and here are the some of the ways we do this; [[Community_Auction#Giveaways|Giveaways]] and [[Community_Auction#Mystery_Chests|Mystery Chests]].\n\n===Giveaways===\nNear the end of the event we will offer out 3 giveaways, which generally are 200,000 gp checks and 1000 [[Donation_Coin|Donation Coins]] however they may be items as well such as Gift Bags. Currently these are few games we may play to hand these out:\n# Trivia: We ask 3 questions and assign the winnings to the first person to correctly answer the question, spelling matters!!!\n# Dice Rolls: Everyone lines up in a single row and the Auctioneers will roll dice, walk the number of steps the dice add up to, and based on the size of the crowd will roll again or stop and award the giveaway.\n# Twitch Gift Bag: In the Auctioneer's Twitch channel you will be asked to type \"!ticket\" in the Twitch Chat, the winner is randomly chosen and awarded a Gift Bag of Donation Items from the Auction Hold.\n\n===Mystery Chests===\nMystery Chests have always been a crowd favorite. They work like any other Auction Item on the stage, however the only difference is that we only give a preview of some of the items within the chest, the rest of it is a mystery! These often go for multiple millions, and contain multiple millions in items. The Mystery Chests also have themes and come artistically hand decorated. They are usually very heavy or have many items, so trading may have to happen after the event, we will hold on to your payment and offer to transfer this to your home if you cannot carry the item. We will not disclose the items that have been sold, however we encourage, as the crowd will as well, to show the items, even though you are never required to!\n<div class=\"center\">[[File:Community_Auction_Mystery_Chest_Preview.png|250px|Community Auction Preview]][[File:Community_Auction_Mystery_Chest_Player_Shared_Image.png|500px|Winning Bidder Image]]</div>\n\n==Rules and Disclaimers==\nThe Community Auction has been running for a very long time, and as such, there have been many situations that may or may not apply to your particular experience at the Event. We have compiled this complete list of rules so that you may be informed of the expectations we would like your experience to be!\n\n# For any questions about the Bidding process please see the section [[Community_Auction#Auction_Bidding_Rules|Auction Bidding Rules]].\n# For any questions about the Entry process please see the section [[Community_Auction#Auction_Entries_Rules|Auction Entries Rules]].\n# All transactions are kept between you and the Auction Staff when dropping off and receiving payouts.\n# At no point will the information provided from you, in confidentiality to an Auction Representative, be used outside of the Auction for any reason.\n# All donations, tips, giveaway winnings are subject to announcement, we hold the utmost respect for the Community and they should for you too!\n# Item entry will go by \"first come, first serve\" with priority on Uniqueness - duplicates will be moved to future Auctions. We reserve the right to put in duplicates anyways! (this would be acceptable for items that generally have set values like power-scrolls, frags, taming skill scrolls.. etc).\n# If you do not agree with prices that the current item(s) are reaching, or not reaching, please do not vocalize this in the crowd. Furthermore, any numbers resulting from these statements will be assumed to be bids, and payment will be expected if the bid wins the item.\n# During the auction is not the time to try and sell your personal items. Please refrain from posting sales promotions during the Community Auction Event time, feel free however to use the [[Party|Party System]] to silently discuss personal items between consenting attendees at the Community Auction.\n# You are forbidden from bidding on your own items, all items are tracked by Auction Staff and transactions can be traced in game as well, please do not attempt to bid on items that you have put in.\n# Any actions taken by staff, meaning Removals/Jails/Bans must be discussed with the UOForever Staff, not Auction Staff or in public channels of the [https://discord.uoforever.com/ UOF Discord].\n# If you choose to get banned from Discord, you immediately forfeit your currently submitted items and any pending payouts, which the proceeds will go directly to the Auction Hold used for [[Community_Auction#Special_Events|Special Events]]."
          }
        ]
      }
    }
  }
}