{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "207": {
        "pageid": 207,
        "ns": 0,
        "title": "Commonly Stocked PvP Supplies",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "__TOC__\n\n\n== Introduction ==\n\nPlayer-versus-Player (PvP) preparation can be fairly overwhelming when first starting out. Below are a list of Items and their descriptions that are commonly carried by experienced PvPers. Items of this sort are typically referred to as \"stock\" -- as in when a player needs to go home to \"restock\". They are organized by type for easy reference.\n\nMany PvPers feel it is important to organize their stock in a fashion that is logical for them, but the main goal of organizing your stock is to arrange it in a manner that you can easily decipher what needs to be restocked. Some players even go as far as to make pre-stocked bags that they can grab to restock, which contain all of the supplies they need.\n\n\n== What to Stock ==\n\n<small>'''''Note: Not all Items listed below may be needed for all character Templates.'''''</small>\n\n====Magery====\n{| class=\"wikitable\"\n! style=\"font-weight: bold;\" | Item\n! style=\"font-weight: bold;\" | Description\n|-\n| style=\"font-weight: bold;\" | Reagents\n| Whether you are a full blown mage or a melee character with magery, reagents are required. How many is up to you\n|}\n\n\n====Melee====\n{| class=\"wikitable\"\n! style=\"font-weight: bold;\" | Item\n! style=\"font-weight: bold;\" | Description\n|-\n| style=\"font-weight: bold;\" | Weapon(s)\n| You cannot fight someone without a weapon! GM made weapons work fine, but force or higher magical weapons will give you that extra edge. For character Templates that mostly use two handed weapons, it is common to carry a one handed weapon also as a backup.\n|-\n| style=\"font-weight: bold;\" | Shield(s)\n| If your character template is made to focus on other melee characters, you may have parry as a skill. A shield is necessary to take advantage of parry. If you are Chaos or Order, you can get free shields from the Order/Chaos guards by saying \"Order Shield\" or \"Chaos Shield\" respectively.\n|-\n| style=\"font-weight: bold;\" | Arrows/Bolts\n| For any archers, you must have the correct ammunition for your bow or cross bow. Make sure to carry enough for your fights.\n|}\n\n\n====Potions====\n{| class=\"wikitable\"\n! style=\"font-weight: bold;\" | Potion Name\n! style=\"font-weight: bold;\" | Description\n|-\n| style=\"font-weight: bold;\" | Greater Heal\n| The Yellow Pot. This provides you with a instant boost of health upon drinking. There is a cool down period on this potion to prevent instant full re-heals.\n|-\n| style=\"font-weight: bold;\" | Greater Cure\n| The Orange Pot. This will cure lesser, regular, and greater poison instantly, 80% chance to cure deadly poison, and a chance to cure lethal poison. No cool down period.\n|-\n| style=\"font-weight: bold;\" | Total Refreshment\n| The Red Pot. This will instantly refresh stamina upon drinking. No cool down period.\n|-\n| style=\"font-weight: bold;\" | Greater Explosion\n| The ominous Purple Pot. This potion upon using, will bring up a target cursor to target an enemy along with an overhead timer. Once targeted, the potion will be thrown at the enemy and if the timer has not counted down completely before it gets to the enemy, it will explode when it hits zero. The idea is to time the throw so that the timer hits zero when it gets to the intended target.\n|-\n| style=\"font-weight: bold;\" | Greater Strength\n| The White Pot. This potion is commonly overlooked and not carried by most players. It SHOULD be carried by all PvPers. The advantage comes in that if used prior to a fight, you will effectively have 20 more hit points. It increases STR/HP by 20.\n|-\n| style=\"font-weight: bold;\" | Greater Dexterity\n| The Blue Pot. Arguably only useful for melee PvPers as it increases DEX/Stamina by 20. Should also be used before a fight. Stun mages also utilize these to increase their available stamina pool for their stun special moves.\n|}\n\n\n====Miscellaneous====\n{| class=\"wikitable\"\n! style=\"font-weight: bold;\" | Item\n! style=\"font-weight: bold;\" | Description\n|-\n| style=\"font-weight: bold;\" | [[Orange Petals]]\n| These are very uncommonly used. When used, an orange petal will provide five minutes of poison protection. Upon the first poison tick, the orange petal will cure a player of the poison they are afflicted with. Lethal poison is not cured by this.\n|-\n| style=\"font-weight: bold;\" | Pop Pouches\n| A normal pouch -- magically trapped. These (pre-trapped) can be purchased at a provisioner. When a pouch is trapped, they are red in color as opposed to the normal brown of un-trapped pouches. These provide 1 hp of damage to the player when popped. This effectively breaks any paralysis caused by the paralyze spell or paralyze field spell. One can create a Razor or UOSteam macro to pop these pouches by recording your character saying [pouch, this will allow a player to pop the pouch with a keybind instead of having to double-click each pouch individually. It is not uncommon to carry many of these.\n|-\n| style=\"font-weight: bold;\" | Bandages\n| Cloth cut up into clean bandages. These are the only way to use the Healing skill. If you have the Healing skill, make sure to carry enough of these to keep yourself healed.\n|}\n\n[[Category:Items]]"
          }
        ]
      }
    }
  }
}