{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "127": {
        "pageid": 127,
        "ns": 0,
        "title": "Conquest System",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Guides]][[Category:Inactive]]\n\n__TOC__\n\n'''Note:''' In the [https://uoforum.com/threads/may-2017-patch-notes.95188/ May 2017] updates, Conquests were disabled and replaced with the [[Achievements_System|Achievements System]]. Conquests will remain disabled until the system can be reworked to be less resource intensive. This work will also allow the system to be expanded more easily to add more Conquests.\n\n==How to Access==\nTo access the Conquests Menu, simply click to yourself or another player to bring up the [[Context_Menu]] and select \"Look At\":\n<gallery mode=\"nolines\">\nFile:AchievementsContextMenuSelf.PNG|Context Menu used on your own character. This can be done by single clicking yourself, unless you have changed this operation in the Options Menu.\nFile:AchievementsContextMenuOther.PNG|Context Menu used on someone else's character. This can be done by single clicking the character, unless you have changed this operation in the Options Menu.\n</gallery>\n\n==Description==\nMany new conquests will be added over time. This is also referred to as [[Achievements_System|Achievements]].\n\nThe Conquest System is a system based off of unlocking achievements in game. Be careful it becomes addicting. In order to figure out what the conquests are you must access the Conquests menu. Type [Conquests in game. That will open a menu.\n\n[[file:ConquestSystem1.png]]\n\nThis conquest menu is extremely easy to navigate and quick to understand. All you have to do is click through. All conquests are described and some are harder than others. Here is an example of an achievement yet to be completed.\n\n[[file:ConquestSystem2.png]]\n\nAll incomplete conquests appear white where the number is and also will have an empty bar next to it. The number yields conquest points. To complete a conquest for example \"Discover Yew Brigand Camp\" you must go to the Yew Brigand Camp. This is something you must find in game or ask another player to help you find. This will pop up when you completed a conquest.\n\n[[file:ConquestSystem3.png]]\n\nThis will appear on your screen when you accomplish an achievement. Then when you check your [Conquests menu you will see that the number went from white to red and the bar next to the achievement is full which indicates that the conquest is complete.\n\n[[file:ConquestSystem4.png]]\n\nThere are many achievements some that yield physical Items like a statue and others that yield [[Titles_and_Hues_Guide#Custom_Titles|Title and Hues Scrolls]]. Please be aware that ALL Titles and Hues achieved through the conquest system go directly into the character who unlocks the achievement and not in scroll form as some Title's and hue's come. An example of this is the [[Titles_and_Hues_Guide#Custom_Titles|Veteran Title Scroll]].\n\n[[file:ConquestSystem5.png]]\n\nExample: Unlocking The Veteran title will not yield a [[Titles_and_Hues_Guide#Known_Titles_and_Title_Hues|Title Scroll]] but will yield a Title on my Titles list.\n\n==See Also==\n* [[Achievements_System|Achievements]]\n* [[Titles_and_Hues_Guide#Custom_Titles|Custom Titles and Hues]]"
          }
        ]
      }
    }
  }
}