{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "3485": {
        "pageid": 3485,
        "ns": 0,
        "title": "Container Engraving Tool",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Items]][[Category:Tools]]\n[[File:Container_Engraving_Tool_Preview.PNG|thumb|The Container Engraving Tool with 5 charges. This device is used to engrave containers with a special note that will appear on the Tool Tips.]]\n__TOC__\n=Description=\nThe Container Engraving Tool is designed to be used with Gold Wax which allows someone to add label a [[Container|container]] lockdown in their home. Each Container Engraving Tool comes preloaded with 5 charges of Gold Wax and each Gold Wax charge will engrave one locked down [[Container|container]] once. This engraving can be seen in the Tool Tips in gold writing stating with an \"Engraved:\" message.  Gold Wax can be used to add charges to a Container Engraving Tool, and is available on both the Gold Sink and Donation Vendors.\n\n==Notes==\n* The [[Container|container]] attempting to be engraved must be locked down and these engravings will continue to stay on the [[Container|container]] so long as the item remains locked down.\n* Unlocking the [[Container|container]] will remove the engraving, but you can freely move the locked down [[Container|container]] with the any of the [[Decorator_Tools|Decorator Tools]] and the engraving will stay!\n* Using the Container Engraving tool on a locked down [[Container|container]] that already has an engraving will replace the current engraving with the requested one.\n\n==Patch Notes==\n* [https://www.uoforum.com/threads/new-quality-of-life-items.110193/ new-quality-of-life-items.110193]\n\n==Where to Purchasing the Container Engraving Tool==\nContainer Engraving Tools can only be purchased from the Donation Vendors for 2000 [[Donation_Coin|Donation Coins]] and comes pre-loaded with 5 charges of Gold Wax.\n\n[[File:Container_Engraving_Tool_Dono_Sink_Preview.PNG|The Container Engraving Tool preview on the Donation Coin Vendor.]]\n\n==Where to Purchasing Gold Wax==\n[[File:Container_Engraving_Tool_Wax_Preview.PNG|thumb|10 Gold Wax which is used to recharge a Container Engraving Tool]]\n10 Gold Wax can be purchased from the Gold Sink Vendor for 10,000 gp or the Donation Vendor for 100 [[Donation_Coin|Donation Coins]].\n\n<gallery mode=\"nolines\" widths=300px heights=300px>\nFile:Container_Engraving_Tool_Gold_Wax_Gold_Sink_Preview.PNG|10 Gold Wax that can be purchased from the Gold Sink Vendor for 10,000 gp.\nFile:Container_Engraving_Tool_Gold_Wax_Dono_Sink_Preview.PNG|10 Gold Wax that can be purchased from the Donation Coin Vendor for 100 [[Donation_Coin|Donation Coins]].\n</gallery>\n\n=How to Engrave=\nIn order to engrave a locked down [[Container|container]] you will need to make sure you have Gold Wax Charges in your Container Engraving Tool and the [[Container|container]] you are selecting is lockdown in a home you have access to.Pretty much any [[Container|container]] that can be locked down can be engraved! This includes items from the [[Container|Container Category]], Mailboxes, [[Paragons#Chests|Paragon Chests]], even strange and unique containers! Here is a sample of many different containers that was successfully able to be engraved:\n\n<gallery mode=\"nolines\" widths=300px heights=300px>\nFile:Container_Engraving_Tool_Engraved_Deed_Storage_Shelf_Chest.PNG|An engraved Deed Storage Shelf with Container Engraving Tools and gold wax.\nFile:Container_Engraving_Tool_Engraved_Chest_Preview.PNG|An Example of many exotic containers that have been engraved with the Container Engraving Tool.\n</gallery>\n\n==Using the Container Engraving Tool==\nTo use the Container Engraving Tool, simply double-click the tool to get a target icon:\n\n[[File:Container_Engraving_Tool_Select_Container_Message.PNG|The message from double clicking a Container Engraving Tool that has at least 1 Gold Wax charge.]]\n\nNow select a locked down [[Container|container]] to get the popup box to enter in a short message:\n\n[[File:Container_Engraving_Tool_Text_Menu.PNG|The Popup message after a container has been selected with a Container Engraving Tool with at least 1 Gold Wax Charge. This allows you to type in the message for the engraving.]]\n\nAfter you have hit the Continue Button you will receive the message of a successful engraving:\n\n[[File:Container_Engraving_Tool_Successful_Engraving_Message.PNG|The message that indicates a successful engraving of a container from a Container Engraving Tool.]]\n\nThis [[Container|container]] should now display the Engraved message in the Tool Tips:\n\n[[File:Container_Engraving_Tool_Engraved_Paragon_Chest.PNG|A successfully engraved Paragon Chest from a Container Engraving Tool. You can see the message \"Engraved: Sw33t Lewtz\" in gold in the Tool Tips.]]\n\nIf this was the last charge of Gold Wax in the Container Engraving Tool you will receive this message:\n\n[[File:Container_Engraving_Tool_Out_of_Wax_Message.PNG|The Out of Wax Message from using the last Gold Wax charge in a Container Engraving Tool.]]\n\nPlease be aware that unlocking the container will remove the engraving, but you can freely move the locked down [[Container|container]] with the any of the [[Decorator_Tools|Decorator Tools]] and the engraving will stay!\n\n[[File:Container_Engraving_Tool_Released_Container.PNG|A paragon chest that has been released from the homes lock down status.]]\n\n==Loading the Container Engraving Tool with Wax==\nIf you attempt to use a Container Engraving Tool without any Gold Wax charges, you will receive this message:\n\n[[File:Container_Engraving_Tool_Out_of_Wax_Message.PNG|The Out of Wax Message from using the last Gold Wax charge in a Container Engraving Tool.]]\n\nIn order to refill the Container Engraving Tool, you will need to double click the Gold Wax to get a target:\n\n[[File:Container_Engraving_Tool_Wax_Select_Container_Engraving_Tool_Message.PNG|The message after double clicking a Gold Wax to provide more Gold Wax charges for a Container Engraving Tool.]]\n\nThen you can select the Container Engraving Tool to add Gold Wax charges, and you will receive this notification:\n\n[[File:Container_Engraving_Tool_Wax_Added_Wax_Message.PNG|The message indicating that 1 Gold Wax charge has been added to a Container Engraving Tool.]]"
          }
        ]
      }
    }
  }
}