{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "133": {
        "pageid": 133,
        "ns": 0,
        "title": "Custom Housing",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Guides]][[Category:Housing]]\n[[file:534px-Large_house_with_patio.jpg|thumb]]\n__TOC__\n=Description=\nOne of the most unique and exciting parts of Ultima Online and it's sandbox environment is it's custom housing features. Houses can be placed in valid locations or purchased from other players with the transferring trade window where blessed bank checks can be securely traded. Everything inside of the homes are safe from other players through the use of the permissions system that can be set on almost every item or container of items within the housing plot. Custom houses can be designed by yourself or prebuilt houses can be placed with prebuilt designs, these are known as \"classic houses\". Houses cost gold coins and you must have at least 1200 combined skill points gained over multiple characters on the same account, as well as, have a minimum of 24 hours game time in order to place a house. These requirements are in place in order to prevent alternate accounts from hoarding house plots as you may only have one home per account.\n\n==Patch Notes==\n* [https://www.uoforum.com/threads/8-7-5-0-qol-updates-new-private-housing-access-and-more.110180/ 8-7-5-0-qol-updates-new-private-housing-access-and-more.110180]\n* [https://www.uoforum.com/threads/8-7-2-0-classic-housing-upgrade-talisman-dye-and-crafting-achievement-fixes-more.110168/ 8-7-2-0-classic-housing-upgrade-talisman-dye-and-crafting-achievement-fixes-more.110168]\n* [https://www.uoforum.com/threads/8-7-1-0-various-bug-fixes-and-performance-improvements.110165/ 8-7-1-0-various-bug-fixes-and-performance-improvements.110165]\n* [https://www.uoforum.com/threads/8-7-0-0-major-patch-crafter-talisman-relic-update-housing-biowners-and-more.110164/ 8-7-0-0-major-patch-crafter-talisman-relic-update-housing-biowners-and-more.110164]\n* [https://www.uoforum.com/threads/patch-notes-8-6-5-0.110154/ patch-notes-8-6-5-0.110154]\n* [https://www.uoforum.com/threads/patch-notes-8-1-1-0.109929/ patch-notes-8-1-1-0.109929]\n* [https://www.uoforum.com/threads/scheduled-patch-notes-8-0-1-1-minor-bug-fixes.109833/ scheduled-patch-notes-8-0-1-1-minor-bug-fixes.109833]\n* [https://www.uoforum.com/threads/patch-notes-8-0-1-0.109794/ patch-notes-8-0-1-0.109794]\n* [https://www.uoforum.com/threads/patch-notes-8-0-0-0-8-0-0-22-major-update.109754/ patch-notes-8-0-0-0-8-0-0-22-major-update.109754]\n* [https://www.uoforum.com/threads/patch-notes-7-0-8-6-quick-fixes.109615/ patch-notes-7-0-8-6-quick-fixes.109615]\n* [https://www.uoforum.com/threads/patch-notes-7-0-8-5-quick-fixes.109601/ patch-notes-7-0-8-5-quick-fixes.109601]\n* [https://www.uoforum.com/threads/patch-notes-7-0-8-1.109374/ patch-notes-7-0-8-1.109374]\n* [https://www.uoforum.com/threads/patch-notes-7-0-7-6-various-fixes-from-06-09-2020-06-15-2020.109091/ patch-notes-7-0-7-6-various-fixes-from-06-09-2020-06-15-2020.109091]\n* [https://www.uoforum.com/threads/patch-notes-7-0-7-5-housing-update.109077/ patch-notes-7-0-7-5-housing-update.109077]\n\n=Getting a House=\nThere are few ways to get yourself a house in the lands of Sosaria:\n* You can place and customize your own if you can find an open legal area to place a home.\n* You can purchase an already placed home from a from another player.\n* You can purchase a home directly from the [https://www.uoforever.com/store_more.php Ultima Online Forever Shop]. There are sometimes sales such as seen here: [https://www.uoforum.com/threads/island-cave-and-upgrade-sale.110242/ island-cave-and-upgrade-sale.110242] or in game raffles that accept donation coins of gold coins for chances to win special homes.\n\n==Building a Home==\nTo build a house, you must first purchase a House Placement Tool from an NPC Architect (Usually located around Carpenters). They cost under 1000 gold. Some characters choose to always carry one since they are [[Blessed]], in case a good spot turns up on their adventures. [[file:House_placement_tool_menu.jpg|thumb]]\n\n'''Note:''' The NPC Architect sells classic house deeds as well as the house placement tool. These deeds are not blessed, so look out for opportunist thieves in the area! Classic houses can also be placed with the house placement tool but they cost more.  If you do choose to place a classic house with the housing placement tool and then decide to demolish the house, you will get back a deed, rather than the cost of the placement. In contrast, with a custom house, you will get back the cost of the plot.\n\nOnce you've got enough gold in your bank, you need to find a location to place a home. Finding a spot can be difficult because of the heavy population on the server but houses do decay over time when players go inactive. Search for your spot!\n\nWhen you are at your spot, select the house size/style and target the ground where the steps would go. Either the house will appear or it will tell you something is blocking. New housing requires no blocking objects under or within 1 tile of the foundation. The house must also be 5 tiles away from any other player house from front and behind.\n\nIf you see the house appear, simply click the confirmation button and congratulations! If not, keep trying. Placing houses can be tricky!\n\n==Buying a Home==\nSome players choose to sell their old homes and buy new ones. Some players find houses just to resell them to other players. Whatever the case, you can purchase houses from other players. One of the main advantages of buying a house from another player is that you don't have to go through the tedious process of placing one yourself. For buying large plots such as 18x18's, you'll almost always likely buy one from another player unless you witness one \"fall\". [[file:Housesign_6.jpg|thumb]]\n\nFinding a house to purchase can often be done from the forums in the buying/selling section. These threads will often include the location, a description, the size and images. Once you've settled on a price with the seller, you must both travel to the location of the house and stand under the sign of the house. The seller must open the house sign and begin the transaction. A Neon glacial blue deed will appear in the trade window with the house information. Simply place your check in the trade and click the check. Congratulations! The house now belongs to you.\n\n=Home Security=\n==Player Security Levels==\nIn the security menu of the house sign, you can give other players certain privileges in your house. There's four levels of assignable security:\n* '''Owners''' - This is set to all characters of your Home Owner account\n* '''Bi-Owners''' - Default is 5 Bi-owners, but can be increased with to 30 with the use of Bi-Owner increase deeds(not yet in game!)\n* '''Co-owners''' - This can be increased by 15 with a house co-owner increase dead available on the Donation Coins Vendor\n* '''Friends''' - This can be increased by 25 with a house friend increase deed available on the Donation Coins Vendor\n* '''Designer''' - This will allow you to assign someone for 7 days to be able to design your house. After 7 days the role will automatically be removed. The owner can also remove this role at any time. Designers can remove addons much like owners. Do not use this role for anyone you don't trust.\n\n'''Friends can do the following:'''\n* Ban other players, lift a ban\n* Access secure containers, doors and teleporters with the access level set to 'friends' or 'anyone'\n\n'''Co-owners can do the following:'''\n* Inherit Permissions from Friends\n* Lock down items, and release items locked down by themselves\n* Release locked-down items or secure containers, even those placed by other players\n* Access secure containers, doors and teleporters with the access level set to 'co-owners', 'friends' or 'anyone'\n* Place house add-ons\n* Rename the house\n\n'''Owners can do the following:'''\n* Inherit Permissions from Co-Owners\n* Make other players a co-owner of the house, or remove them from the co-owners list\n* Place secure containers\n* Set the security level on doors and teleporters\n* Access secure containers, doors and teleporters with the access level set to 'owner', 'co-owners', 'friends' or 'anyone'\n* Remove house add-ons\n* Place barkeeps and write out vendor contracts\n* Trade the house to another player\n* Demolish the house\n* Change the house foundation style, hanger and sign\n* Customize the house (if the house is of the customizable type)\n* Change the house to Public or Private\n* Secure containers\n\n'''Bi-Owners can do the following:'''\n* Inherit Permissions from Owners except Transferring homes, Demolishing Homes, or adding more Bi-Owners.\n\n==Item Security Levels==\nAny item can be locked down in a home, however you can give special Item Security Levels to an item as well! Using the [[Custom_Housing#House_Commands|House Command \"I wish to secure this\"]] you can restrict an item to only be used by a certain level of access. These items count against the \"Used by Secure Containers\" count from the House menu, so choose wisely which items you wish to secure!\n\nOnce an item is locked down or secured in your house, it becomes securely locked in that location. Locked down items cannot be moved by anyone and do not decay. This lets you decorate your house with the peace of mind that ruffians or petty chair thieves will not be able to wreck or steal your furniture, and that your decorations won't simply vanish after being left unattended.\n\nYou can use either [[Custom_Housing#House Commands|House Commands]] or [[Decorator_Tools|Decorator Tools]] to lock down or secure an item.\n\nHere are some other common items that are useful to use the the [[Custom_Housing#Secure_Access_Levels|Secure Access Levels]] over the regular locked down level:\n* Doors and Teleporters - Doors and Teleporters will not open/activate unless the security level is met restricting access to the property or within other individual parts of the home.\n* Containers - Secured containers differ from those that are locked down in that you can easily remove items from them without having to \"release\" them first. Secure containers provide secure storage without locking down the objects that stored within them.\n* Mailboxes - Mailboxes are one way containers that allow only the assigned person to open them, but allows anyone that meets the security requirement to drag and drop items onto the mailbox to insert items without allowing them to retrieve them.\n* [[Treasure_Map#Gear|Treasure Mapping Gear]] - These are generally containers that you will want specific characters or guild members to have access to add and remove [[Treasure_Map|Treasure Maps]] for quick hunts.\n* [[Butler|Butlers]] - These are special NPCs that allow players to [[Butler#Restocking_Butlers|restock from an inventory the Butler has]] and to [[Butler#Withdrawing_Selections|withdraw the items]] by a [[Butler#Profiles|saved profile]]. Setting the [[Custom_Housing#Secure_Access_Levels|Secure Access Levels]] can be very important unless you want to make them publicly available for anyone to use out of the goodness of your heart!\n\nSome items are designed to not respect Item Security Levels, these items are generally considered no harmful to be allowed to be used by anyone:\n* [[Runebook]] - This is a book that contains [[Rune|Marked Runes]] with the [[Mark|Mark spell]] that allows people to use the [[Recall|Recall spell]] to travel to the marked location. You cannot remove runes from a locked down [[Runebook]].\n* [[Dye_Tub|Dye Tubs and Dyes]] - These are designed for people to change the colors of the tub to dye clothing and other items, since you can always change them back to any of the color available from the dye it is considered no harmful. You cannot change Black Dye Tubs with dyes. The only issue may be that when a dye tub is purchased it may be in the natural Hue 0 color and cannot be reset to this if it has ever been changed. You should keep \"fresh tubs\" in secure containers and already dyed tubs outside of containers.\n\n===Secure Access Levels===\n[[File:Custom_Housing_Secure_Access_Levels.png|right|thumb|The Secure Access Menu that allows you to set an items access level(including containers, doors, and teleporters) to one of 8 types of access.]]\n\nThere are 8 types of access levels you can give an item:\n* Owner Only - This allows only the Owner of the Home, and any other character on that Home Owners account to access the item.\n* Bi-Owners - This allows Owners and Bi-Owners of the Home to access the item.\n* Private - This allows only a specific player selected to access the item, as well as Owners and Bi-Owners.\n* Co-Owners - This allows anyone from the Co-Owners list, Bi-Owners list, or Owner to access the item.\n* Friends - This allows anyone from the Friends list, Co-Owners list, Bi-Owners list, or Owner to access the item.\n* Guild Members - This allows anyone from the same Guild as the Owner of the Home to have access to the item as well as anyone on the Friends list, Co-Owners list, Bi-Owners list, or Owner to access the item.\n* Guild Members & Alliance - This allows anyone from the same Guild or Alliance as the Owner of the Home to have access to the item as well as anyone on the Friends list, Co-Owners list, Bi-Owners list, or Owner to access the item.\n* Anyone - This allows anyone to access the item, this could allow anyone to open a door, or use a teleporter, or take from a container. This level is useful for mailboxes which are one-way containers.\n\n==Home Access Status==\nHomes Access Statuses are by default set to Private, however you can make a home Public or even a Guild House. This security is related to who is allowed to be within your home and who is considered to be trespassing! Homes still respect the [[Custom_Housing#Item_Security_Levels|Item Security Levels]] for items within the home.\n\nThere are three Home Access Levels:\n* Private - These homes are the default and anyone within them are considered trespassing and will appear as [[Flagging#Grey|grey status]] anyone with access to the home already. Anyone attempting to walk into a [[Gate_Travel|Gate]] that would go into a private home will end up placed outside of the home instead.\n* Public - These homes are designed for anyone to walk in them, and are required to place [[Player_Vendors|Player Vendors]]. In order to set a home from Private to Public all doors and teleporters must be set to allow anyone to use them.\n* Guildhouse - These homes are designed to allow guild members and alliance members to enter the home. This also allows them to enter a [[Gate_Travel|Gate]] that would go into the home and remain where the [[Gate_Travel|Gate]] is created.\n\n=House Commands=\n{| cellpadding=\"5\" cellspacing=\"0\" border=\"1\" width=\"100%\"\n! style=\"background-color:#000; color:#FFFFFF;\" | Command\n! style=\"background-color:#000; color:#FFFFFF;\" | Description\n|- align=\"center\"\n|I Ban Thee\n|Friends, co-owners and owners of a house can issue this command. It will bring up a targeting cursor to ban and eject someone. Friends and owners cannot be banned.\n|- align=\"center\"\n|Remove Thyself\n|Friends, co-owners and owners of a house can issue this command. It will bring up a targeting cursor to eject someone. Friends and owners cannot be ejected.\n|- align=\"center\"\n|I Wish To Lock This Down\n|Locks an item down in your house. Only the owner and co-owners can issue this command.\n|- align=\"center\"\n|I Wish To Release This\n|Removes lockdown and secure status on an item. Only the owner and co-owners can issue this command. \n|- align=\"center\"\n|I Wish To Secure This\n|Locks down a container in your house and makes it secure. Only the owner and co-owners can issue this command.\n|- align=\"center\"\n|I Wish To Place A Trash Barrel\n|Will place a trash barrel inside a house, at the position where you are standing. Only the owner or co-owner\n|}\n\n=House Types=\n==Classic==\n\n'''Note:''' Classic houses have slightly different placing rules than custom houses. You will not always be able to replace a Tower with a 16x14 for example. Take care if you want to try and swap them!\n\n{| cellpadding=\"5\" cellspacing=\"0\" border=\"1\" style=\"background-color:#FFF;\" width=\"60%\" \n! style=\"background-color:#000; color:#FFFFFF;\" width=\"50%\" | Name\n! style=\"background-color:#000; color:#FFFFFF;\" | Image\n! style=\"background-color:#000; color:#FFFFFF;\" | Size\n! style=\"background-color:#000; color:#FFFFFF;\" | Storage\n! style=\"background-color:#000; color:#FFFFFF;\" | Lockdowns\n! style=\"background-color:#000; color:#FFFFFF;\" | Cost\n\n|- style=\"vertical-align: top; text-align:center;\"\n| '''Small Stone and Plaster House''' <br/> <br/> Also available as Wood, Brick, Field Stone, Stone and Plaster, Wood and Plaster, & Thatched-Roof Cottage\n| [[File:Stone_and_plaster_house.jpg|100px|center]]\n| 7x7\n| 489\n| 244\n| 63800 Deed<br/>64505 Tool\n\n|- style=\"vertical-align: top; text-align:center;\"\n| '''Small Stone Workshop'''\n| [[File:Small_stone_workshop.jpg|100px|center]]\n| 7x7\n| 489\n| 244\n| 80,600 Deed<br/>123,000 Tool\n\n|- style=\"vertical-align: top; text-align:center;\"\n| '''Small Marble Workshop'''\n| [[File:Small_marble_workshop.jpg|100px|center]]\n| 7x7\n| 489\n| 244\n| 83,000 Deed<br/>123,000 Tool\n\n|- style=\"vertical-align: top; text-align:center;\"\n| '''Small Stone Tower'''\n| [[File:Small_stone_tower.jpg|100px|center]]\n| 8x7\n| 667\n| 333\n| 100,500 Deed<br/>171,500 Tool\n\n|- style=\"vertical-align: top; text-align:center;\"\n| '''Two Story Villa'''\n| [[File:Two-story_villa.jpg|100px|center]]\n| 11x11\n| 1265\n| 632\n| 156500 Deed<br/>266,500 Tool\n\n|- style=\"vertical-align: top; text-align:center;\"\n| '''Sandstone House with Patio'''\n| [[File:Sandstone_house_with_patio.jpg|100px|center]]\n| 12x8\n| 1265\n| 632\n| 90,900 Deed<br/>189,900 Tool\n\n|- style=\"vertical-align: top; text-align:center;\"\n| '''Two Story Log Cabin'''\n| [[File:Two-story_log_cabin.jpg|100px|center]]\n| 8x13\n| 1265\n| 632\n| 119800 Deed<br/>198,800 Tool\n\n|- style=\"vertical-align: top; text-align:center;\"\n| '''Brick House'''\n| [[File:Brick_house.jpg|100px|center]]\n| 14x14\n| 1576\n| 788\n| 164500 Deed<br/>294,500 Tool\n\n|- style=\"vertical-align: top; text-align:center;\"\n| '''Two-Story Wood and Plaster'''\n| [[File:Two-story_stone_and_plaster_house.jpg|100px|center]]\n| 14x14\n| 1576\n| 788\n| 192400 Deed<br/>392,500 Tool\n\n|- style=\"vertical-align: top; text-align:center;\"\n| '''Large House with Patio'''\n| [[File:534px-Large_house_with_patio.jpg|100px|center]]\n| 15x14\n| 1576\n| 788\n| 172800 Deed<br/>249,250 Tool\n\n|- style=\"vertical-align: top; text-align:center;\"\n| '''Marble House with Patio'''\n| [[File:Marble_house_with_patio.jpg|100px|center]]\n| 14x13\n| 1576\n| 788\n| 164500 Deed<br/>392,000 Tool\n\n|- style=\"vertical-align: top; text-align:center;\"\n| '''Tower''' <br/> <br/> Has the same storage as a large custom house.\n| [[File:Tower.jpg|100px|center]]\n| 16x14\n| 2437\n| 1218\n| 612200 Deed<br/>873,200 Tool\n\n|- style=\"vertical-align: top; text-align:center;\"\n| '''Small Stone Keep'''\n| [[File:Small_stone_keep.jpg|100px|center]]\n| 24x24\n| 3019\n| 1509\n| ? Deed<br/>1,325,200 Tool\n\n|- style=\"vertical-align: top; text-align:center;\"\n| '''Castle'''\n| [[File:Castle.jpg|100px|center]]\n| 31x31\n| 4688\n| 2344\n| ? Deed<br/>2,122,800 Tool\n\n|}\n\n==Custom==\nThe following screenshots are taken from the House Placement tool:\n===Two Story===\n<gallery class=\"inline\" widths=\"100px\" heights=\"100px\" mode=\"slideshow\" showthumbnails>\nFile:twostory1.png|Two Story 1\nFile:twostory2.png|Two Story 2\nFile:twostory3.png|Two Story 3\nFile:twostory4.png|Two Story 4\n</gallery>\n\n===Three Story===\n<gallery class=\"inline\" widths=\"100px\" heights=\"100px\" mode=\"slideshow\" showthumbnails>\nFile:threestory1.png|Three Story 1\nFile:threestory2.png|Three Story 2\nFile:threestory3.png|Three Story 3\nFile:threestory4.png|Three Story 4\nFile:Threestory5.png|Three Story 5\n</gallery>\n\n===Max Storage===\nPlots that have 2,437 storage and 1,218 lockdowns are commonly referred to as \"max storage\" plots, despite the fact that small keeps, castles and 30x30 plots have more storage! As a quick reference, if you add the length and width and it totals 30 or more, then the property is a \"max storage\" plot. For example, a 15x15 would be 15+15 as length+width which is exactly 30 and therefore has the \"max storage\" amount of 2,437 storage.\n\n===30x30===\n30x30 plots are a custom added feature on Ultima Online Forever. Aside from the [http://www.uoforum.com/faq/what-are-donation-tiers-and-how-do-they-work.54/ donation tier] cave and island houses, these are the largest houses a player can obtain. While they have a footprint 1 tile smaller than castles, there are sometimes obstructing items within castle courtyards that could block the placement of a 30x30. It is best to talk to an experienced house placer or GameMaster before attempting a 30x30 placement.\n\nBeing such large properties, they also offer fantastic opportunities for interesting designs. If you tour the lands, you will find several beautifully designed 30x30 plots, many of which were created by the talented Lady Faytality\n\n<gallery mode=\"packed\" class=\"right\">\nFile:30x30-1.png|Oriental Delight\nFile:30x30-2.jpg|Summer Villa\nFile:30x30-3.png|Formidable Fort\nFile:30x30-4.jpg|Pirate Town\n</gallery>\n\n=FAQ=\n==Why can I not place a house?==\nTo place a house you must have a minimum of 1200 skill points Show Real on your account. That means you must have at least 1200 skill points across your entire account show real which requires you to have at least 2 chars on your account. You also must have a minimum of 24 hours IN GAME. We do not make exceptions to this rule all players must meet this requirement.\n\nEnsure also that you are trying to place on valid terrain and that you have enough gold available in your bank if you are using the house placement tool. You can check this by viewing the \"Bank Balance\" entry when you use the house placement tool. If you used \"deposit\" to store all your gold, the house placement tool will not be able access the gold. Create a check first, store it in your bank and then re-open the house placement tool.\n\n==I've met the requirements but still can't place!==\n\nPlacing houses can be tricky at times. Due to the default client frame positioning, placing houses can be tricky as the outline of the home can be a tile or two out of where you actually intend to place it.\n\nI'll use this picture to illustrate:\n\n[[File:GameplayWindowOffset.png]]\n\nYou'll notice that the border is not all the way up in the top left of the play window. When trying to place a house, this can cause the \"ghost image\" of the plot to actually be out by one tile in each direction. \n\nAll you need to do is click that border, and drag it up to the top left of your play window to look like this:\n\n[[File:GameplayWindowOnset.png]]\n\nDoing so will synchronize your play window to properly place the house based on the \"ghost image\" of the plot you have selected.\n\nSome additional rules to keep in mind:\n* There must be a minimum of 5 tiles space between any house in behind, as well as in front of a house you try to place.\n* There must be a minimum of 1 tile space between any house beside/adjacent to a house you try to place.\n* In the case of world objects such as trees, when it is an object you can not pass through with your character, there must be a 1 tile space between your planned home and this object. This goes for in front, behind and alongside of the walls of the desired plot.\n* When selecting a house through the House Placement Tool (purchased in carpentry shops from NPC vendors) the displayed plot size is written in West -> East X South -> North. So a 7x8 house plot would be 7 tiles west -> east x 8 tiles south -> north. It's important to remember that when placing a house, the plot size does NOT take into account the steps. The steps abide by the first rule requiring a minimum of 5 tiles space between houses in behind and in front. For example, the above plot size, 7x8, would actually be placed occupying 8x8 tiles, as the steps would count in afterwards.\n\n==I have a classic house, do I really need to carry a key around?==\nNo, you don't - Rejoice! While you are given a key by default when placing or trading a classic house, you don't need to use them. Classic houses have been updated to allow you to use the same security features as containers. To make use of this, first unlock the door by double-clicking the key and selecting the door. From within the house, type \"I wish to secure this\" and select the door. You will now be able to select the access level. You can now put the key away and still get access to the house, as long as you meet the required access level.\n\n<gallery mode=\"packed\" class=\"right\">\nFile:housedoorunlock.png|Unlock door\nFile:housedoorunlocked.png |Door unlocked\nFile:Housedoorsecure.png|Securing door\n</gallery>\n\n==I see homes with no door, how do they get in?==\nCustom homes can be made with or without doors, although it may seem foolish at first not to have a door, it is actually more secure as you can place teleporters when using the custom house creation screen. These teleporters are subject to the same [[Custom_Housing#Home_Security|Home Security Levels]] which will only teleport a player that meets that level of access.\n\nThere are 3 types of teleporters that can be added to a custom home:\n* Custom House Creation Screen Teleporter tiles - These are found in the menu when picking tiles to customize a home, there are several tiles types that have individual Alchemical symbols on them. If you place 2 tiles that have the same Alchemical symbol they will be \"linked\" and you will teleport to between them.\n* [[House_to_House_Teleporter|House-to-House Teleporter Tiles]] - These are special rechargeable teleporter tiles that can allow a home to have a teleporter that will end up in another home. The tiles must be locked down in a home in order to be used. You can purchase them from the Gold Sink Vendor and recharge them with special crystals purchased from the same vendor.\n* [[Dimensional_Archway|Dimensional Archway]] - These are one-way teleporters that when you stand under them, to be teleported to a location that you designate on your home or around it. These are part of the [[Legendary_Crafting_-_Starting_Out#Craftable_Items|Legendary Crafting Items]] and can be dyed with [[Dimensional_Archway#Dyeing_Archways|special Archway Dye Deeds]].\n\n==I really like this house, how can I copy it?==\nThere are  few ways you can copy a home design that you like:\n* Ask the Home Owner to create a [[House_Design_Blueprint|House Design Blueprint]] which can create a copy of the design of their home and you can use on your own Custom House. This will only change the walls, doors, teleporters, and other structures found in the customize menu and will not create new items.\n* Ask a professional Home Decorator to come design your home and decorate using the [[Custom_Housing#Player Security Levels|Designer Security Level]]. Be careful who you give this access to as it will allow them to remove decorations and items from your home. The access lasts for only 7 days and will need to be refreshed if the design is taking longer than 7 days.\n* Reach out in Discord in the #real-estate-buysell channel to purchase a predesigned home from a player. This is a new home, but generally players in there are interested in selling a home with a design!\n* Some homes are Donation Tier or Raffle Won homes. These designs may or may not be available for copy, you would have to reach out to the Staff to confirm how to get a copy of this home.\n\n==I'm a hoarder, I need more storage!==\nIf you find yourself constantly running out of storage, you could:\n# Buy Marie Kondo's The Life-Changing Magic of Tidying and stop being a packrat ;)\n# Buy a larger house\n# Buy a second or third house\n# Buy a storage increase deed!\n\n[[File:Housestorageincrease.png|right|200px]] That first one is obviously a bit of a joke but you may want to assess what you are storing. It is all too easy to get carried away storing, for example, weak or average weapons that you will simply never use.\n\nThe second and third are fairly self explanatory. If you need a larger property, you may want to browse the [http://www.uoforum.com/forums/selling.15/ Selling] forum.\n\nThe fourth perhaps does need a little more explanation! There is a special \"house storage increase deed\" on the Unique Home Wares Vendor in West Britain that allows you to increase the storage on your property by 50%. It costs 500,000 gold and can be applied up to 10 times. Be aware however that if you drop the house, all the upgrades are lost!\n\n==I'm going on holiday, will my house collapse?==\nDepends how long your holiday is! It takes ''approximately'' 4 weeks for a house to go through the decay stages and collapse. You are advised however to read through the [[House Decay]] page carefully.\n\n=Contributors=\nThe community would like to thank the following brave adventurers who contributed their time and experiences for others to enjoy:\n* Halygon\n* Keith\n* Little Bo Peach\n* Marie Kondo\n* Parsnip"
          }
        ]
      }
    }
  }
}