{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "3511": {
        "pageid": 3511,
        "ns": 0,
        "title": "Decorator Tools",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Items]][[Category:Tools]][[Category:Housing]]\n[[File:Royal_Decorator_Tool_Preview.PNG|thumb|The Royal Decorator Tool that can be purchased with Donation Coins. This Tool allows the locked down items in a home to be raised, lowered, turned, locked down, secured, and moved North, East, South, and West.]]\n\n__TOC__\n=Description=\nDecorator tools are items that assist Home Owners in the decoration of their homes. While you can always decorate your homes by hand, these tools offer a quicker and assignable hotkey/macro option that helps move items into the right positions easily. There are 2 Types of decorator tools currently; the Interior Decorator Tool and the Royal Decorator Tool.\n\n==Notes==\n* Decorator Tools can not move items from outside of a homes footprint area.\n* When turning an object, it is possible that the object does not have an alternate art file to show the turned direction.\n* BE AWARE THAT WHEN SOME ITEMS ARE TURNED THEY CANNOT BE TURNED BACK! Always use the [[Test_Center|Test Center]] on items you are not sure about first before turning them. \n\n=Interior Decorator Tool= \nThe Interior Decorator Tool is purchasable from [[Carpenter|Architect NPCS]] for 10001 gp. These tools are [[Blessed]] which means they cannot be stolen from the top level of your bag and will not be dropped in your corpse if you die. They can be transferred to other players. The item targeted by the tool must be locked down in a home that your character has access to.\n\n[[File:Interior_Decorator_Tool_Preview.PNG|The Interior Decorator Tool that can be purchased from Carpenters. This Tool allows the locked down items in a home to be raised, lowered, and turned.]]\n[[File:Interior_Decorator_Tool_Options_Preview.PNG|The Decorator Interior Tools options. This tool can turn, raise, and lower a locked down or secure object within a home.]]\n\nThere are 3 options the tool provides:\n* '''Turn''' - Turns a locked down object to another art file(generally this means makes the object look like its facing another direction, however the turn function can be used to alter appearances in other ways!)\n* '''Up''' - Moves the locked down object up 1 z-axis. There is a maximum an object can be raised from where your character currently stands.\n* '''Down''' - Moves the locked down object down 1 z-axis. There is a maximum an object can be lowered and is generally the lowest walkable point in your homes level or a number of z-axises from where you character currently stands.\n\n=Royal Decorator Tool= \nThe Royal Decorator Tool is purchasable with [[Donation_Coin|1000 Donation Coins]]. These tools are [[Blessed]] which means they cannot be stolen from the top level of your bag and will not be dropped in your corpse if you die. These tools are Character Bound which means that no other character can use this item, so make sure you purchase this item on a character that will have the access to the home with the objects you with to manipulate. You can only use this tool from within a home that you have access to.\n\n[[File:Royal_Decorator_Tool_Preview.PNG|The Royal Decorator Tool that can be purchased from Carpenters. This Tool allows the locked down items in a home to be raised, lowered, turned, locked down, secured, and move in all 4 cardinal directions; North, East, South, West.]]\n[[File:Royal_Decorator_Tool_Options_Preview.PNG|The Royal Decorator Tool that can be purchased from Carpenters. This Tool allows the locked down items in a home to be raised, lowered, turned, locked down, secured, and move in all 4 cardinal directions; North, East, South, West.]]\n\nThere are 9 options the tool provides:\n* '''Turn''' - Turns a locked down object to another art file(generally this means makes the object look like its facing another direction, however the turn function can be used to alter appearances in other ways!)\n* '''Up''' - Moves the locked down object up 1 z-axis. There is a maximum an object can be raised from where your character currently stands.\n* '''Down''' - Moves the locked down object down 1 z-axis. There is a maximum an object can be lowered and is generally the lowest walkable point in your homes level or a number of z-axises from where you character currently stands.\n* '''North''' - Moves the locked down object one tile North(according to the radar, not your screen!) to a maximum of the home's footprint. \n* '''East''' - Moves the locked down object one tile East(according to the radar, not your screen!) to a maximum of the home's footprint. \n* '''South''' - Moves the locked down object one tile South (according to the radar, not your screen!) to a maximum of the home's footprint. \n* '''West''' - Moves the locked down object one tile West (according to the radar, not your screen!) to a maximum of the home's footprint. \n* '''Lockdown''' - Locks down an object, but cannot exceed the total number of lockdowns a home owns.\n* '''Secure''' - Secures an object, which pops up the Secure Options Selections to set the access levels for the object from within the home. This will not exceed the number of secures in a home.\n[[File:Royal_Decorator_Tool_Secure_Options_Preview.PNG|The Access Levels Selection when the Royal Decorator Tool is used for Securing an object in a home.]]"
          }
        ]
      }
    }
  }
}