{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "3489": {
        "pageid": 3489,
        "ns": 0,
        "title": "Deed Storage Shelf",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Items]][[Category:Containers]][[Category:Housing]]\n[[File:Deed_Storage_Shelf_Preview.PNG|thumb|This is a special container to hold any type of house addon deed. This will also show the Name, Hue number(color), and amount of deeds and has a search bar for a name or hue number.]]\n\n__TOC__\n=Description=\nThis is a special container that holds all of the House Addon Deeds and may not hold all types of deeds(such as [[Bank_Storage_Increase_Deed|Bank Storage Increase Deeds]). This [[:Category:Containers|container]] will show the Name, Hue number(color), and amount of deeds, as well as contains a search bar for a name or hue number. The Deed Storage Shelf can hold up to 300 deeds currently and is automatically sorted alphabetically when a new deed is entered. These stored deeds do not count against the lockdown/secure counts of the home. The Deed Storage Shelf is dyable with a [[Dye_Tub#Furniture_Dye_Tub|Furniture Dye Tub]], however the freshly purchased color is Hue 1855 which cannot be restored once dyed.\n\n==Warning==\n* '''If this container is not locked down, and you choose to use an axe to destroy the item, all items within the container will be deleted!'''\n\n==Patch Notes==\n* [https://www.uoforum.com/threads/new-quality-of-life-items.110193/ new-quality-of-life-items.110193]\n* [https://uoforum.com/threads/8-7-8-0-quality-of-life-items-redo-and-more.110199/ 8-7-8-0-quality-of-life-items-redo-and-more.110199]\n\n=Retrieving Deeds=\nAfter searching through the list of deeds available you can click the \"Right\" Arrow button next to the name of your deed and the deed will be placed into your backpack on the top layer. If there is no room for deed in your backpack, then the deed will be placed on ground beneath you. \n\n<gallery mode=\"slideshow\">File:Deed_Storage_Shelf_Menu_Preview.PNG|This is a house addon deed shelf menu showing the house addon deeds amount, name, and Hue Number. This will also show the Hue number(color) and has a search bar for a name or hue number.\nFile:Deed_Storage_Shelf_Menu_Searchable_Preview.PNG|This is a house addon deed shelf menu showing the house addon deeds amount, name, and Hue Number which has been filtered by the Name. There are two listings as some deeds have no color to the deeds themselves before they have been used and transformed back into a deed form.\n</gallery>\n\n=Depositing Deeds=\nThere are 3 ways you can add Deeds to the Deed Storage Shelf:\n* You can drag and drop a single House Addon Deeds on to the bookshelf.\n* You can drag and drop a bag filled with House Addon Deeds on to the bookshelf.\n* You can use the \"Deposit\" button which will grab any eligible deeds from your characters backpack.\n\n=Storage=\nThe Deed Storage Shelf can hold up to 300 deeds currently and is automatically sorted alphabetically when a new deed is entered. These stored deeds do not count against the lockdown/secure counts of the home.\n\n=Displayability=\nThe Deed Storage Shelf can be turned to face south or east by dropping the item in those directions from your player or able to be turned while locked down with an [[Decorator_Tools#Interior_Decorator_Tool|Interior Decorator Tool]] or a [[Decorator_Tools#Royal_Decorator_Tool|Royal Decorator Tool]].\n\nThe Deed Storage Shelf is also dyable with a [[Dye_Tub#Furniture_Dye_Tub|Furniture Dye Tub]], however the freshly purchased color is Hue 1855 which cannot be restored once dyed. If a fresh [[Dye_Tub#Furniture_Dye_Tub|Furniture Dye Tub]] which comes as Hue 0 is used, the Deed Storage Shelf will appear white.\n\n=Located=\nThe Deed Storage Shelf is purchasable with [[Donation_Coin|2000 Donation Coins]] from [[Exotic_Item_Vendor|Nadine the Exotic Item Donation Vendor]] located in front of the [[Britain|West Britain Bank]]."
          }
        ]
      }
    }
  }
}