{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "1524": {
        "pageid": 1524,
        "ns": 0,
        "title": "Disarm",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Player vs Monster‏‎]][[Category:Player vs Player]][[Category:Player vs Player]]\n__TOC__\n<br>\n[[Image:Flag_wrestling.gif]]\n==Description==\nCharacters with 80 or higher in both [[Wrestling]] and [[Arms Lore]] skill can attempt to Disarm their opponents. A successful Disarm will disarm an opponent, not allowing them to rearm themselves for a short amount of time. This special move can be activated by setting a key macro for the appropriate primary or secondary weapon ability or double-clicking the icon.\n\n==Usage==\n*To perform one of these special attacks, players will need to set a macro to put themselves in the appropriate wrestling “mode”. \n*Both hands must be free in order to perform a move.\n*Once in the special attack mode, the character will attempt the maneuver with each successful hit.\n*If a maneuver is performed successfully the wrestler will automatically go out of their wrestling mode. There is a 10 second delay before the wrestler can perform disarm.\n\nSpecial Moves can be accessed through your client assistance program by setting a hotkey for that skill, or through the client itself through Settings > Macros > New macro > Add:\n\n[[File:Special_Moves_Stun_Disarm_Macro_Preview.PNG]]\n\n==See Also==\n*[[Arms Lore]]\n*[[Stun]]\n*[[Special Moves]]\n*[[Wrestling]]"
          }
        ]
      }
    }
  }
}