{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "2007": {
        "pageid": 2007,
        "ns": 0,
        "title": "Donation Coin",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "__TOC__\n==Description==\nDonation Coins are an in-game currency that can be obtained either by trading for them in-game or by [http://www.uoforever.com/donate.php donating] to the server. The coins can be used to buy items from the:\n* [[Exotic_Item_Vendor|Exotic Item Vendor]]\n* [[Wearables_Vendor|Wearables Vendor]]\n* [[Ethereal_Mounts_Vendor|Ethereal Mounts Vendor]]\n* [[Monster_of_the_Month_Vendor|Monster of the Month Vendor]]\n\nNew items are regularly added to the vendors. Be sure to check the latest [http://www.uoforum.com/forums/news.4/ News] section on the Ultima Online Forever forums. An [http://www.uoforum.com/forums/donations-archive.52/ | archive] of donations can also be found there.\n\n===FAQ===\n====Okay I have obtained donation coins, now how do I buy things?====\nYou will need to be in the main city you started in (Britain), at the West Bank which has the reputation of being the largest and most well-known bank within the world. In front of the bank you will see multiple non-player characters standing on stone blocks. By clicking each vendor you can see all items available at that time! Choose wisely, as there are no trade backs!\n\n====Can I sell my donation coins for gold in game?====\nAbsolutely. The way we have personally experienced and see it, is that those players who are working too much in real life and cannot seem to dedicate the amount of time to be in dungeons grinding day after day are able to donate, then sell those donation coins (for gold) to those players who may not work everyday and who have a lot of time to grind in dungeons.\n\nIn return, those players who cannot donate, simply because they may not have the finances in real life or otherwise, are usually also the same players who have more time for the game compared to the player who does not have the time due to working so much. So that is where the balance lies.\n\n====Who the heck would donate to something like this? Why should I donate at all?====\nYou don't have to. It's a choice we leave up to each individual and we never push it.\nThe way we see it is that we offer unlimited entertainment absolutely free. You can get days, weeks, months — and many players have soaked up years — of entertainment at no cost at all to them. This is a game that never ends, and we are consistently adding new content and ways to take your characters further. We have a 99% server up time ratio spanning across 8 solid years while not only maintaining a steady player base and community, but vastly growing it.\n\n====Can I buy donation coins using Western Union? I don't have any credit cards====\nWe unfortunately do not to Western Union for amounts so small. What you can do though is buy a pre-paid credit card from many different stores and use that."
          }
        ]
      }
    }
  }
}