{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "1631": {
        "pageid": 1631,
        "ns": 0,
        "title": "Download & Installation",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[image:Launcher15.png|thumb|363px]]\n__TOC__\n==Description==\nThis guide will walk you through the downloading and installation process for Ultima Online with the use of a Launcher. This guide will be compatible for ClassicUO, UOSteam and Sallos. Support can be found in our public [[Discord]]. It will automatically keep you up to date and ensure you are up to date on what's happening with the game.\n\nBefore you begin, make sure that all instances of Ultima Online clients and related programs such as ClassicUO are closed. The launcher also automatically updates itself and will install a new file path for ClassicUO.\n\n'''Many thanks to Skye Wolfbane of Trin for creating the below video and walking through install and highlights for the new launcher!'''\n\n'''Please take some time to watch her video as it is extremely helpful.'''\n\nhttps://www.youtube.com/watch?v=jZTPFKPLupk\n\n==Downloading==\n*To download the launcher, visit \n\nhttp://patchbuilder.uoforever.com/launcher/myuofinstaller.exe\nor \n\nhttp://www.uoforever.com/download.php\n*Click \"Proceed to download Full Client\" and save the file. \n*Locate the downloaded executable.\n\n<gallery class=\"left\" widths=\"250px\" heights=\"250px\">\nFile:UOFLaunchWebDownload.jpg|'''UOF Website Download'''<br />(click to preview)\nFile:UOFLaunch.PNG|'''Open MyUOF.exe by \"Show in Folder\"'''<br />(click to preview)\n</gallery>\n\n==Installation==\n===Launcher===\n*Right Click on the executable which should be labeled \"myuofinstaller.exe\" or similar and then select \"Run as Administrator\".\n*You will be prompted with a classic application install prompt\n*Choose where you would like to install the Launcher\n\n\n<gallery class=\"left\" widths=\"250px\" heights=\"250px\">\nFile:installerrunadmin.png|'''Run as administrator'''<br />(click to preview)\nFile:UOFWinDef.PNG|'''Windows Defender  -  \"Run anyways\"'''<br />(click to preview)\nFile:UOFNorton.PNG|'''Norton Anti-virus popup warning'''<br />(click to preview)\nFile:UOFLaunchDownload1.PNG|'''Choose Launcher location'''<br />(click to preview)\nFile:UOFLaunchDownload2.PNG|'''Additional Tasks'''<br />(click to preview)\nFile:UOFLaunchDownload3.PNG|'''Confirmation & Install'''<br />(click to preview)\nFile:UOFLaunchDownload4.PNG|'''Launch MyUOF'''<br />(click to preview)\n</gallery>\n\n===Client===\nIf the Launcher installation went smoothly, the Launcher should now load or can be \"Run as Administrator\" from desktop.\n\n\n[[File:UOFInstall1.0.PNG|left|Run as Administrator]]\n\n\n\n\n\n\n\n\n\n\n*Click the \"Install\" button at the top left of the Launcher menu\n*Wait patiently while the client downloads\n*Run through the client installation process\n**If you don't have any other clients installed already, it is best to install the client in its default location\nOnce the client is installed, you will be returned to the launcher\n*Click on Update Manager and select Update All\n*Hit Play!\n\nDuring the installation Razor will be automatically installed. Even if you prefer UOSteam or Sallos,  before try to set those up, it is recommended that you make sure that you can load the client and log into the server with Razor.\n\n<gallery class=\"center\" widths=\"250px\" heights=\"250px\">\nFile:UOFInstall1.PNG|'''Click Install on left and center'''<br />(click to preview)\nFile:UOFInstall2.PNG|'''Downloading Step 1'''<br />(click to preview)\nFile:UOFinstall3.PNG|'''Downloading Step 2'''<br />(click to preview)\nFile:UOFInstallComplete1.PNG|'''Install Complete!'''<br />(click to preview)\nFile:UOFPlaynow.PNG|'''Hit Play!'''<br />(click to preview)\n</gallery>\n\n==Settings==\nClick the Settings button at the bottom left of the Launcher. This will present you with a few options to:\n*Path Settings: This is where you will set up your other assistant programs such as UOSteam or [[Sallos]].\n*General Settings: Currently four options involving enabling/disabling aspects of the launcher. Auto updates, minimizing, sound, folder security.\n*Notification Settings: For enabling/disabling five different notification settings.\n\n<gallery mode=\"packed\" class=\"right\">\nFile:UOLuancherSettings1.PNG|Path Settings\nFile:UOLuancherSettings2.PNG|General Settings\nFile:UOLuancherSettings3.PNG|Notification Settings\n</gallery>\n\n==Troubleshooting==\n===I have finished downloading, but when I attempt to run the launcher nothing happens. What should I do?===\n\n\n:Validate the error by going into the event viewer, the process for that is: Start > Event Viewer. Once in event viewer, Click Windows Logs, then Application. This can be seen in the three screen shots below.\n\n<gallery class=\"center\" widths=\"250px\" heights=\"250px\">\nFile:LauncherError01.jpg|'''Event Viewer'''<br />(click to preview)\nFile:LauncherError02.jpg|'''Error 1'''<br />(click to preview)\nFile:LauncherError03.jpg|'''Error 2'''<br />(click to preview)\n</gallery>\n\n:This issue should fix by running this installer: \n:<span style=\"color:red\">'''\"You will specifically need x86 c++ redist.\"'''</span>\n:https://www.microsoft.com/en-ca/download/details.aspx?id=48145\n\n\n:If you get a corrupt install, you will get the below error while running that file:\n\n<gallery class=\"center\" widths=\"250px\" heights=\"250px\">\nFile:LauncherError04v2.PNG|'''Run as administrator'''<br />(click to preview)\n</gallery>\n\n:If you get this corrupt install go to Start > Run > \n\n%SYSTEMROOT%\\SYSTEM32\\REGSVR32.EXE %SYSTEMROOT%\\SYSTEM32\\WUAUENG.DLL\n\n:This command should rebuild the .DLL\n\n:After that is complete you will then want to re-run the installer and it should fix the problem.\n\n:Once you are able to successfully complete the installer then you should be able to open the MyUOF Launcher.\n\n===What if I am having issues with downloading the updated art files or would like to update them manually?===\n:You should be able to visit the below locations to get the files outside of the launcher to download/update manually.\n:http://portal.uoforever.com/launcher/latest/artLegacyMUL.uop\n:http://portal.uoforever.com/launcher/latest/map0LegacyMUL.uop\n\n==FAQ==\n===I already have Ultima Online installed. What do I do?===\n:Assuming you downloaded and installed it with the UOF Launcher. Simply run the launcher, select options, specify the Razor directory (If not done already) and click Patch or Play. We cannot provide support for other client versions. The version displayed on the UO login screen should be 7.0.45.0 (Patch Unknown).\n\n===I already have UO Steam / Sallos, not Razor. How do I make it work?===\n:Run the launcher, select options, specify your UOSteam or Sallos directory in the and click Play.\n\n===Does this work properly with Sallos?===\n:Yes. Installation instructions can be found on the [[Sallos]] page. Some graphics will still be broken due to Sallos restrictions.\n\n===Is this launcher safe?===\n:Yes, it was designed by the Ultima Online Forever team. Be sure to check download links to make sure it comes from http://uoforever.com/downloaduoforever.php\n\n===I had the old launcher from Beta testing, will that work?===\n:No, download the latest version of the launcher. If you're not sure, just overwrite the old one. http://uoforever.com/downloaduoforever.php\n\n===It says Ready to Play but Play doesn't do anything===\n:Make sure that you have selected the Razor, UOSteam or Sallos directories located in the Launcher Settings.\n\n===How do I switch between clients like UOSteam or Sallos?===\n:Click on the settings button and select the desired client by clicking its associated icon on the right.\n\n===What is Tree hack? Is that legal?===\n:Tree \"Hack\" was probably a poor choice of words. Tree hack replaces the tree textures to turn them into stumps. It's legal. It's often used by PVPers to give them a better view of players.\n\n===I'm stuck in fullscreen mode. How can I change it back?===\n: Close your client and then go to C:\\Users\\''username''\\Documents\\EA Games\\Ultima Online Legacy\n: You may have something besides UO Legacy installed, maybe you have Stygian Abyss.\n: In this folder you will see folders with the names of all your accounts. You can go into these folders and find the specific character you were logged in as when you went into full screen. You can then either delete their folder (warning: this will remove your other character customisations) or open the uo.cfg from your character's folder and in a text editor and change FullScreen = on to Fullscreen = off.\n\n: If that doesn't work, try this sequence: Go to Options (Alt-O), click on the eyeball icon and make sure full screen isn't checked. Then hit \"default\" on the bottom, log out and close your client and reload it."
          }
        ]
      }
    }
  }
}