{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "1382": {
        "pageid": 1382,
        "ns": 0,
        "title": "Duel Pits",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "__TOC__\n\n\n==Description==\nThe duel pits are a huge part of UO:F. They are not only a place where pvpers can get together and fight but also a safe area to trade. No Skills work inside the duel pits so you cannot be stolen from and cannot be attacked there. There is a banker there for your convenience as well. \n\n\n\n==Location==\nHere is how to get there:\n\n[[File:DuelPits1.png]]\n\nAs you can see The Duel pits are located in West Britain right near the bank. You must run to the docks and enter the gate I am standing next to. Once you enter the gate you essentially are \"safe\".\n\n\n\n\n[[File:DuelPits2.png]]\n\nThere are four duel pits, a banker, healer, signup sheets and leader boards. When PvP Tournaments are held this is where you can spectate or fight. This is a picture of the leaderboards/signup books. The two music stands give you tournament details as listed on the How To Join A PVP Tournament section. \n\n\n\n\n[[File:DuelPits3.png]]\n\nThere is a ranking system in the duels. The leader boards only show the top 150 however you can discover your rank by saying Showladder in game.\n\nThis is noted multiple times in these sections but it is important to remember that you must dismount in order to enter a duel. There are no mounts allowed during duels. Once you dismount the only way to remount is to leave the duel pit area. You can Recall from the duel pits but you cannot gate. You can also hop the gate at the Northern corner in order to leave. You will be ejected on the docks near the gate from which you originally entered.\n\n\n\n==Duel Types==\nThere are several different duel types, which are sets of rules that a duel will follow while in The Duel Pits. There are rules for mage-only duels, for mage vs dexxor, and so on. There is also a custom option that can restrict the rules as much or as little as you want.\n\nThese are selected when starting a duel. To start a duel say \"I wish to duel\"\n\n\n\n===5x Mage Ruleset===\n\nThis duel pit ruleset requires a mage-only template for characters. The name refers to the number of Skills allowed. Any template can join a 5x mage duel, however only the following Skills will be enabled for use during the duel:\n\n\n* Magery\n* Evaluating Intelligence\n* Meditation\n* Resisting Spells\n* Wrestling\n\n\nNo abilities no modifications are allowed. This ruleset is meant for pure mages to duel with.\n\n\n\n===7x Mage Ruleset===\n\nThis duel pit ruleset requires a mage-only template for characters. The name refers to the number of Skills allowed. Any template can join a 7x mage duel, however no weapons are allowed to be used during the duel.\n\n\n* Magery\n* Evaluating Intelligence\n* Meditation\n* Resisting Spells\n* Wrestling\n* <supporting skill>\n* <supporting skill>\n\n\nSpecial moves (Abilities) and modifications are allowed.\n\n\n\n===7x Standard Ruleset===\n\nThis duel pit ruleset allows for all Skills to be used during a fight. It also also allows all weapons/armor unless otherwise specified.\n\nSince all armor, Skills, and weapons are allowed, this is a ruleset that non-mages can fight in.\n\n\n\n===Custom Ruleset===\n\nThe custom ruleset allows for any action to occur as long as it has been enabled during the duel configuration. If you and your opponent(s) have specific requirement for your duel, this is the option to select.\n\n\n\n==How to Initiate a Duel==\nBe aware that you cannot be on a mount during or when joining a duel. You must get off of your mount in order for the duel to start otherwise it will just keep counting down to 0 and then restarting until you either yield or dismount. \n\n\nIn order to initiate a duel you must be in the duel pit area.  You then must say '''I Wish To Duel''' in game. The following things occur. When you say i wish to duel this gump menu shows up on your screen. \n\n\n[[File:DuelPits4.png]]\n\n\nThis allows you to edit the duel you are going to participate in. You can change the rules and such. \n\n\n[[File:DuelPits5.png]]\n\n\nThose are the rules. We have it set up for a standard mage 5x. There are Guides as to what each of the Templates mean to the players. Then you right click when done in order to return to the previous menu. and then you click Player 2:Empty to add a participant. \n\n\n[[File:DuelPits6.png]]\n\n\nWhere Bradley's name is, is where you click. When you click the it opens up a gump for you to click the person you wish to duel. They then get this prompt on their screen. \n\n\n[[File:DuelPits7.jpg]]\n\n\nYou can chose any of those. When this is done then you as the person who initiated the duel gets to \"start\" the duel. After you click start it brings you to this screen. \n\n\n[[File:DuelPits8.png]]\n\n\nThis is where you click okay. The other player also receives this screen. After you both click okay the rules are read out and there is another option to continue. Once that is okayed then you enter a Countdown of 3 seconds. Then you are shot into the available Duel Pit. \n\n\n[[File:DuelPits9.png]]\n\n\nThere is a short countdown to when the duel actually starts so stay on your toes and attack at will. When you die NONE Of your loot is lost. You return on the outside of the duel pit and are able to rematch or cancel the duel. At any time you can say I Yield to yield in a duel. There is a banker available for all restocking.\n\n\n\n[[Category: Player vs Player]]"
          }
        ]
      }
    }
  }
}