{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "2081": {
        "pageid": 2081,
        "ns": 0,
        "title": "Dungeon Bosses",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Quests]][[Category:Player vs Monster]]\n__TOC__\n==Description==\nDungeon Bosses, not to be confused with [[Champion_Spawns|Champ Spawn]] bosses, are a unique PvM feature of UO Forever. They can be found in several of the classic dungeon and each one has different mechanics and special rewards.\n\n==Altars==\n\n[[File:CRYSTALALTAR.png|150px|right|Crystal Altar]]\nA few of the bosses are summoned by empowering Dungeon Altars with 50 crystals. These crystals have a chance to drop on creatures in the dungeon. To charge an altar with a crystal, double click the altar and target the crystal. You can also target your backpack or sub packs within your backpack and it will search for all valid crystals. The dungeon crystals will spawn on all mobs at death on a 5% chance. They will only spawn if a dungeon altar is placed in that specific dungeon region and will decay after 24 hours.\n\nAll crystal dungeon altars have a chance to award a Flawed Meta Talisman relic. To be eligible for a chance at the relic, you must contribute crystals the altar. At the end of the boss fight, there is a 10% chance that someone who contributed will receive a relic straight to their bank. You do not need to be alive or in range of the boss/altar for this to happen. The more crystals you contribute, the greater chance you have to win the relic if it drops. If you contribute all 50, you will have that 10% chance of receiving a relic.\n\nThere are 8 [[Mesozoic_Lands#Meat_Altars|Meat Altars]] that can be found in the [[Mesozoic Lands]], that require a total of 20 \"raw dino ribs\". This altar opens the Inner Summit area where you have to fight off special mobs before a boss is spawned.\n\n==Encounters==\nThe following details were provided by lore master Adam and bold dungeon hunters Ariakan, Messremb and Suikoden.\n\n===Arch Demon===\n[[File:archdemon.png|right|Arch Demon]]\n* '''Dungeon:''' [[Wrong]]\n* '''Summoned:''' By waiting! He will spawn in a small room in [[Wrong]] every 4-5 hours after he was last killed, along with three tentacles of the Harrower. The room can be accessed by teleporter in the North East corner of [[Wrong]] Level 1.\n* '''Special Abilities:'''\n# '''Summoning Wards:''' This will summon a group of elemental wards that will attack players at intervals, these wards operate will target the persons who was closest to them for the longest amount of time. Lightning will occasionally strike the wards. If you are on top of a ward when this happens, you will be instantly killed. The four wards are:\n## Fire ward: deals initial 10 damage and 2 damage ticks every second for 30ish seconds.\n## Ice ward: deals initial 10 damage and freezes the player randomly for 30ish seconds.\n## Lightning ward: deals 20 damage. \n## Poison ward (watch out for this one): poisons a character with lethal poison and will reapply for 30 seconds, however every time a player cures the damage done is decreased by one poison level. ​\n# '''Demon Fire:''' This is the demon fire attack, it creates a slow moving fire that follows a player, and kills them instantly if it hits them. This attack works on line of sight. Break the line of sight by running to the other side of the room, or into one of the small rooms and it will stop following you. It only targets players who are more than one tile away from the boss. If you cross the path of someone else's demon fire, you will take around 15 damage.\n# '''Spewing Blood:''' This will fire an area of effect attack at a player, it will create a semi circle around the arch demon hitting everyone in the semi circle. Three waves of this attack are sent out, each dealing approximately 30 damage. This attack can be avoided by moving in and out of range of the boss. This will not guarantee that you will be avoid being damage but it limits the chance of getting hit. This attack only hits players more than 1 tile away. If you are very close when the attack is launched, all three waves of blood will hit you and you will be instantly killed.\n# '''Ominous Object:''' ''Begins summoning an ominous looking object''. This is a slow moving area of effect attack that hits a small circle all around the Boss, it deals massive damage killing anyone it hits. This attack is easy to avoid simply stand more than 8 or 9 tiles away.\n# '''A Shielded:''' The shielded will spawn and work very similar to Silvani from Lord Oaks. When the shielded is up Arch will take little to no damage until the shielded is dispatched. \n* '''Loot (Must score at least 1 damage point):'''\n** '''[[Meta_Talismans|Meta Talismans Relic]]:''' Unlike the altar charged bosses, this has a chance to drop in your backpack rather than your bank. Watch out for thieves and player killers!\n** '''[[Power Scrolls]]'''\n** '''[[Antique_of_the_Artisan#Mythical Crafting|Mythical Crafting Recipe]]'''\n\n<gallery mode=\"packed\" class=\"right\">\nFile:Arch_demon_entrance.png|Location of Teleporter\nFile:Awaiting_arch_demon.png|Waiting for \"Arch\"\nFile:ArchDemonicWard.PNG|Demonic Wards\nFile:ArchDemonFire.PNG|Demon Fire\nFile:ArchSpewingBlood.PNG|Spewing Blood\nFile:ArchOminousObject.PNG|Ominous Object\nFile:Ashielded.PNG|A Shielded\n</gallery>\n\n===Fafnir===\n[[File:fafnir.png|200px|right|Fafnir]]\n* '''Dungeon:''' [[Destard]]\n* '''Summoned:''' By empowering the altar which is at the North West corner of [[Destard]] Level 1. It is filled with red crystals from the monsters in that dungeon.\n* '''Special Abilities:'''\n# '''Flame Spew:''' A 180° frontal flame breath attack. Leaves flames on the ground that last for 1 minute. Each flame will tick for 5 damage per second you stand on it. Casting wall of stone can block the attack (if you cast it fast enough after the emote). Fafnir will emote *Flames begint to spew from Fafnir's mouth* prior to casting this ability.\n# '''Crucible:''' An instant death spell. It impacts all creatures and players in a 12 tile radius. It has a very long cast time. About 10 seconds from the time he emotes. This should be plenty of time to get you and your pets out of the ability. Each player or pet that is caught in the crucible will die and spawn a magma elemental. Fafnir will emote *Begins casting Crucible* when he used the ability.\n# '''Wing Vacuum:''' Fafnir flaps his wings, creating a vacuum which will draw all creatures and players in a 10 tile radius towards him. This ability will dismount you, stun you and drag you closer to Fafnir every second. It ticks for 10 seconds, with each second drawing you closer and damaging you. Fafnir will emote *Begins flapping its wings to draw its prey in closer* when he used this ability.\n* '''Loot (Must score at least 1000 points):'''\n** '''[[Meta_Talismans|Meta Talismans]] Relic:''' This has a chance to drop in the bank of those who put in crystals.\n** '''[[Power Scrolls]]'''\n** '''[[Antique_of_the_Artisan#Mythical Crafting|Mythical Crafting Recipe]]'''\n** '''Title Scroll:''' [[Titles_and_Hues_Guide#Custom_Titles|Dragonbane]] Awarded to the highest damager on Fafnir. Drops 100% of the time.\n** '''Sigurd's Shield:''' This shield is a common drop from the boss. It 100 charges which are used to block Fafnir's flame based attacks. Each blocked attack will use a charge.\n** '''Fafnir's Head:''' Special text reads - The stuffed and mounted head of the legendary dragon, Fafnir. Uncommon drop.\n** '''Sigurd's Armor:'''  A piece of armor belonging to the legendary dragonslayer, Sigurd. Very rare drop. Comes in the form of: Chain leggings, Chain chest, Plate gloves, Dragon gorget and Dragon helm. Special text reads - An old piece of armor said to belong to the dragonslayer Sigurd.\n** '''Balmung Sword:''' Does the crucible visual effect when equipped. Uber rare drop. Special text reads - A legendary sword which is said to contain the essences of one thousand slain dragons.\n<gallery mode=\"packed\" class=\"right\">\nFile:fafnirAltar.png|Fafnir Altar\nFile:fafnirFlames.png|Flame Spew\nFile:fafnirCrucible.png|Crucible\nFile:fafnirWings.png|Wing Vacuum\nFile:fafnirVictory.png|Fafnir Defeated!\n</gallery>\n\n===Akor===\n[[File:akor.png|200px|right|Akor]]\n* '''Dungeon:''' [[Covetous]] 5\n* '''Summoned:''' By empowering the altar which is on top of the temple. It is filled with purple crystals from the monsters ''on that dungeon level only.''\n* '''Special Abilities:'''\n# '''Flame Breath:''' Being a dragon he does the standard flame breath attack that he sends at this current target.\n# '''Teleport Attack:''' Similar to the berserker relic attack Phase Shift, Akor will teleport to a target inside of radius and do massive damage. He has destroyed many a brave warrior in this way. Staying outside of his Teleport range seems to be the best tactic to not be targeted.\n* '''Loot (Must score at least 300 points):''' \n** '''[[Meta_Talismans|Meta Talismans]] Relic:''' This has a chance to drop in the bank of those who put in crystals.\n** '''[[Meta Pets|Meta Pet]] Relic'''\n** '''[[Meta Pets|Meta Dragon]] Egg:''' If it drops, it will appear on the ground under the top level of the temple.\n** '''[[Power Scrolls]]'''\n** '''[[Antique_of_the_Artisan#Mythical Crafting|Mythical Crafting Recipe]]'''\n\n<gallery mode=\"packed\" class=\"right\">\nFile:covetous5entrance.png|Stairs to [[Covetous]] 5\nFile:covetousAltar.png|Altar Location\nFile:Akor2.PNG|Akor Flying\n</gallery>\n\n===Adramalech - The Wretched King===\n[[File:Adra.png|right|Adramalech]]\n[[File:Adradeath.png|right|Death]]\n* '''Dungeon:''' [[Hythloth]]\n* '''Summoned:''' By empowering the altar which sits in a room on the east side of the Level 1. It is filled with green crystals from the monsters in that dungeon.\n* '''Special Abilities:''' Aside from casting regular offensive Magery spells, Adramalech also has several tricks up his sleeve...\n# '''Entropic Assault:''' A barrage of green and blue fireballs that drops anyone in range down to a low health. Be prepared to cross-heal your fellow warriors.\n# '''Summon Death:''' Summons the pale rider himself! Death moves fast and hits hard but is easily distracted and lured by a hidden character.\n# '''Summoning Ritual:''' Casts several demonic pentagrams on the floor. Stepping on these causes small ticks of damage but at a fast rate. Best navigated around!\n# '''Mark of the Beast:''' A large fiery area of effect attack that melts anything in its reach.\n* '''Loot:''' \n** '''[[Meta_Talismans|Meta Talismans]] Relic:''' This has a chance to drop in the bank of those who put in crystals.\n** '''[[Power Scrolls]]'''\n** '''[[Antique_of_the_Artisan#Mythical Crafting|Mythical Crafting Recipe]]'''\n** '''Title Scroll:''' [[Titles_and_Hues_Guide#Custom_Titles|Kingslayer]]\n\n<gallery mode=\"packed\" class=\"right\">\nFile:HythlothAltar.png|Location of Altar\nFile:Adrasummondeath.png|Summoning Death\nFile:Deathonstealther.png|Death distracted\nFile:Adraentropicassault.png|Entropic Assault\nFile:Adramarkofthebeast.png|Mark of the Beast effect\nFile:Adrasummoningandentropic.png|Summoning ritual pentagrams\n</gallery>\n\n===Warlock===\n[[File:warlock.png|right|Warlock]]\n* '''Dungeon:''' [[Ankh]]. He was originally located in [[Covetous]] but decided to [http://www.uoforum.com/threads/warlock-has-found-a-new-home.91139/ relocate] to a more suitable location.\n* '''Summoned:''' Long / Random time window. Spawns in [[Ankh]] Graveyard room.\n* '''Special Abilities:''' Brave warriors and scholerly folks are currently confirming this. It is known that the Warlock has a very high level of Magery.\n* '''Loot (Must score at least 700 points):''' \n** '''[[Meta Pets|Meta Pet]] Relic'''\n** '''[[Power Scrolls]]'''\n** '''[[Antique_of_the_Artisan#Mythical Crafting|Mythical Crafting Recipe]]'''\n** '''Cracked Crystal Ball'''\n\n<gallery mode=\"packed\" class=\"right\">\nFile:WarlockLocation.png|Warlock Room\n</gallery>\n\n===Lich Khan===\n\n* '''Dungeon:''' [[Deceit]] Level 5.\n* '''Summoned:''' He spawns on a timer, like the Arch Demon, every 4-5 hours after he was last killed, along with three tentacles of the Harrower.\n* '''Special Abilities:''' See Arch Demon\n* '''Loot (Must score at least 700 points):''' \n** '''[[Meta_Talismans|Meta Talismans]] Relic:''' Unlike the altar charged bosses, this has a chance to drop in your backpack rather than your bank. Watch out for thieves and player killers!\n** '''[[Power Scrolls]]'''\n** '''[[Antique_of_the_Artisan#Mythical Crafting|Mythical Crafting Recipe]]'''\n\n<gallery mode=\"packed\" class=\"right\">\nFile: LichKhanLocation.png|Lich Khan Spawn Area\n</gallery>\n\n===Kal'gedeth - Abomination Lord===\n[[File:Kal'gedeth2.PNG|right|Kal'gedeth]]\n* '''Dungeon:''' [[Montor]]\n* '''Summoned:''' By empowering the altar which sits south of entry, but central in the main area. It is filled with green crystals from the monsters in that dungeon.\n* '''Special Abilities:''' Kal'gedeth casts magic and had decent melee ability, but also has several skills at its disposal...\n# '''Entropic Assault:''' A barrage of green and blue fireballs that hits a few selected targets removing 80% of their current HP, Stamina and Mana pools. Be prepared to cross-heal your fellow warriors.\n# '''Plague:''' Kal'gedeth creates a zone around himself that applies plague to all those inside. If inflicted you will begin to puke repeated for 2 damage until runs its course. This is contagious and if you, or anyone else, pukes near eachother it will keep refreshing the timer. Those infected will need to stay away from eachother, this is especially difficult for tamer pets. \n# '''Acid Blood:''' When damaged Kal'gedeth will release an area of acid blood onto the ground! This will do 5 damage per second, but only if you, or your pets, stay standing in the acid blood. \n* '''Loot:''' \n** '''[[Meta_Talismans|Meta Talismans]] Relic:''' This has a chance to drop in the bank of those who put in crystals.\n** '''[[Power Scrolls]]'''\n** '''[[Antique_of_the_Artisan#Mythical Crafting|Mythical Crafting Recipe]]'''\n** '''Title Scroll:''' [[Titles_and_Hues_Guide#Custom_Titles|Gluttonous]]\n\n<gallery mode=\"packed\" class=\"right\">\nFile:EnterMontor.PNG|Montor Entrance\nFile:MontorAltar.PNG|Location of Altar\nFile:EntropicAssault.PNG|Entropic Assault\nFile:Plague.PNG|Plague\nFile:Plague2.PNG|Plague - Puking\nFile:AcidBlood.PNG|Acid Blood\n</gallery>\n\n===Lord Maleki - The Warden===\n[[File:WardenBoss.PNG|right|Lord Maleki]]\n* '''Dungeon:''' [[Asylum]]\n* '''Summoned:''' Long / Random time window. He spawns in the back chamber of [[Asylum]] that requires green keys to enter. Also, an Ankh of Binding is required to get past the Asylum Guardian statue without it you will die instantly. This necklace '''MUST BE WORN''' to gain protection from the statue. It is in your best interest to bless the Ankh of Binding so you do not lose it.\n* '''Special Abilities:''' The Warden is essentially a melee boss, but he has some powerful special moves available to him.\n# '''Super Speed:''' He moves at amazing speed while chasing his target and had very high swing speed with his weapon. Being on foot it is very unlikely you will be able to get him off of you without paralyze or help from another player to slow him down.\n# '''Devour Corpse:''' The Warden will eat players corpses when they die and add it to his own backpack, so make sure to come prepared. \n# '''Have a Bite:''' He will toss a piece of chewed on human remains at the player causing damage. This damage does about 50% of your current HP.\n# '''Merciless Attack:''' He will unleash a flurry of quick attacks at the target.\n# '''Summon Vampires:''' Upon his calling he will bring several vampires to aid in his fight. Currently he can spawn up to a maximum of 4 vampires.\n* '''Loot:''' Brave travelers are still confirming this!\n** '''[[Meta Pets|Meta Pet]] Relic:''' \n** '''[[Meta_Talismans#Aesthetic_Relics|Aesthetic Relics]]:''' '''ONLY COMBUSTION RELIC DROPS ON THE WARDEN!'''\n** '''[[Power Scrolls]]'''\n** '''[[Antique_of_the_Artisan#Mythical Crafting|Mythical Crafting Recipe]]'''\n** '''Title Hue:'''\n** '''Title Scroll:''' [[Titles_and_Hues_Guide#Custom_Titles|The Warden]]\n** '''Warden Platemail:'''\n\n<gallery mode=\"packed\" class=\"right\">\nFile:AslyumMapAnnotated.png|Chambers & Keys\nFile:WardenRoom.PNG|Warden Room\nFile:AsylumGuardian.PNG|Asylum Guardian Statue\nFile:HaveABite.PNG|Have a Bite\nFile:WardenBendOver.PNG|Merciless Attack\n</gallery>\n\n===Booty Island Dungeon===\n* '''Dungeon:''' [[Booty Island Dungeon]]\n* '''Summoned:''' By placing four Medusa statues in [[Booty Island Dungeon]], a dungeon encounter with a number of bosses is started. Players will be kicked out of the dungeon when this encounter begins. This is designed to be a challenging encounter for a larger guilder or organized group. Upon re-entering the dungeon, you must first kill 1000 mobs in the dungeon. A little counter will appear to show you the progress. Once you have killed 1000 monsters, four mini bosses will spawn and each will have a chance of a relic and Power Scrolls. When all four mini boss have been defeated, the final boss also known as Medusa will spawn in her secret lair! Many thanks to Medusa-slayers Koldes and Brom for providing information on the bosses!\n\n====Bosses====\n* '''Hydra:''' No notable attacks but it has very high hit-points and defence  - Throw all your dragons at it!\n* '''Shankhill the Butcher:''' This wily foe has some of the same attacks as the [[Dungeon_Bosses#Arch_Demon|Arch Demon]] but does not drop any wards, shielded angels, or tentacles of the harrower.\n* '''Minos the Minotaur:''' This pet eater has the same attacks as the [[Random_Dungeon_Adventure#Minotaur_Champion|Minotaur Champion]]. He will also charge towards a random pet or player but he will stare in that direction, tipping you off to where he will charge.  Minos will one hit kill you within a 3-4 tile radius of his location and he will kill you even if you’re hidden or invisible.\n* '''Argelmach the Sphinx:''' Throws large boulders at random pets or players which causes a large amount of area damage. This effect is similar to Chain-Lightning, where if you stand by someone, more boulders come and hit them. Argelmach will also summon titans and giant beetles. And finally Argelmach will drop sand bombs that ticks for 40 damage if it explodes when you’re standing on it.\n* '''Medusa:''' Turns players/pets/summons into stone and then makes copies of them. Can also spawn summons on her own that can be dispelled (such naga, ogre lords, and wailed banshees) and shoot poison arrows across a long distance. Much like tentacles of the harrower, pets will not respond to an \"all kill\" command, you instead have to use \"all guard\".\n\n<gallery mode=\"packed\" class=\"right\">\nFile:BootyArch.png|Shankhill\nFile:BootyHydra1.png|Hydra\nFile:BootyMino.png|Minos\nFile:BootySphinx.png|Sphinx\n</gallery>"
          }
        ]
      }
    }
  }
}