{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "134": {
        "pageid": 134,
        "ns": 0,
        "title": "Escorts",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Quests]][[Category:Player vs Monster]]\n__TOC__\n==Introduction==\nAs a new player to this server, I had a little bit of a harder time starting out and making money. I skipped the newbie dungeon (on both my accounts). I found escort missions to be simple and a quick way to make some start-up gold. It's mentioned in other posts on the forums, so this is not new information. But I thought I would share my method and some quick tips for new players that may find themselves in need of some gold like I was.. Please keep in mind that this isn't for everyone, and if you find yourself bored out of your mind and not having fun, look for other ways of making money.\n\n\nIn short, Escorting is where you accept an escort mission from an NPC. They can be found in all major cities. They will want to be escorted to a city or a dungeon. (For the beginning character, you'll want to steer clear of the dungeon escorts until you have runes marked and can gate the NPCs to that dungeon location). Accept the Escort missions that can be fulfilled by using the moongates. Each escort will give you between 500 to 1000 gold for a completed escort. You can escort one NPC every ~ 5 minutes. When you first start out, you'll want to use this time to locate your next NPC. You'll also want to of course, use this time to bank your gold. In general, you should never carry more than 10k on you at one time. 5k gold would be pushing as a new character, in my opinion.\n\n\nOn average, you'll make about 750 gold per escort. If your running two accounts w/ two characters, you can make about 1500 (1.5k) gold every 5 minutes, or approx 9000 (9k) gold an hr. You can make more if you coordinate more than one character on each of the accounts. How far you want to take it is entirely up to you.\n\n\nOnce you start to make more money and start training your character a little more, I would suggest investing in Magery if you haven't already done so.\n\n\nThe following items are recommended for quicker fulfillment of the Escorts:\n<small>'''Note: Purchase a full spellbook from a vendor, or build your own. To maximize the money you can make w/ escorting, you'll need a mage that can cast recall, mark & gate travel.'''</small>\n\n* Lots of Reagents\n\n* Rune to Rune library until you have made your own runes for your runebooks\n\n* 20+ Runes (16 per runebook)\n\n* 2-3 Runebooks\n\n\n\n==Rune Libraries==\n'''There is are good rune libraries located all over with runebooks of known Escort NPC Respawns.'''\n\nBelow are a couple that are well known:\n\n* Northwest of the Britian Moongate\n\n* Southwest corner of Verity (Moonglow) Island\n\n* Northwest corner of Verity (Moonglow) Island -- North of the Lycaeum\n\n* North of the Brit-Yew-Vesper crossroads\n\n* Next to the Ocllo Bank\n\n\n\n==Marking Runes==\nYou'll want to mark runes for all the major cities & dungeons. Once you have enough money to purchase runebooks, you can have one runebook for the cities and one runebook for the dungeons. For dungeons, I recommend marking a location that is close to the entrance, not directly inside the dungeon. Less risk of being killed by a aggressive monster or murderer. You may also wish to mark some NPC escort spots as well, for better access, and place these runes into a third book.\n\n\nTrain magery until you can use a gate travel scroll, and use this with your runebooks to gate the NPCs to the location they've asked. (Note, you may be able to cast a gate travel scroll at 50 magery. I will double check this and update accordingly). You'll want to mark the runes as you go. If the NPC has a location you don't have marked yet, mark a temprary rune for that NPC's location, recall to the rune libary, recall to that requested location, mark the new rune, and then recall back to the Escort NPC. Accept the escort, gate the NPC to the newly marked location, rinse and repeat. Most gates stay open long enough that you can get the NPC from the entrance of a dungeon and make your way back to the gate before it fades.\n\n\n==Timer==\nThere is a 5 minute timer between escorts. Use this time to locate escorts, mark locations that you may not have, and bank your gold. After awhile, this 5 minute timer limits how fast you can complete escorts. Feel free to work in other methods to maximize the amount of gold you can make. For example, you can use a second account and use your main char to gate that second account's character(s) as well.\n\n\n==Conclusion==\nI know that there are other ways to make money out there, but this is one of the easiest ones I found when I was a new character, and is pretty much risk free. I would recommend finding other ways to make money as soon as you get the chance, as this method can become boring and tedious. But it's a good initial way to get some gold. I hope this information help newer players.\n\n[[Category:Guides]]"
          }
        ]
      }
    }
  }
}