{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "2018": {
        "pageid": 2018,
        "ns": 0,
        "title": "Exodus",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Atlas]][[Category:Dungeons]]\n[[Category:Dungeons]]\n[[File:ExodusLevelYewJailEntranceToExodusTemple.PNG|The Entrance to the Exodus Temple Courtyard of the Exodus Dungeon|425px|thumb|right|The Entrance to the Exodus Temple area of the Exodus Dungeon. This is located on top of the Yew Jail which can be reach via the sparkle teleporter within the Jail Room on the bottom floor.]]\n__TOC__\n\n==Notes==\n* The entrance is located on the roof of [[Yew]] prison. You can teleport up to the entrance using the grey sparkling teleporter at the north west corner of the prison. This is however quite a trek from [[Yew]]. You may be best off visiting your local rune library for a rune to the entrance!\n* Creatures are closely bunched together - enter and explore with care. This is not a dungeon for newcomers!\n* There are many monsters that are either Ethereal Hue(see-through) or closely colored to the landscapes and may be difficult to see them before its too late.\n* There are many fire traps outside the Temple, be careful when running through the courtyard.\n* Within the Temple Catacombs, there are hidden teleporters which may send you to another side of the maze, watch out for alchemic symbols on the ground.\n\n==Exodus Temple==\n[[File:ExodusLevelExodusTempleOutsideTemple.PNG|Exodus Temple|425px|thumb|right|Exodus Temple looms grimly over the courtyard, protected by its ghostly guardians. Beware the tentacles of Exodus, it would seem that the very Dungeon itself is reaching out out to stop you!]]\nThe Entrance of Exodus is located on top of the Yew Jail which can be reach via the sparkle teleporter within the Jail Room on the bottom floor. This leads to a very large courtyard and a mysterious Temple where you can find:\n* Lava Pools and Stone Huts\n* An Evil Forest of Reapers\n* Large Multi-Layer Stone Temple and Towers\n\n<gallery mode=\"packed\" class=\"right\">\nFile:exodus_teleporter.png|Teleporter from the Yew Jail bottom floor.\nFile:ExodusLevelYewJailEntranceToExodusTemple.PNG|The Entrance to the Exodus Temple Courtyard of the Exodus Dungeon\nFile:ExodusLevelExodusTempleEntrance.PNG|Entrance to the Exodus Temple Courtyard\nFile:ExodusLevelExodusTempleStoneHuts.PNG|Stone Huts where Stone Constructs, Gargoyles, and Fire Elementals live near a flowing lava fall in the Exodus Temple Courtyard.\nFile:Exodus2.png|Lava Lakes\nFile:ExodusLevelExodusTempleOutsideTemple.PNG|Exodus Temple looms grimly over the courtyard, protected by its ghostly guardians. Beware the tentacles of Exodus, it would seem that the very Dungeon itself is reaching out out to stop you!\nFile:ExodusLevelExodusTempleInsideTemple.PNG|Exodus Temple has multiple layers, these is the entrance to the Catacombs below. Note that the energy that you seem coursing through the area will not harm you, however everything else in here will!\n</gallery>\n\n===Monsters - Exodus Temple===\n{| border=\"1\" \"\n|-\n| align=\"center\" style=\"background-color:#000; color:#FFF;\" | '''Slayer Group'''\n| align=\"center\" style=\"background-color:#000; color:#FFF;\" | '''Monsters'''\n|-\n| align=\"center\" | [[Slayer_Types#Abyss|Abyss]]\n| align=\"center\" | Arcane Deamon, Balron, Burning Gargoyle, Flaming Gargoyle, Gargoyle Destroyer, Gargoyle Enforcer, Moloch, Scorching Gargoyle, Shadow Deamon, Shadow Knights, Smoldering Gargoyle, Stone Gargoyle\n|-\n| align=\"center\" | [[Slayer_Types#Elemental|Elemental]]\n| align=\"center\" | Fire Elemental\n|-\n| align=\"center\" | [[Slayer_Types#Fey|Fey]]\n| align=\"center\" | Shadow Wisp\n|-\n| align=\"center\" | [[Slayer_Types#Reptilian|Reptilian]]\n| align=\"center\" | Dragon, Lava Serpent\n|-\n| align=\"center\" | [[Slayer_Types#Undead|Undead]]\n| align=\"center\" | Dark Skeletal Knights, Dark Skeletal Mages\n|-\n| align=\"center\" | None\n| align=\"center\" | Doppleganger, Fire Steed, Hell Hound, Quagmire, Reaper, Shadow Gazer, Stone Harpy, Tentacle Of Exodus\n|}\n\n==Exodus Catacombs==\n[[File:ExodusLevelExodusDungeonEntrance.PNG|Exodus Catacombs |425px|thumb|right|This is the Entrance inside the Catacombs, the center square is a teleporter from the Temple to the Catacombs, beware the Minions of Exodus!]]\nThe Entrance of Exodus Catacombs is in the center of the Temple on the bottom floor. This teleports you to a Catacomb of maze-like machinery where you will see:\n* Ancient Advanced Machinery and Workshops\n* Corridors filled with Alchemic Symbols and Teleporters\n* Evidence of Ancient Engineers and Forgotten Workers\n\n<gallery mode=\"packed\" class=\"right\">\nFile:ExodusLevelExodusTempleInsideTemple.PNG|Exodus Temple has teleporter is in the center of the bottom floor of the Temple. You may see energy flowing on the floor, do not worry it will  not harm you!\nFile:ExodusLevelExodusDungeonEntrance.PNG|This is the Catacombs side of the teleporter, beware that you will be swarmed with Minions of Exodus trying to enter.\nFile:ExodusLevelExodusDungeonJournalPNG.PNG|Evidence of Engineers long forgotten in the Catacombs of Exodus.\nFile:ExodusLevelExodusDungeonEnslaved.PNG|Forgotten Workers left to toil forever in the Catacombs of Exodus.\nFile:ExodusLevelExodusDungeonTeleporters.PNG|Beware the alchemic symbols on the ground, for stepping on one may send you to another side of the dungeon and to the monsters that await on the other side of that trap!\n</gallery>\n\n===Monsters - Exodus Catacombs===\n{| border=\"1\" \"\n|-\n| align=\"center\" style=\"background-color:#000; color:#FFF;\" | '''Slayer Group'''\n| align=\"center\" style=\"background-color:#000; color:#FFF;\" | '''Monsters'''\n|-\n| align=\"center\" | [[Slayer_Types#Abyss|Abyss]]\n| align=\"center\" | Balron, Blood Deamon, Enslaved Gargoyle, Moloch, Shadow Deamon, Succubus, The Guardian Of Doom\n|-\n| align=\"center\" | [[Slayer_Types#Elemental|Elemental]]\n| align=\"center\" | Crystal Elemental, Crystal Vortex, Rai-ju\n|-\n| align=\"center\" | [[Slayer_Types#Fey|Fey]]\n| align=\"center\" | Wisp\n|-\n| align=\"center\" | [[Slayer_Types#Repond|Repond]]\n| align=\"center\" | Titan\n|-\n| align=\"center\" | [[Slayer_Types#Reptilian|Reptilian]]\n| align=\"center\" | An Ancient Shadow Wyrm, An Ancient Wyrm, Elder Dragon, Wyvern\n|-\n| align=\"center\" | [[Slayer_Types#Undead|Undead]]\n| align=\"center\" | Ancient Lich, Flesh Golem, Lich\n|-\n| align=\"center\" | None\n| align=\"center\" | Golem, Exodus Minion, Exodus Minion Lord, Exodus Overseer, Quagmire, Shadow Fiend\n|}"
          }
        ]
      }
    }
  }
}