{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "1668": {
        "pageid": 1668,
        "ns": 0,
        "title": "Expansions",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "__TOC__\n==Description==\nExpansions are added to UO Forever to keep things fresh and exciting for both new and veteran players. Below you will find the name of the released expansions and their released date, followed by their base features. For more information on each individual feature, try searching the wiki.\n\n==Virtues & Valor==\n[[image:Expansion1top.jpg|thumb|300px]]\n'''Virtue & Valor January 18th, 2014'''\n\n*[[Random Dungeon Adventure|Random Dungeon Adventures]]\n::Create 5 different small dungeons with an end boss.\n::One portal will spawn at a totally random location on the map or in a dungeon and stays open.\n::Once all mobs/boss are killed in that dungeon area all players will get reward based on damage.\n::RDA's will be the only way to obtain shards to create the Legendary Hammer.\n\n*[[Naval Warfare Reborn]]\n::Implement smooth sailing for boats.\n::Added new boats.\n::Added craft-able cannons.\n::Implementation of an underwater \"grotto\" dungeon only accessible by boat, mounts not allowed. \n\n*Dungeon Improvements\n::Revamped Fire Dungeon to include new areas with higher end spawns.\n::Total revamp of Hythloth which will include many new creatures and difficult spawns.\n::Added two brand new dungeon levels for existing dungeons.\n::Cove level 4 with many high end mobs.\n::An addition to Ice dungeon (Ice level 3) which will include a new champion spawn area.\n\n*[[Legendary Crafting System]]\n\n*[[Slayer Armor]]\n::Allow players a new means for mitigating monster damage through the use of Slayer Armor.\n::Slayer armor will provide a 50% reduction in damage vs the specific mob type.\n::Add repond, reptile, abyss, elemental, undead and arachnid armor.\n\n*Housing Changes\n::Fully implemented an obtainable Cellar Addon.\n\n*New Events\n::Castle Defense PvP event (attackers and defenders, DOTA style).\n::Capture the Flag leagues.\n\n*New Tamables for Legendary Tamers\n::Ridable mounts & creatures to fight with.\n::Rare Beetle.\n::Death Beetle.\n::Rare Rideables (Night Rideables).\n::Tameable creates that communicate/talk with you.\n\n*Factions\n::Fixed Atrophy point loss.\n::Battle for Serpents Hold.\n::Add Faction Wide Message every-time a Sigil is Stolen.\n::Added a Faction Veterinarian NPC to resurrect Faction Pets.\n\n*Justice Board\n::A point system for handing in murderers heads.\n::Custom Titles obtainable through the valor point system.\n::Other rewards enabled through the valor point system.\n\n*New Rares\n::Adding a new rare list for over-world mobs and spawn.\n::New daily/weekly/monthly Rares.\n::Allow for randomized spawns.\n\n*Powerscroll Changes\n::Tinkering Powerscrolls Added.\n::Lumberjacking Powerscrolls Added.\n\n*Champ Spawns\n::Added Rikktor & Lord Oaks\n::Added the Harrower.\n\n*Vendors\n::Gold Sink Vendor Items.\n::Platinum Vendor Items\n\n==New Age==\n[[image:Newage.jpg|thumb|300px]]\n'''New Age January 1st, 2015'''\n\n*Meta Pets\n::Obtain Dragon Eggs\n::Hatch your Dragon Egg into a Dragon Hatchling.\n::Level and gain experience with your Dragon.\n::Dragons are hued based on the color of the egg.\n::Meta Relics can be applied to your pet to give it abilities.\n\n*Meta Talismans\n::Obtain Dexxer Talisman.\n::Bond to your Dexxer of choice.\n::Obtain Relics of your choice to add to your dexxer.\n::Level each relic up, then add additional relics.\n::Relics to collect: Double Strike, Infected Wounds, Leech, Phase Shift, Quench, Recoil, Remedy, Tread.\n::Cannot be used in Player VS Player scenarios.\n::Cannot be used with Animal Taming OR Musicianship.\n\n*Wastelands\n::The Second Age Zoning.\n::Heal through poison enabled.\n::Instant weapon hits enabled​.\n::No mounts​.\n::No UO:R Abilities​.\n::Template Based (For now)​.\n::Housing Coming Soon​.\n\n*Factions\n::Added sigil bonuses.\n::Added sigil mapping.\n\n*Naval Warfare Reborn\n::Mouse Navigation added.\n::New cannon system.\n::New boat commands.\n::New Galleon ship added.\n::New Boat Speeds."
          }
        ]
      }
    }
  }
}