{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "1689": {
        "pageid": 1689,
        "ns": 0,
        "title": "Factions",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[image:faction_signup.png|thumb|625px|The faction sign up stones located in Britain]]\n__TOC__\n==Description==\n\n'''The faction system has been rewritten and replaced with [[Militias]]'''.\n\nThe Faction System is a broad game system designed to promote organized player conflict within the society of Britannia. The fundamental goal of the conflict is to provide a foundation for player conflict based upon meaningful and contextual combat and conflict-related interactions. The system is designed to encourage the inclusion of a wide array of player types through the use of game mechanics that appeal to a broad set of play-styles.\n\nFactions is a group PvP system. The system consists of 4 Factions, 2 good and 2 evil, struggling for control of Britannia\n\nTo join a Faction, visit the Faction signup stone area in central [[Britain]]. Choose one of the 4 Factions and you will be given a robe to show your allegiance and be able to join in the fight immediately.\n\n==Factions==\n===True Britannians===\n*They follow the teachings of Lord British and their base is Castle Britannia in [[Britain]].\n\n===Council of Mages===\n*A good matured faction that have issues following the teachings of Lord British. Their base is in the Parliament Building in [[Magincia]].\n\n===Minax===\n*They follows the evil mage Minax. They are based in a mountain stronghold north of [[Destard]].\n\n===Shadowlords===\n*This faction follows 3 demonic entities known as the Shadowlords. Their base is the [[Yew]] Crypts.\n\n==Leadership Roles==\nFaction players are eligible for public office within their faction. The three eligible offices are: the office of Faction Commander, Town Sheriff, and Town Finance Minister.\n\n===Faction Commander===\n*The office of Faction Commander is attained through an election process that occurs once per week. There is only one commander per faction. The Faction Commander may send a global command to all faction members twice per hour by simply saying, \"message faction\". Most commands made by the Faction Commander are decided through Faction and Town Stones.\n\n===Town Sheriff===\n*Appointed by the elected Faction Commander to control the placement of guards in a captured faction city. There is one sheriff per city. Town Sheriff may view the town/city treasury and may hire guards by simply saying, \"I am Sheriff\" out loud.\n\n===Town Finance Minister===\n*Appointed by the Faction Commander to manage taxes and resource vendors in a captured city. There is one finance minister per city. The Finance Minister may access the town/city treasury to change tax rates and may hire vendors by saying, \"I wish to access the city treasury\".\n\n==Commands==\n{| class=\"wikitable\"\n!Command\n!Function\n|-\n|[f\n|Used to communicate with your Faction.\n|-\n|[faction\n|Brings up the Faction gump, where all Faction related information is centralized.\n|-\n|showscore\n|Displays your Faction points.\n|-\n|[titles\n|Lets you access your titles and hues\n|-\n|I am sheriff\n|Allows the Sheriff to place guards.\n|-\n|I wish to access the city treasury\n|Allows the Finance Minister to control taxes and Faction vendors\n|}\n\n\n==Control Points==\nA point of power must be captured by a faction before it can be used by its members. To capture a point of power, you must stand in its immediate vicinity. The more of your faction in the immediate area, the faster it will capture. If there are opposing faction members in the area, the capturing process will slow or even reverse! Once a point of power has been captured by your faction, you may double click it to receive its bonus. A point of power bonus will last for 2 hours. Your skin will also hue your primary faction color to signify that you have a point of power bonus currently applied.\n{| class=\"wikitable\"\n!Point\n!Location\n!Bonus\n|-\n|Bloodshed \n|Near the west [[Britain]] bridge.\n|Makes your body unchoppable.\n|-\n|Knowledge\n|Near the west [[Trinsic]] gate.\n|Increases skill gain by 5%.\n|-\n|Power\n|Near [[Moonglow]] bank.\n|Increases your damage against monsters by 5%.\n|-\n|}\n==Ethics==\nFactions also include a good vs. evil system, in which \"Life force\" points and spells are gained for defeating opposing ethic members and special monsters. The True Britannians and Council of Mages are good, while Minax and the Shadowlords are evil. Winning in battle will also increase your rank and access to titles.\n{| class=\"wikitable\" style=\"margin-left: auto; margin-left: 0px;\"\n! scope=\"col\" colspan=\"3\"| Hero || colspan=\"3\"| Evil\n|-\n! Rank\n! Title<br>(hue 2049)\n! Influence<br>Points Required\n! Rank\n! Title<br>(hue 1100)\n! Influence<br>Points Required\n|-\n|1\n|Knight\n|0\n|1\n|Fiend\n|0\n|-\n|2\n|Knight-Errant\n|10\n|2\n|Bloodletter\n|10\n|-\n|3\n|Justicar\n|20\n|3\n|Abominable\n|20\n|-\n|4\n|Paladin\n|30\n|4\n|Destroyer\n|30\n|-\n|5\n|Prophet\n|40\n|5\n|Reaper\n|40\n|-\n|6\n|Templar\n|60\n|6\n|Chaos Bringer\n|60\n|-\n|7\n|Inquisitor\n|80\n|7\n|Dread Lord\n|80\n|-\n|8\n|Knight-Commander\n|100\n|8\n|Harbinger of Chaos\n|100\n|-\n|9\n|Holy Crusader\n|150\n|9\n|Death Stalker\n|150\n|-\n|10\n|Lightbringer\n|200\n|10\n|Evil Incarnate\n|200\n|-\n|11\n|Chosen One\n|300\n|11\n|Prince of Chaos\n|300\n|}\n\nEthic Spells have cast times and can be interrupted like normal spells, but do not require the spellbook to cast. Without an ethic spellbook you will need to say the words of power aloud. Each spell uses a certain amount of Life Force.\n\n*Ethic/Faction Sense\n**Tells you the general direction of enemy faction members and the number of them.\n**Range is based on your current lifeforce points gained from killing enemies of the opposing faction.\n**Holy keyword: Drewrok Erstok, Unholy keyword: Drewrok Velgo\n**Cost: 0, range is based on total life force accumulated\n*Holy/Unholy Items\n**Ethic members will be able to sanctify weapons, armor and clothing. This will hue them to your ethics primary hue. It will bless clothing but will only hue weapons and armor. If a weapon is used to attack a player that is not criminal outside of ethics, it will explode. If a non-ethic player tries to put on ethic clothing, it will explode. Ethic items are given increased durability but cannot be repaired. This goes for clothing as well.\n**Holy keyword: Vidda K'balc, Unholy keyword: Vidda K'balc\n**Cost: 100 life force, 10k gold\n*Holy Armament/Unholy Armament\n**Ethic members can further sanctify holy/unholy armor. For a moderate amount of lifeforce, you can bless armor and weapons for 90 minutes at a time. This will also make the weapon/armor the equivalent of a power weapon. Ethic weapon and armor bonuses will only work against members of the opposing ethic. Magic weapons and armor cannot be ethic blessed!\n**Holy keyword: Erstok Reyam, Unholy keyword: Velgo Reyam\n**Cost: 15 life force, Good: 3 Sapphires -- Evil: 3 Emeralds\n*Ethic Steed\n**You will be able to summon a dispellable ethic hued mount for a large amount of life force.\n**Holy keyword: Trubechs Yeliab, Unholy keyword: Trubechs Yeliab\n**Cost: 50 life force\n*Holy/Unholy Word\n**Resurrect yourself once per day for 100 life force.\n**Unusable in houses.\n**Holy keyword: Erst Oostrac, Unholy keyword: Velgo Oostrac\n**Cost: 100 life force\n*Holy Beast/Unholy Beast\n**Summon a pet wolf to aid you in battle for a short time\n**Holy keyword: Xen Vingir, Unoly keyword: Xen Vingir\n**Cost: 25 life force\n*Holy/Unholy Union\n**Resurrect an ally or pet for a moderate amount of life points.\n**Holy keyword: Vingir Yeliab, Unholy keyword: Vingir Oostrac\n**Cost: ???\n\nEthic runic weapons grant a tactics bonus equivalent to \"exceedingly accurate.\" They will explode when attacking any innocent creature or player.\n==See Also==\n*[http://www.uoforum.com/threads/factions-guide.55292/#post-366044 Factions Guide]"
          }
        ]
      }
    }
  }
}