{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "1470": {
        "pageid": 1470,
        "ns": 0,
        "title": "Fishing",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[File:Flag_fishing.gif|thumb]]\n__TOC__\n==Description==\nThe Fishing skill has many facets aside from simply fishing. Fishing off of coasts or docks will allow you to catch fish and various types of footwear. Although not very profitable, raw fishsteaks can be used to level [[Cooking]]. Once you've reached 75-100 fishing you are able to start fishing in deep waters and have a chance to get some awesome rewards from [[Whirlpool|Whirlpools]], [[Special Fishing Net]]s and [[Message in a Bottle]]. \n\nWith [[Power Scrolls|Power Scrolls]] you can raise your fishing up to 120. The benefits of higher fishing include:\n* Increased likelihood to pull up sea serpents and therefore greater chance of [[Treasure Map]], [[Message in a Bottle]] and nets\n* After 115+ Fishing, you have a chance to pull Osiredon when pulling up a [[Message in a Bottle]]\n* Higher chance of pulling loot at a [[Whirlpool]]\n\nIn the [[Naval Warfare Reborn]] expansion, fishing became more useful with the [[Whirlpool|Whirlpools]] that were added.\n\n==Usage==\nFishing couldn't be simpler. Grab a fishing pole, double click it and target the water. You can fish in any open sea, even from guard zones and docks. Wait until you've either failed or caught a fish and cast again. At some point, fish will stop biting in your area and you will be informed. Move a few tiles away and cast in another area. This makes it difficult to macro but is still possible since the biting fish will refresh at some point.\n\nUsing an exceptional fishing rod will improve your chance of pulling up serpents. Using a [[bent rod]] will pull up [[Message in a Bottle]] treasure chests without first hauling up a mountain of old boots.\n\n==Fishing Rewards==\nThe following items can be fished up:\n{| border=\"1\"\n! colspan=\"2\" style=\"background-color:#000; color:#FFF;\" | Fishing Skill: 0%\n|-\n| width=\"50px\" align=\"center\" valign=\"top\" | [[Image:Sandals.gif]]\n| '''Footwear''' \nOne of the worst things about fishing is the footwear that you will fish up. It's more common at lower levels and aren't worth selling.\n|-\n| align=\"center\" valign=\"top\" | [[Image:Fish purple.gif]]\n|'''Normal Fish'''\nThese come in four colors, their color does not make any difference. Fish can be chopped up with a bladed weapon to create Raw Fishsteaks. They can then be cooked using the [[Cooking]] skill.\n|-\n| align=\"center\" valign=\"top\" | [[Image:Hghly_peculiar_fish.gif]]\n| '''Highly Peculiar Fish'''\nRestores your [[Stamina]] by 10.\n|-\n| align=\"center\" valign=\"top\" | [[Image:Prized_fish.gif]]\n| '''Prized Fish'''\nRaises your [[Intelligence]] by 8 - 12% for 150 seconds.\n|-\n| align=\"center\" valign=\"top\" | [[Image:Truly_rare_fish.gif]]\n| '''Truly Rare Fish'''\nRaises your [[Strength]] by 8 - 12% for 150 seconds.\n|-\n| align=\"center\" valign=\"top\" | [[Image:Wondrous_fish.gif]]\n| '''Wondrous Fish'''\nRaises your [[dexterity]] by 8 - 12% for 150 seconds.\n|-\n! colspan=\"2\" style=\"background-color:#000; color:#FFF;\" | Fishing Skill: 65%\n|-\n| align=\"center\" valign=\"top\" | [[Image:Metal chest.gif]]\n| '''Sunken Treasure'''\nTreasure chests are fished up by the use of a [[Image:Waterstained_sos.png]] Waterstained SOS from a [[Message in a Bottle]]. The treasure chest fished up will have a randomly chosen level with contents similar to a level 1 to 3 [[Treasure Map|Treasure Map chest]].\n|-\n| align=\"center\" valign=\"top\" | [[Image:Ancient chest.gif]] [[Image:Ancient_chest_heartwood.png]]</br>[[Image:Ancient_chest_recovered_from_a_shipwreck.png ]]\n| '''Ancient Sunken Treasure'''\nThis chest is fished up by use of an [[File:Ancient_sos.png]] Ancient SOS. The chest contents are simlair to a level 4 [[Treasure Map|Treasure Map chest]] and is often colored white but have been reported to be found in other Hues as well! Inside these chests will also be a [[File:Fabled_fishing_net.png]] [[Special_Fishing_Net#Fabled_Fishing_Nets|Fabled Fishing Net]] that will summon up a large group of sea monsters.\n|-\n! colspan=\"2\" style=\"background-color:#000; color:#FFF;\" | Fishing Skill: 75%\n|-\n| align=\"center\" valign=\"top\" | [[Image:Map.gif]]\n| '''[[Treasure Map]]'''\nYou can fish up a level 1 or level 2 treasure map that is for a land adventure of very easy standards. Most new players can handle the spawns from a level 1 treasure map.\n|-\n! colspan=\"2\" style=\"background-color:#000; color:#FFF;\" | Fishing Skill: 80%\n|-\n| align=\"center\" valign=\"top\" | [[Image:Special fishing net.png]]\n| '''[[Special Fishing Net]]'''\nThese can be found as loot on sea serpents or in fished up treasure chests. When used, the net appears to throw out many fishing lines and a set of nasty monsters will spawn, consisting of Water Elementals, Sea Serpents, Deep Sea Serpents and Krakens. There is a chance for it to spawn in one of the 14 special colors.\n|-\n| align=\"center\" valign=\"top\" | [[Image:Big fish.gif]]\n| '''Big Fish'''\nA rare fish that one can use a [[Taxidermy Kit]] on to make a nice looking trophy which may be mounted in a player's home. When caught, a big fish will land in a players [[backpack]], unless there is no more room where it will land at the players feet. The weight is random, the heavier it is, the more rare. Both weight and the fisherman's name will be displayed on the trophy, but only if the fish weighed more than 20 stones.\n|-\n! colspan=\"2\" style=\"background-color:#000; color:#FFF;\" | Fishing Skill: 100%\n|-\n| align=\"center\" valign=\"top\" | [[Image:Bottle_of_ale.gif]]\n| '''[[Message in a Bottle]]'''\nAlso known as a MiB, when used it will turn into a Waterstained SOS [[File:Waterstained_sos.png]].\n|-\n| align=\"center\" valign=\"top\" | [[File:Ancient_sos.png]]\n| '''Ancient SOS'''\nIf you're very lucky you can fish up Ancient SOS's. Unlike OSI, these are fished up directly without the use of a Message in a Bottle.\n|-\n| align=\"center\" valign=\"top\" | [[File:Recipescroll.png]]\n| '''[[Ships|Ship Recipes]]'''\nIn the [[Naval Warfare Reborn]] expansion, 4 new ships were added into the mix. These ships are classified as Galleons and require a recipe to craft which are fished up.\n|}\n\n==Recommended Leveling==\n:0-50: Buy from NPC Fisher\n:50-100: Fish off of a dock, a few tiles from the shore. As your skill rises, fish a little bit further and further out.\n:85-100+: Deep sea fishing may help with gains. This requires a boat.\n\n==See Also==\n*[[Ships]]\n*[[Whirlpool]]s\n*[[Special Fishing Net]]s\n\n[[Category:Skills]]"
          }
        ]
      }
    }
  }
}