{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "2747": {
        "pageid": 2747,
        "ns": 0,
        "title": "Gardening",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Crafting]][[Category:Housing]]\n__TOC__\n==Description==\nGardening is a non-Skill based activity that any character can try. It allows you to grow many different types of decorative plants, some of which even produce valuable resources.\nThough potions that can only be brewed via Alchemy are required, these can often be purchased from vendors owned by other players.\n\n==Beginning==\n===Plant Bowl===\nThe first step towards the mastery of botany involves finding some Seeds and a Plant Bowl. The bowl can be purchased from NPC Provisioner Vendors and needs to be filled with dirt; there are two ways you can go about doing this:\nYou can locate a farmer's field (such as those that produce Cotton or Wheat) and use the bowl on the ground there. This is regular, non-fertile dirt.\nAnother way is to collect twenty units of Fertile Dirt to fill the bowl with. While it can take some time to collect, the use of this enhanced soil will speed the rate at which your plants are able to grow. You can find fertile dirt on Earth Elementals, Deep Earth Elementals and Whipping Vines. These are my primary source of Fertile Dirt collection.\nWith the bowl filled, it must next be watered. Two applications from a Pitcher of Water will be enough to take the dirt from \"hard\" to \"soft\". Be careful not to pour any more, or the dirt will become \"squishy\"!\n\nThe next step is to plant a Seed in the bowl. When this is done, it's fully prepared: You can now lock it down in your House, or place it in your bank box (plants will not grow in other places).\n\n==Growth Checks==\nEvery 24 hours - at the time you last maintained them - a plant will take a \"growth check\".\n\nThe check will fail unless it's been in a valid growing location (eg. locked down in a house) for at least 24 hours from the last server start (which happens once per day at a time dependent on your shard). A check failed in this way means nothing happens - the plant will not change for better or worse.\n\nTypically plants will advance one stage each growth check, though they will stay at the same level if they are unhealthy. Seeds planted in Fertile Dirt have a chance of advancing two stages in a single night. The current growth stage is written in the top left corner of the plant's display window, revealed by double clicking on it.\n\nPlants begin at stage one. When they reach stage seven, their true form becomes revealed. They can then pollinate and then be pollinated by other plants.\nThey will not advance beyond stage nine, though at this stage some will start to produce Seeds and other plant resources.\n\n==Plant Maintenance==\nDouble clicking on a growing plant will reveal a display relating to the plants age and health. Ideally, your foliage will remain \"vibrant\" throughout its life time, but if you fail to maintain your plants they will drop in health with each growth check until they ultimately wither and die.\nEach growth check can cause various ailments to affect your plant. These need to be dealt with prior to the next check in order to prevent them from actually harming it.\n\nThe five icons on the right hand side of the plant display reveal what needs to be done in order to keep your plants healthy. You may apply potions from Potion Kegs you are carrying in your pack by clicking their respective icons within the plant GUMP.\n\n===Infestation===\nOccurs randomly. If there is a yellow cross next to this, apply one Greater Poison potion; if red, apply two.\n\n===Fungus===\nOccurs randomly. If there is a yellow cross next to this, apply one Greater Cure potion; if red, apply two.\n\n===Poison===\nOccurs due to excessive poison potion applications. If there is a yellow cross next to this, apply one Greater Heal (not Cure!) potion; if red, apply two.\n\n===Disease===\nOccurs due to excessive cure potion applications. If there is a yellow cross next to this, apply one Greater Heal potion; if red, apply two.\nAlso apply up to two Greater Heal potions if a plant's health display reads as anything less then \"healthy\". Greater Strength potions may optionally be applied to reduce the rate at which a plant is affected by problems.\n\nFinally, take care to keep the soil \"soft\" by applying Pitchers of Water as need be. Depending on how many plants you wish to maintain at once, you might find the Water Trough house add-on to be invaluable.\n\n==Plant Breeding==\nWhen a plant reaches the seventh stage, it becomes capable of pollinating. Click the plant Reproduction icon in order to display the resource GUMP.\nClicking the Pollination icon will then give you a targeting cursor with which to apply pollen to another plant. Assuming that plant is also at the seventh stage it will become fertilized, and capable of producing new seeds after the ninth stage of growth.\n\nPlants may be used to pollinate themselves. Seeds grown by such plants will be titled according to the name of the parent. If a plant has not been pollinated by the time it reaches the ninth stage, it will automatically pollinate itself.\n\nPlants grown from Mutant seeds can not pollinate or be pollinated.\nFor details on which plants can be created via breeding, refer to this chart: https://www.uoguide.com/Plants_%26_Seeds#Plant_Breeding_Chart\n\n==Growing Plant Seeds/Resources==\nCertain plants are capable of producing more Seeds, as well as other resources. They will produce one seed and resource for every growth check after reaching the ninth stage, to a maximum of eight each. Note that only a few Plants produce resources, and some do not even produce seeds.\n\nSeeds/resources are extracted by clicking the appropriate icons in the plant resource GUMP, accessed via the plant Reproduction icon. Click to extract a seed from the plant. The amount of seeds available/remaining to be grown is displayed next to Resources icon.\n\nClick to extract a resource from the plant. The amount of resources available/remaining to be grown is displayed next to this icon.\nOnce a plant has produced its maximum number of seeds and resources, there is no point in maintaining it further.\nThere are three types of resources one can acquire from certain breeds of plants. The three types of resources that can be harvested(besides seeds) are Green Thornes, Red Leaves, and Orange Petals:\n\n===Green Thorns===\nUsed to spawn reagents in grassland areas, Vorpal Rabbits from farmland, Swamp Vines from swampland, and giant ice worms from snow areas.\n\n===Red Leaves===\nUsed to [[Inscription#Wax_Sealing_Books|Wax seal books]], which sets a written book to no longer be able to be written which preserving the original text from within.\n\n===Orange Petals===\nUsed to give a 5 minute immunity from [[Poisoning#Types_of_Poison|Greater Poison levels and below]].\n\n==Decorative Plants==\nOnce a plant reaches its ninth stage of growth, you may set it to \"decorative\" mode by clicking the red plus icon in the plant resource GUMP.\nOnce a plant is decorative, you may no longer bring up the display window, extract seeds/resources, or otherwise interact with it: On the other hand, it will no longer require maintenance. It becomes a simple item for display in your house, or perhaps for sale to other players.\n\n==Bunnky's Personal Opinion/Notes==\nGrowing plants is hell of a lot of fun. It's very rewarding on that 7th day when your plant has reaches its true form! The only thing Gardening requires is dedication. As long as you can water or take care of your plants once a day, you will find that it is very easy to do. Larger grow operations require a ton of time, and if you're growing for specific reasons (cross-pollination, seed production etc.), it's best to either remember what plant is for what, dedicate an area specifically for what you're going for, or take notes on what is where.\n\nGrowing for business is more rewarding on the social aspect of things. You're not gonna get rich off of them (except mutations, they sell for a lot), but you will make friends along the way, which is very rewarding in the long run. Meeting people and making friends is the prime reason I grow. Without that, I probably wouldn't do it, unless I was growing for personal decoration.\n\nLarge operations can be taxing on you, however. There are days when I need to tend to over 200 plants, and there is just some days I REALLY don't want to do that, but the motivation I get from my customers, and friends alike, keep me going. I wouldn't recommend large operations unless you have an Alchemist to make potions and kegs, and at least an hour a day. Keep in mind, this is just tending to plants, this does not include pollinating, resource gathering, or releasing for deco mode. While those are rather quick to do, they can add up when you have to gather 8 seeds from 100 plants, making trips back and forth to drop seeds off in your Seed Box. Oh and I didn't mention..\n\nGET A SEED BOX ASAP! Seed boxes hold up to 5000 seeds, and even with a max storage home, these can add up FAST.\n\n==Credit==\n* [https://www.uoforum.com/threads/guide-gardening.42560/ Bunnky]"
          }
        ]
      }
    }
  }
}