{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "3482": {
        "pageid": 3482,
        "ns": 0,
        "title": "Gem storage box",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Items]][[Category:Containers]][[Category:Housing]]\n[[File:Gem_Storage_Box_Preview.PNG|thumb|This is a special container that holds all of your gems, Portal Fragments, Event Fragments, Arcane Gems, and Power Crystals.]]\n\n__TOC__\n=Description=\nThis is a special container that holds all of your Gems, Portal Fragments, Event Fragments, Arcane Gems, and Power Crystals. This [[:Category:Containers|container]] will show the Name and Amount of all Gems and precious non-currency items. There is an area for you to specify how many of each of the item types you would like to withdraw, as well as, a deposit button that will automatically place any of these items from your backpack into the container! These stored items do not count against the lockdown/secure counts of the home and currently have a maximum storage capacity of 250,000 of each gem, 500 of each Portal or Event Fragment, and 2500 of each Arcane Gem or Power Crystal. The Gem Storage Box is dyable with a [[Dye_Tub#Furniture_Dye_Tub|Furniture Dye Tub]], however the freshly purchased color is Hue 1855 which cannot be restored once dyed.\n\n==Warning==\n* '''If this container is not locked down, and you choose to use an axe to destroy the item, all items within the container will be deleted!'''\n\n==Patch Notes==\n* [https://www.uoforum.com/threads/new-quality-of-life-items.110193/ new-quality-of-life-items.110193]\n* [https://uoforum.com/threads/8-7-8-0-quality-of-life-items-redo-and-more.110199/ 8-7-8-0-quality-of-life-items-redo-and-more.110199]\n\n=Retrieving Gems=\nThere is an area for you to specify how many of each of the item types you would like to withdraw, which is already set to zero by default. If you cannot carry the requested amount of items due to weight or item count limitations, all of the items that did not fit into your backpack will drop to your feet!\n\n[[File:Gem_Storage_Box_Menu.PNG|This is the Gem Storage Box Menu. There is an area for you to specify how many of each of the item types you would like to withdraw, as well as, a deposit button that will automatically place any of these items from your backpack into the container! These stored items do not count against the lockdown/secure counts of the home and currently have a maximum storage capacity of 250,000 of each gem, 500 of each Portal or Event Fragment, and 2500 of each Arcane Gem or Power Crystal.]]\n\n=Depositing Gems=\nThere are 3 ways you can deposit Gems into the Gem Storage Box:\n* You can drag and drop a single item on to the Gem Storage Box.\n* You can drag and drop a bag filled with acceptable items on to the Gem Storage Box.\n* There is a \"Deposit\" button that will automatically place any of these items from your backpack into the Gem Storage Box!\n\nIt is important to note that only stackable items, not combinable items, can be placed or deposited into the Gem Storage Container. This means that you can deposit 357 Rubies, because it is a stack of single splittable Gems. You can NOT deposit an incomplete (3/5) Portal Focus Fragment, a complete Portal Focus, or Event Fragments that have been combined into their 2 or 3 stack counter parts, as these items cannot be broken apart once combined:\n\n[[File:Gem_Storage_Box_Unnacceptable_Items.PNG|It is important to note that only stackable items, not combinable items, can be placed or deposited into the Gem Storage Container. This means that you can deposit 357 Rubies, because it is a stack of single splitable items. You can NOT deposit an incomplete (3/5) Portal Focus Fragment, a complete Portal Focus, or Event Fragments that have been combined into their 2 or 3 stack counter parts, as these items cannot be broken apart once combined!]]\n\n=Storage=\nThe Gem Storage Box's stored items do not count against the lockdown/secure counts of the home and currently have a maximum storage capacity of:\n* 250,000 of each gem\n* 500 of each Portal or Event Fragment\n* 2500 of each Arcane Gem or Power Crystal\n\nIt should be noted that while the items do not count against the lockdown/secure amounts, they do keep the weight of the objects inside.\n\n=Displayability=\nThe Gem Storage Box is a square box and thus would not benefit from the ability to turn this container using an [[Decorator_Tools#Interior_Decorator_Tool|Interior Decorator Tool]] or a [[Decorator_Tools#Royal_Decorator_Tool|Royal Decorator Tool]].\n\nThe Gem Storage Box is also dyable with a [[Dye_Tub#Furniture_Dye_Tub|Furniture Dye Tub]], however the freshly purchased color is Hue 1855 which cannot be restored once dyed. If a fresh [[Dye_Tub#Furniture_Dye_Tub|Furniture Dye Tub]] which comes as Hue 0 is used, the Gem Storage Box will appear white.\n\n=Located=\nThe Gem Storage Box is purchasable with [[Donation_Coin|4500 Donation Coins]] from [[Exotic_Item_Vendor|Nadine the Exotic Item Donation Vendor]] located in front of the [[Britain|West Britain Bank]]."
          }
        ]
      }
    }
  }
}