{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "1460": {
        "pageid": 1460,
        "ns": 0,
        "title": "Hiding",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[File:Flag_hiding.gif|thumb]]\n__TOC__\n==Description==\nHiding is a skill that allows you to vanish from both creatures and players. With sufficient hiding skill you can disappear whenever necessary. The chance of hiding successfully is directly equal to your hiding skill. Characters cannot hide close to creatures or players who are hostile towards them, at higher levels that distance from the creature or player is reduced. At 100 hiding, a character can hide in plain sight of a hostile monster or player 8 tiles away from them. Neutral monsters or players do not effect your chance of hiding, only hostile ones.\n\nSimilar to [[Detect Hidden]], [[Hiding]] is always successful within a player's home or when friended to a home. \n\nA player with proficient [[Snooping]] can snoop without being revealed. \n\nThe [[Stealth]] skill allows players to move while hidden. Unlike the Invisibility [[Magery]], hiding does not wear off over time. A player must be revealed with the spell or [[Detect Hidden]]. Equipping items, looting your own body or moving objects around in your backpack will not reveal you. Speaking, moving without stealth or casting a spell will reveal you.\n\n==Notes==\nSome powerful monsters such as Paragons have the ability to reveal, so be warned.\n\n==Recommended Leveling==\n:0-50: Buy from [[Thieves Guild]] NPC\n:50-100: Use the hiding skill\n\n==See Also==\n*[[Detect_Hidden|Detect Hidden]]\n*[[Stealth]]\n*[[Tracking]]\n\n[[Category:Skills]]"
          }
        ]
      }
    }
  }
}