{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "135": {
        "pageid": 135,
        "ns": 0,
        "title": "How to Prepare Yourself and Survive a PK Attack",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "__TOC__\n\n\n==Introduction==\nIn most instances of a typical Red on Blue player-killing event, the murderer relies on the notion that his prey will be:\n\n* Distracted while they farm\n\n* Weakened by outside forces (ie Monsters)\n\n* Ill equipped\n\n* Scared\n\n* Not properly trained in how to respond\n\n\nThe following guide is developed in order to help a New Adventurer to UO:Forever safely farm and escape from not only single, but multiple PKs.\n\n\n\n==Before Heading Out==\n\nBefore heading out to make some gold you need to make sure you have/understand a few things.\n\nFirst let's talk settings. Make sure you have \"Show Incoming Player Names\" activated, so that when a Red comes in from off-screen you see their name. Next make sure you have a Recall/Gate hotkey set up. Note that if you plan on using Gate, you may want to set up a macro to use a Gate Scroll for 100% success rate. Thirdly you will want to make sure that you have a safe-spot in your Runebook set to Default. Whether you want to make a macro to select your Runebook after recalling is up to you.\n\n\n\n==Equipment==\n\nNow that your settings are done, lets move on to equipment. You will need:\n\n* Trapped pouches (set to a hotkey) for escaping paralyze\n\n* Potions of all types (except maybe White/Blue) for Healing/Curing and especially Total Refreshes\n\n* Armor\n\n<small>'''''This is assuming that if you take Potions/Bandages/Regeants etc, that you have hotkeys set up to use them.'''''</small>\n\n\n\n==Spells to Know==\n\nIn addition to Recall/Gate their are 3 CRUCIAL spells + one extra you must know!\n\n* '''Magic Reflect''' - Reflects magic back at your attacker. Up to 8 circles of spells. IE. 8 - Explosion (6) = 2 circles left.\n\n* '''Reactive Armor''' - Converts your current AR value into a shield that absorbs melee damage and reflects it back as melee damage to your attacker.\n\n* '''Protection''' - Lasts 5 minutes and significantly reduces your ability to be interrupted during spell casts.\n\n\nAnd finally:\n\n* '''Arch Protection''' - Gives 11 Armor in an AoE range at GM Magery.\n\n\nThese 3 spells + Arch Protection can greatly help you survive attacks. Only 1 of the 3 spells can be active at the same time. Arch Protection is a separate sort of buff from the others.\n\n\nMagic Reflect/Reactive Armor can be removed with Dispel Field. This can only be Self-cast, costs no mana, and puts all 3 spells into cooldown.\n\n\n\n==Things to Remember==\n\n* Never \"check\" to see what a red does. Always assume ill intent\n\n* Beware of Blues. Some may be helpful, others can be scouts for Reds or Griefers\n\n* Never let mobs take your health low and let your guard down. PKs may come at ANY point and finish you off.\n\n* Think about your template. If you have no Wrestling as a Mage and a Dexer PK comes, put Protection on to help you recall without interrupts. If you're farming mobs that aren't spell casters you might want to just keep Magic Reflect on at all times.\n\n* Stay calm. In most situations you can escape. That's why you have this nice armor and potions ready. That's why you set your hotkeys. You're ready for this. You know what to do.\n\n[[Category:Guides]]"
          }
        ]
      }
    }
  }
}