{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "3715": {
        "pageid": 3715,
        "ns": 0,
        "title": "Identifying Sorting Shelf",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Items]][[Category:Containers]][[Category:Housing]]\n[[File:Identifying_Sorting_Shelf_Preview.PNG|thumb|This is a special container that identifies and sorts your unidentified weapons and armor.]]\n\n__TOC__\n=Description=\nThis is a special container that identifies and sorts your unidentified weapons and armor, powered by charges of from [[Inscription#Item_Identification_Scroll|Item Identification Scrolls]]. These scrolls can be crafted once the appropriate recipe has been found from loot drop in [[Treasure_Map|Treasure Maps]], [[Paragon_Chests|Paragon Chests]], and [[Champions]]. The Identifying Sorting Shelf can only accept unidentified weapon, armor, and [[Inscription#Item_Identification_Scroll|Item Identification Scrolls]], all other items will be dropped on the ground in front of the Identifying Sorting Shelf. Once items have been identified, they will stay sorted and bagged within the Identifying Sorting Shelf, however this will count against your lockdown/secure limits for your home. In order for you to be able to identify new items placed in the Identifying Sorting Shelf, the old items and bags will need to be removed. Using the Deposit All button will first take charges from your bag before taking items from your bag. The charges will always be taken first even if there are unacceptable items to identify when the \"Deposit All\" is pressed. The Current Number of Charges can be seen from the the Tooltips, these charges do not count against the total number of items within the Identifying Sorting Shelf. The Identifying Sorting Shelf can hold a maximum of 125 unidentified, anything beyond this point should drop the items to the ground in front of the Identifying Sorting Shelf. If the Identifying Sorting Shelf has at least 1 charge, it will automatically identify all current unidentified items within the Identifying Sorting Shelf and then sort them into the bagged groups based on [[Weapon_Modifiers|Weapon Modifiers]] or [[Armor_Modifiers|Armor Modifiers]]. The Identifying Sorting Shelf is dyable with a [[Dye_Tub#Furniture_Dye_Tub|Furniture Dye Tub]] and comes unhued, Hue 0, when purchased.\n\n==Warning==\n* '''If this container is not locked down, and you choose to use an axe to destroy the item, all items within the container will be deleted!'''\n\n==Patch Notes==\n* [https://www.uoforum.com/threads/new-quality-of-life-items.110193/ new-quality-of-life-items.110193]\n* [https://uoforum.com/threads/8-7-8-0-quality-of-life-items-redo-and-more.110199/ 8-7-8-0-quality-of-life-items-redo-and-more.110199]\n\n=Charging the Device=\nThe Identifying Sorting Shelf is powered by [[Inscription#Item_Identification_Scroll|Item Identification Scrolls]]. One [[Inscription#Item_Identification_Scroll|Item Identification Scrolls]] is one charge and is capable of up to identifying 125 items. \n\nThere are 3 ways you can deposit [[Inscription#Item_Identification_Scroll|Item Identification Scrolls]] into the Identifying Sorting Shelf:\n* You can drag and drop a single [[Inscription#Item_Identification_Scroll|Item Identification Scrolls]] on to the Identifying Sorting Shelf.\n* You can drag and drop a bag filled with [[Inscription#Item_Identification_Scroll|Item Identification Scrolls]] on to the Identifying Sorting Shelf.\n* There is a \"Deposit All\" button that will automatically place any of these [[Inscription#Item_Identification_Scroll|Item Identification Scrolls]] from your backpack into the Identifying Sorting Shelf!\n\nIf you successfully add Item Identification Scrolls manually to the Identifying and Sorting Chest, you will receive this message:\n\n[[File:Identifying_Sorting_Shelf_Manually_Adding_Charges_Of_Item_Identification_Scrolls.PNG|When you successfully add Item Identification Scrolls manually to the Identifying and Sorting Chest, you will receive this message.]]\n\nIt should be noted that when using the \"Deposit All\" button, the Identifying Sorting Shelf will attempt to charge itself from available [[Inscription#Item_Identification_Scroll|Item Identification Scrolls]] before moving unidentified weapons and armor into the Identifying Sorting Shelf. You will know this is the case when you see this message above the Identifying Sorting Shelf:\n\n[[File:Identifying_Sorting_Shelf_Automatically_Adding_Charges_Of_Item_Identification_Scrolls.PNG|There is a \"Deposit All\" button that will automatically place any of these [[Inscription#Item_Identification_Scroll|Item Identification Scrolls]] from your backpack into the Identifying Sorting Shelf. It should be noted that when using the \"Deposit All\" button, the Identifying Sorting Shelf will attempt to charge itself from available [[Inscription#Item_Identification_Scroll|Item Identification Scrolls]] before moving unidentified weapons and armor into the Identifying Sorting Shelf. You will know this is the case when you see this message above the Identifying Sorting Shelf.]]\n\n=Loading the Device=\nThere are 3 ways you can deposit unidentified weapons and armor into the Identifying Sorting Shelf:\n* You can drag and drop a single unidentified weapon and armor on to the Identifying Sorting Shelf.\n* You can drag and drop a bag filled with unidentified weapons and armor on to the Identifying Sorting Shelf.\n* There is a \"Deposit All\" button that will automatically place any of these unidentified weapons and armor from your backpack into the Identifying Sorting Shelf!\n\nIt should be noted that when using the \"Deposit All\" button, the Identifying Sorting Shelf will attempt to charge itself from available [[Inscription#Item_Identification_Scroll|Item Identification Scrolls]] before moving unidentified weapons and armor into the Identifying Sorting Shelf. If there items are loaded instead into the Item Identifying Sorting Shelf, then a message can be seen in the menu that states \"Deposited XX items\":\n\n[[File:Identifying_Sorting_Shelf_Menu_Items_Deposited.PNG|When the \"Deposit All\" button is used on the Identifying Sorting Shelf, a message can be seen in the menu that states \"Deposited XX items\".]]\n\n=Retrieving the Identified Items=\nIn order to successfully use the \"Identify Items\" button, you must meet the following criteria:\n* The Identifying Sorting Shelf must be locked down in a home you have access to use this Identifying Sorting Shelf from.\n* The Identifying Sorting Shelf needs to have at least 1 charge available.\n* The Identifying Sorting Shelf cannot contain any identified weapons or armor(or empty bags) from a previous attempt at identification. You will need to clear out the previous items from the Identifying Sorting Shelf before being able to identify new items.\n\nIf the criteria above is met, then a single charge will be used identify all items within the Identifying Sorting Shelf and this message will appear:\n\n[[File:Identifying_Sorting_Shelf_System_Message_Of_Identified_Items.PNG|If the criteria is met to successfully use the Identifying Sorting Shelf, then a single charge will be used identify all items within the Identifying Sorting Shelf and this message will appear as a system message.]]\n\nConfirmation of this message can also be seen in the Identifying Sorting Shelf Menu as well:\n\n[[File:Identifying_Sorting_Shelf_Menu_Message_Of_Identified_Items.PNG|If the criteria is met to successfully use the Identifying Sorting Shelf, then a single charge will be used identify all items within the Identifying Sorting Shelf and this message will appear in the menu.]]\n\nIt would be wise to make sure the Identifying Sorting Shelf is as full as possible in order to reduce costs of identifying all the items. The Identifying Sorting Shelf will not only identify the items, but will sort them into the bagged groups based on [[Weapon_Modifiers|Weapon Modifiers]] or [[Armor_Modifiers|Armor Modifiers]]. These bagged items will remain in the Identifying Sorting Shelf, but remember, you must remove them all if you plan on identifying more weapons and armor!\n\n=Common Errors=\nIf there is no charges you will receive the following message when attempting to identify your items:\n\n[[File:Identifying_Sorting_Shelf_Menu_Out_Of_Charges.PNG|The Identifying Sorting Shelf message that states the shelf is out of charges and is unable to identify any current items within the device.]]\n\nIf you attempt to put in an item that is already identified or is not an acceptable item, even from within a bag of other items, you will receive this message:\n\n[[File:Identifying_Sorting_Shelf_Warning_Container_Has_Unnacceptable_Items.PNG|If you attempt to place an item that is already identified or is not an acceptable item, even from within a bag of other items, into the Identifying Sorting Crate, you will receive this message.]]\n\nIf there is no more room inside the shelf(which has a maximum of 125 items) then you will receive this message:\n\n[[File:Identifying_Sorting_Shelf_Warning_Container_Cannot_Hold_More_Items.PNG|If there is no more room inside the Identifying Sorting Shelf, which has a maximum of 125 items, then you will receive this message.]]\n\nIf you have some containers of identified items still in the Identifying Sorting Crate, then you will receive this message:\n\n[[File:Identifying_Sorting_Shelf_Warning_Container_Still_Has_Containers.PNG|If you have some containers of identified items still in the Identifying Sorting Crate, then you will receive this message.]]\n\n=Storage=\nThe Identifying Sorting Shelf's stored unidentified items and bags will count against the lockdown/secure counts of the home and the Identifying Sorting Shelf currently has a maximum storage capacity of 125 items, like most containers in the home. The [[Inscription#Item_Identification_Scroll|Item Identification Scrolls]] do not count against this item capacity as they are used up in the processes of charging the device.\n\n=Displayability=\nThe Identifying Sorting Shelf can be turned to face south or east by dropping the item in those directions from your player or able to be turned while locked down with an [[Decorator_Tools#Interior_Decorator_Tool|Interior Decorator Tool]] or a [[Decorator_Tools#Royal_Decorator_Tool|Royal Decorator Tool]].\n\nThe Identifying Sorting Shelf is dyable with a [[Dye_Tub#Furniture_Dye_Tub|Furniture Dye Tub]] and comes unhued, Hue 0, when purchased.\n\n=Located=\nThe Identifying Sorting Shelf is purchasable with [[Donation_Coin|4500 Donation Coins]] from [[Exotic_Item_Vendor|Nadine the Exotic Item Donation Vendor]] located in front of the [[Britain|West Britain Bank]].\n\n=Contributors=\nThe community would like to thank the following brave adventurers who contributed their time and experiences for others to enjoy:\n* Colin\n* Sidnne"
          }
        ]
      }
    }
  }
}