{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "1723": {
        "pageid": 1723,
        "ns": 0,
        "title": "Infestations",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Guides]][[Category:Quests]][[Category:Player vs Monster]]\n__TOC__\n==Description==\nThe Infestation System is a new type of invasion system on UO:Forever that is being showcased with the Play Away the Plague event, where players do battle with a vicious Plague that is infecting monsters in various over-world locations throughout the realm!\n\nEssentially infestation will involves waiting for an announcement of an infestation, killing monsters at the infestation and collecting samples, then removing your own infestation by washing your hands, then turning in samples for possible rewards. \n\n<gallery class=\"center\" widths=\"250px\" heights=\"250px\">\nFile:Infest12.gif|'''Infestation'''<br />(click to preview)\n</gallery>\n\n'''Original Forum post for Infestations'''\n\nhttps://www.uoforum.com/threads/infestation-system-play-away-the-plague.108905/\n\n'''Guide for Infestations thanks to The Archaeologist'''\n\nhttps://www.uoforum.com/threads/guide-away-the-plague-a-guide-to-the-infestation-system.108926/\n\n==Plague Doctor==\nThe Plague Doctor holds the key to participating in the infestation system. When an Infestation is active the Plague Doctor will announce a general location of the event. This same general location can be produced in his menu by hitting Direction. For a more specific location you can pay 5000gp to gain a map to the Infestation. \n\nHe also has scoreboards for both Returned Items and Total Damage. You will return samples of the plague to him by clicking '''return sample''' and clicking the collected samples.\n\nIf there are no infestations active in the world he will announce as such. \n\n<gallery mode=\"packed\" class=\"right\">\nFile:Infestation2.PNG|Plague Doctor\nFile:Infestation3.PNG|Returned Item Scoreboard\nFile:Infestation4.PNG|Damage Scoreboard\nFile:Infestation5.PNG|Infestation Map\nFile:Infestation11.PNG|No Infestation active\n</gallery>\n\n==Infestation Zone==\nInfestation zones will be created with a couple different scenarios in which to interaction with them. \n\n'''Anti Tamer:''' This will cause the infected creatures to take reduced damage from pets, they will reflect damage, and deal increased damage to the pet.\n\n'''No Relics:''' This will cause various damage dealing relics to no longer trigger.\n\n'''PvP Zone:''' Everyone will be Grey in this infected area, basically a FFA zone like Bucs Den.\n\n'''No Mount:''' Everyone must dismount to enter the infected area.\n\n<gallery mode=\"packed\" class=\"right\">\nFile:Infestation6.PNG|Infestation Zone\n</gallery>\n\n==Handwashing Station==\nWhile fighting the hordes of infested you will start raising your own Plague-O-Meter. <span style=\"color:red\">'''After resurrecting you will no longer be poisoned by plague for 60 seconds.'''</span> '''\nIt is '''IMPORTANT''' that you immediately attempt to wash your hands to remove your plague as soon as you resurrect.\n\n<gallery mode=\"packed\" class=\"right\">\nFile:Infestation7.PNG|Plague-O-Meter\n</gallery>\n\nThe Hand-Washing Sink Menu gives tips for how to actually wash your hands, as recommended by Medical Doctors in real life. Please take the time to read these helpful tips. '''NOTE: You can not move away from the sink until 20 seconds are up, and the Plague is washed away.'''\n\n<gallery mode=\"packed\" class=\"right\">\nFile:Infestation1.PNG|Handwashing Station\n</gallery>\n\nThe Plague-O-Meter keeps track of how much Plague that a player has come into contact with during an Outbreak. The only way to reduce this percentage is to wash your hands.\n\nAs players become more Plagued, they will periodically become poisoned and will also have a harder time curing poison than normal, with the severity of these conditions both being directly related to a players Plague level.\n\n<gallery mode=\"packed\" class=\"right\">\nFile:Infestation9.PNG|Washing Hands\nFile:Infestation10.PNG|Yellow Plague-O-Meter\n</gallery>\n\n<span style=\"color:red\">'''It is HIGHLY RECOMMENDED that you DO NOT allow your Plague Level to go above 40%.'''</span> '''\n\n==Rewards==\nTurning in the '''viable sample of the plauge''' has a chance to yield rewards from the plague doctor.\n\n<gallery mode=\"packed\" class=\"right\">\nFile:Infestation8.PNG|Plague Sample\n</gallery>"
          }
        ]
      }
    }
  }
}