{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "24": {
        "pageid": 24,
        "ns": 0,
        "title": "Inscription",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Skills]][[Category:Crafting]][[Category:Overdrive]]\n[[File:InscriptionFlag.gif|thumb]]\n__TOC__\n=Description=\nInscription is a skill where you use scribe's tools to create spell scrolls, spellbooks, runebooks, and Bulk Order Deed books. It will require the reagents to cast the spell along with a blank scroll in order to create them. Scrolls can then be added into Spell Books that do not currently contain that spell. Inscription has [[Power Scrolls]] which allow the skill to be increased to 105, 110, 115 and finally 120.\n\n=Crafting=\n==Decoys==\nDecoys are items that players can use to deploy \"fake\" versions of an item. Decoys have a 75% chance of killing the thief [[Stealing#Theft|attempting a theft]] otherwise it will leave them with 1 hp. Most of these Decoys are triggered when an item type for the decoy enters the players backpack or the player is [[Snooping|snooped]] whom is currently carrying this type of decoy, with the exception of Weapon Decoys that trigger when you are disarmed.\n\nThese decoys are crafted with the Inscription skill and [[Forensic_Evaluation|Forensic Evaluation skill]] along with [[Thieves_Guild#Forgers_Paints|Forgers Paints]] and blank scrolls to craft.\n\nThere are four known Decoy types:\n* [[Power_Scrolls#Powerscroll Diversion|Powerscroll Diversion]]\n* Meta Relic Diversion\n* Relic Diversion\n* Weapon Diversion\n\n==Slayer Spellbooks==\n[[Scribe|Scribes]] crafting in the [[Britain Crafting Area]] will also have a 2.5% chance to create [[Slayer_Types#Slayer_Weapons|Slayer Spellbooks]] if they have 120 skill. Unlike normal spellbooks, crafted slayer spell books can be stolen - Look out for thieves!\n\n==High Charge Runebooks==\n[[Scribe|Scribes]] crafting in the [[Britain Crafting Area]] will also have a chance to create [[runebook|runebooks]] with more than 10 recall charges. The highest charge possible is 100. Runebooks with greater than 95 charges will have a different hue. At 100 Inscription, the chance will be around 1%. At 120 Inscription, it will be around 2%.\n\n==Item Identification Scroll==\n[[File:Identifying_Sorting_Shelf_Preview.PNG|right|This is a special container that identifies and sorts your unidentified weapons and armor.]]\nAn Item Identification Scroll can be used to [[Item_Identification|identify]] all items from within a container. Simply double click an Item Identification Scroll and target a chest within your bag or locked down container in your home, this will then attempt to use your [[Item_Identification|Item Identification Skill]] to identify one item in the container, if successful all unidentified items will become identified and the scroll will disappear along with 50 mana. If the [[Item_Identification|Identification Skill]] fails to identify the item, then the scroll will remain and the mana will not be used. It is worth noting that having a low [[Item_Identification|Item Identification Skill]] is suitable for use with these scrolls, as nothing is lost in the attempt to use them and the benefit of identifying 125 items at once may justify even 20 Skill points(20% chance to identify an item) on your particular build. Item Identification Scrolls can be crafted with the Inscription Skill after learning the crafting recipe, these require a [[Skill_Scroll|Skill Scroll]] to create which may be good for any low importance skill [[Skill_Scroll|Skill Scrolls]] you may have laying around.\n\nThe [[Identifying_Sorting_Shelf|Identifying Sorting Shelf]] is powered by Item Identification Scrolls. One Item Identification Scrolls is one charge and is capable of up to identifying 125 items. The [[Identifying_Sorting_Shelf|Identifying Sorting Shelf]] is purchasable with [[Donation_Coin|4500 Donation Coins]] from [[Exotic_Item_Vendor|Nadine the Exotic Item Donation Vendor]] located in front of the [[Britain|West Britain Bank]].\n\n=Copying Books=\nA lesser known, and probably even lesser used feature of Inscription is the ability to copy a book with writing in it to another blank or filled book. The books we are discussing are NOT spell scrolls, spellbooks, runebooks, or Bulk Order Deed books. These are [[Scribe]] or [[Provisioner|Provisioner NPC]] books(red, purple, brown) which can be purchased relatively cheap(or found as loot on various humanoid monsters). To copy a book, open and write something in the book title/author section or any pages within and then close it. Now directly use Inscription Skill from the skill list to create a target cursor, then target the book with writing and then target any other another book.\n\n=Wax Sealing Books=\nBy default, most [[Scribe]] or [[Provisioner|Provisioner]] NPC purchased books(red, purple, brown) can be written into and overwritten or changed by any player that has access to the book. You can use the growable item [[Gardening#Red_Leaves|Red Leaves]] to permanently \"seal\" a book, which will make the book no longer able to be changed or re-written. There are not many cases for this, however some players have spent a great deal of time and effort to create records/ledgers, as well as, even authored some self-published stories and this is the only way to be able to put them on display without the fear of nefarious agents attempting to alter an authors work!\n\n=Inscription Bonus=\nWhen a player has both 100 [[Magery]] and 100 Inscription, they will have enhanced Magical Reflection, Protection, and Reactive Armor spells. Increased Inscription skill from use of power scrolls will also be factored into the formulas below, but in PVP combat it is capped to GM scribe bonus.\n\n{| class=\"wikitable\"\n! Spell\n! Bonus\n|-\n| Magic Reflection\n| Scales with the inscription skill: (((Magery + Inscription) / 100) * 7) + 1\n|-\n| Protection\n| 75% ignore disrupt chance instead of 25%\n|-\n| Reactive Armor\n| increase in amount of hits taken before becoming null\n|}\n\n'''NOTE: Capability not available on Overdrive'''\n\n=Recommended Leveling=\n:0-50 Train from NPC\n:40 – 50 High 4th level scrolls or low 5th level scrolls. Recall scrolls are good as players will buy these.\n:50 – 60 Scribe high 5th level. Mark scrolls are good because again players will buy these.\n:60 – 70 High 6th level and low 7th level. Gate travel scrolls are good, as players will buy these.\n:70 – 80 7th and low 8th level spells. These scrolls can be sold to NPC vendors.\n:80 – 120 Energy Vortex scrolls. These are sell-able in bulk to players.\n\n==General Notes==\nIf you do not have the resources to get to 50 by creating [[Recall|Recall scrolls]], then you can go to a [[Scribe]] or [[Provisioner|Provisioner NPC]] and buy any of their books(red, purple, brown). Open and write something in the book title/author section or any pages within and then close it. Now directly use Inscription Skill from the skill list to create a target cursor, then target the book with writing and then target any other another book. You should be able to gain until 50 by copying the book back and fourth.\n\n=Overdrive Notes=\nThe following changes to the Inscription skill are ONLY on [[Overdrive|Overdrive Server]]:\n* Magic Reflect on Overdrive reflects full spells and does not reflect a set amount of spell circles. EX: With double magic reflect activated, you could reflect 2 magic arrows or 2 flamestrikes, or 1 magic arrow and 1 flamestrike. It does not go by spell circles.\n* Inscription does not give any passive bonuses to buffing spells. The only PvP advantage GM Inscription provides is the double reflect capability.\n\n=See Also=\n*[[Magery]]\n*[[Item_Identification|Item Identification]]"
          }
        ]
      }
    }
  }
}