{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "3651": {
        "pageid": 3651,
        "ns": 0,
        "title": "Jousting",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Events]][[Category:Player Run Events]]\n[[File:Jousting_Field.PNG|425px|thumb|right|This is the Community Island Jousting Field where brave knights challenge each other with Jousting Lances in order to win Honor for their houses.]]\n__TOC__\n\n=Description=\nThis is the Jousting Event where brave knights challenge each other with Jousting Lances in order to win Honor for their houses. The tournament event is simple and almost everyone can participate as long as they have met the base requirements to use a [[Jousting#Lance|Jousting Lance]].\n\n=How to Play=\nThis is a tournament style event where 2 combatants will run at each other, while staying their lane, and meet in the middle to deliver a Jousting Blow. The Combatants will then continue down the lane until they have touched the other side of the lane, turn around and then meet in the middle again. This will continue until one combatant yields or dies in the field, the winning combatant will continue on to the next contender until the last standing combatant is named Champion!\n\n==Rules==\n[[File:Jousting_Properly_Equipped_Preview.PNG|thumb|The proper equipment to enter into a Jousting competition. Exceptional Iron Platemail at 52 Armor value and a Lance on the back of a mount!]]\n\n1. A Jouster should have the proper equipment before entering a Joust. This should be Exceptional Iron Platemail at 52 Armor value and a Lance.\n\n2. A Jouster should have the Proper Skills before entering a Joust. This should be at least 60 Skill in a melee fighting skill such as [[Fencing]], [[Mace_Fighting|Mace Fighting]], [[Mace_Fighting|Mace Fighting]], or [[Swordsmanship]]. [[Archery]] and [[Wrestling]] do not count as effective skills to use a Lance.\n\n3. A Jouster should have the Proper Stats before entering a Joust. A Lance requires 95 Strength to wield, however Jousters should not go beyond 100 Strength to have a fair joust.\n\n4. A Jouster should be on the back of a mount before Entering a Joust.\n\n5. A Jouster should completely clear their lane, meaning that the jouster should run from one end to the other and turn around on the last tile to run back down their lane. The intended area of to perform a jousting hit should be in the center of the lanes and met by both parties in the Joust.\n\n==Arena==\nWhile each Jousting Arena is unique to their location, they all share a common setup. There must be a closed off area where 2 lanes exist for the combatants to run back and forth, generally at least 12 tiles in length. There needs to be a place that the Event Runner can speak to the combatants in order to instruct them in the event of any issues during the Jousting, as well as give the starting signal to begin the Joust. The Jousting Lanes need to have an entrance and exit on the longer sides so that the Jousters do not accidently leave the Arena during a joust. As it is expected, but not required, to be on a mount during your Joust, there is generally a Stablemaster nearby to purchase horses or ridable llamas for the event, as well as, a Healer to keep the event moving smoothly. The following images are from the [[Community_Island#Community_Events|Community Island Jousting Arena]].\n\n<gallery widths=300px heights=200px>\nFile:Jousting_Field.PNG|This is the Community Island Jousting Field where brave knights challenge each other with Jousting Lances in order to win Honor for their houses.\nFile:Jousting_Field_Multiple_Arenas.PNG|This is the Community Island Jousting Field with Multiple Arenas where up to 4 Lanes can challenge 8 brave knights at one time!\nFile:Jousting_Stables.PNG|The Community Island Jousting Stables where horses and ridable llamas can be purchased for the Jousting event!\n</gallery>\n\n==Lance==\n[[File:Jousting_Sir_Keldorn.PNG|thumb|Sir Keldorn of the Community Island Jousting Arena.]]\n\nThe Lance is a melee weapon that can be purchased from special vendors for 20,000 gp. They require at least 95 Strength to wield and in order to use them effectively you need 60 skill in a melee fighting skill such as [[Fencing]], [[Mace_Fighting|Mace Fighting]], [[Mace_Fighting|Mace Fighting]], or [[Swordsmanship]]. [[Archery]] and [[Wrestling]] do not count as effective skills to use a Lance.\n\n<gallery widths=300px heights=200px>\nFile:Jousting_Lance_Sir_Keldorn_Preview.PNG|The Lance available from Sir Keldorn of the Community Island Jousting Arena. These are 20,000 gold pieces and require 95 Strength to wield. In order to use them effectively you must have a melee skill, Archery and Wrestling do not count.\nFile:Jousting_Lance_Gold_Sink_Preview.PNG|The Lance available from Sasha from West Britain Bank Gold Sink Vendors. These are 20,000 gold pieces and require 95 Strength to wield. In order to use them effectively you must have a melee skill, Archery and Wrestling do not count.\n</gallery>\n\nIf you attempt to use a Lance without the necessary skill you will receive the \"Mercy Pass\" message on anyone wielding a Lance to indicate that the attempt failed and no damage will be applied:\n\n[[File:Jousting_Mercy_Pass_Message.PNG|The Mercy Pass message that appears when you attempt to use a Lance without the required combat skills of at least 60 in Fencing, Mace Fighting, or Swordsmanship.]]\n\n=Contributors=\nThe community would like to thank the following brave adventurers who contributed their time and experiences for others to enjoy:\n* Skye\n\n=See Also=\n*[[Community_Island|Community Island]]"
          }
        ]
      }
    }
  }
}