{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "2312": {
        "pageid": 2312,
        "ns": 0,
        "title": "Layering",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "__TOC__\n\n==Description==\nThe layering deeds on the donation vendor are for putting a wearable item in a specific slot to you can wear multiples of the same type of wearable. Please keep in mind, you cannot just put anything in a different layer and expect it to come out perfect like you want - it doesn't work like that. Layering is very tricky and here are some common questions we have received. Now keep in mind, you might have to sacrifice your neck slot for a gorget if you really want to max out on looking as fabulous as possible\n\n==Order of Layers==\nAn layer order list is provided before - Whatever is higher in the list will be on top of whatever is lower in the list. Once you have things layered, your wearables might not go on. You need to put things on in order. Basically the general rule is put the wearables on in the slot order above. Layering can be extremely confusing and it is not a matter of just putting things in a different layer slot and have them all work like you expect.\n\n* Cloak\n* Helm (minus anything that would normally have AR - bone masks for example. However, actual masks work here)\n* Earings\n* OuterTorso(robe)\n* Bracelet\n* MiddleTorso(Tunic, doublet, etc.)\n* Ring(on top of MiddleTorso on paperdoll, but below it in game)\n* Neck\n* InnerTorso(Chest armor)\n* Gloves\n* Arms\n* Shoes\n* Shirt\n* Pants\n\n==FAQ==\n===I want to wear my deer/bear mask with a bone mask. How do I do this?===\nKeep the bone mask in the helm layer slot. Put the deer/bear mask in the bracelet slot.\n\n===I want to put a sash over my robe. How do I do this?===\nPut the sash in the earrings slot.\n\n===I want to wear my sandals over top of boots. How do I do this?===\nPut the sandals in the ring slot.\n\n[[Category:Guides]]"
          }
        ]
      }
    }
  }
}