{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "1461": {
        "pageid": 1461,
        "ns": 0,
        "title": "Lockpicking",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[File:Flag_lockpicking.gif|thumb]]\n__TOC__\n==Description==\n[[Lockpicking]] is used for opening treasure chests attained from [[Treasure Map]]s, opening [[Paragon Chests]] and opening Dungeon Chests. It's a profitable and useful skill due to the high popularity of the mentioned chests. [[Lockpicking]] is essential for any avid [[Treasure Map|Treasure Hunter]]. Lockpicking pairs well with [[Cartography]]. Be careful after picking a lock, many chests can be trapped and it's suggested that you open them with the Telekinesis spell at a safe distance.\n\n==Usage==\nUsing [[Lockpicking]] requires you to double click on Lockpicks , target the container you are trying to open, after a moment you'll hear a clicking noise or you'll fail. Lockpicks are consumable and will be used, so be sure to carry enough of them. As mentioned above, cast Telekinesis or [[Remove Trap]] to open chests prior to double clicking them to avoid accidental death. Lockpicks are purchased from tinkers.\n\n==Recommended Leveling==\nIt is strongly advised that you lock [[dexterity]] at 10 before training [[Lockpicking]]. [[Dexterity]] grants a passive bonus to the [[Lockpicking]] skill, so when you reach level 94.7 you will be unable to gain any higher from tinker made boxes. This is not required but can save you the hassle of a hard point.\n\n:0-50: Buy from NPC ([[Thieves Guild]] Master)\n:50-76: A Level 50 Tinker Skill Locked Box\n:76-95 A Level 95 Tinker Skill Locked Box\n:95-100 Dungeon Chests or [[Paragon Chests]]\n\n==See Also==\n*[[Treasure Map]]\n*[[Cartography]]\n\n[[Category:Skills]]"
          }
        ]
      }
    }
  }
}