{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "1675": {
        "pageid": 1675,
        "ns": 0,
        "title": "Meta Pets",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[image:dragon_egg.png|frame|A Dragon Egg]]\n__TOC__\n==Description==\nMeta Pets are special bonded pets which become stronger as they gain levels killing creatures and were first introduced in Publish 4 on September 5th, 2014, starting with Meta Dragons. There are currently five [[Meta Pets|Meta Pet]] types: Meta Dragon, Steed, Spider, Crab and Mantis. \n\nMeta Pets can learn abilities from Meta Relics which, in the case of Meta Steeds and Dragons, can be obtained from [[Random Dungeon Adventure|Random Dungeon Adventures]], invasion rewards and monster of the month drops. Meta Dragons and Spiders can hold a total of four Meta Relics at once. Meta Steeds can only hold three relics - A small trade-off for being able to also mount the beastly creature! More information can be found in [[Meta_Pets#Meta_Relics|Meta Relics]].\n\nEach relic ability has different effects, cool downs and application rates. The abilities will only work against untamed creatures and they will not be usable against players or other tamed creatures. Meta Skills can be applied with a Meta Stone. Purchased either from the gold sink vendor or from [shop using donation coins.\n\n[[image:MetaStone3.PNG|Meta Stone]]\n\nMeta Pets level up by killing creatures. All damage done to a creature is saved and then given out to damaging Meta Pets upon their death. Experience cannot be gained while in a house. A creature cannot give total experience greater than its maximum hit points. This means that you cannot farm the same creature for an indefinite amount of time. The owner of the Meta Pet must be in the general vicinity of the pet for it to gain experience. If a Meta Pet dies, it will lose experience equal to the amount of remaining hit points on the creature it was fighting. If the Meta Pet is transferred to another player, all experience progress on the current level will be lost.\n\n<span style=\"color:red\">'''Meta pet owners will be required to meet the taming requirement of the next pet level for the pet to evolve to that level. Example: 120 taming is required to evolve a level 6 dragon to level 7. A level 7 dragon can be evolved by a 120 tamer and later transferred to a 115 tamer, though a fresh level 7 will struggle to listen.</span>\n\n===Protecting Your Pet===\n<span style=\"color:red\">'''Warning:'''</span> Meta Pets are very attractive targets for pet trappers who will try to lure your pets to their house to trap it. Depending on the level of your pet, you will need to pay a fee to regain access to the pet. For more information please see the [[Protecting Your Pets]] page.\n\n==Meta Stone==\n[[File:metastonegump.png|right|100px]] The Meta Stone is an item purchased from the [[Wearables Vendor]] or the [[Unique Wares Vendor]]. At time of writing, it cost 3 million gold pieces from the vendor. It is used to apply Meta Relics to your Meta Pet, as well as view it's level progress of Relic Skills making it an essential part of Meta Pet trainer's toolkit.\n\nThe Meta Stone will also display the taming requirement of the Meta Pet. This taming requirement can drop 0.5 every time the Meta Pet XP \"rolls over\" at max level. For example, a fresh Level 7 Meta Dragon will have a taming requirement of 120. If you gain another 2 million XP on the Meta Dragon, its XP will roll over and the taming requirement will be reduced by 0.5. After 8 roll overs, the taming requirement will no longer reduce. The lowest taming requirement for a Level 7 Meta Dragon is therefore 116.\n\n==Meta Relics==\nMeta Relics are add-ons for Meta Pets. Relics are dropped as rare loot by a variety of bosses around the world. They are one-time use only - once applied to a meta pet, the relic is gone forever but lives on as a skill for the meta pet. Meta Relics can never be removed, however they can be disabled. If a Meta Relic is disabled, all progress in that Relic's skill will remain saved, and the Relic will be shown in the \"Disabled Relics\" area. Returning the Relic to the Meta Pet can be done by clicking the minus sign again, and all of the previous skill will return to the Meta Pet.\n\n[[File:Meta_Pet_Relic_Removal.gif]]\n\n\n[[Meta_Talismans#Aesthetic_Relics|Aesthetic Relics]] can now be applied to pets as well.\n\n\n\n==Relics and Abilities==\nAbilities are applied to the talisman by finding relics at events, dungeon bosses, monster of the month spawns and at the [[Dungeon_Bosses#Arch_Demon|Arch Demon]] and Lich Khan dungeon bosses. Each talisman has a maximum of four relic slots and aesthetic relic slots. The aesthetic slots are usable at any time and you get relic slots at levels: 1, 4, 7, 10.\n\n[[File:tread_relic.png|Example Relic]]\n\nThere are currently four or five unique relics for each type of talisman which are detailed further below. Each relic has ten levels and leveling may lower the skill cooldown, raise the chance to activate, or provide other ability specific bonuses. These abilities typically have a random chance to activate on damage and a cooldown to only allow them to be activated at certain intervals.\n\nTo add a relic to your talisman, double click the relic and then select your talisman. Be sure to stand in a safe place while doing this as relics can be stolen!\n\nWith the recent change you are now able to swap your active relics, double click your Meta Talisman and then click on the [ - ] symbol next to the relic you wish to remove from the active relic list (highlighted in yellow in screenshot). Once you have an open unused slot available you will be able to hit the [ - ] symbol next to relics in the inactive list to make it an active relic (highlighted in red in screenshot). Keep in mind if you swap frequently in a short amount of time it will put it into cooldown.\n\n[[File:RelicSwap2.PNG|275px|Relic Swap]]\n\nNote that you will have to be quite lucky for all your talisman's relics drop for you. You may need to frequent the [http://www.uoforum.com/forums/buying.14/ Buying] and [http://www.uoforum.com/forums/selling.15/ Selling] forums to find your relics. Keep in mind that certain relics are more popular than others and can therefore be expensive to purchase. Being part of a larger guild can also provide a useful avenue for getting relics at a reduced rate.\n\n===Relic Qualities===\nRelics will have 4 qualities; Crumbling, Flawed, Perfect, and Flawless(currently not yet available!). Relics will now have separate Maximum Level Thresholds based on their Quality Level, and can be used to increase to a current maximum level of an equipped relic, and now be used with different [[Power Scrolls]] amounts based on quality level on [[Meta_Talismans#Relic_Fragments|Relic Fragment Systems]]. The [[Slayer_Armor#Transmutation_Cube|Transmutation cube]] can be used to convert 8 Crumbling Relics of the '''SAME QUALITY TYPE''' into a Flawed Relic version, however be extremely careful to make sure that all 8 Crumbling Relics are of the same quality and belong to the same type of Relic otherwise '''YOU WILL LOSE ALL ITEMS IF THE RECIPE FAILS!!!'''.\n\nThe Known Relic Qualities are:\n* '''Crumbling Relic''' - Will increase a current maximum relic level by 1, up to level 6. Can be used as 1 [[Power Scrolls|Power Scroll]] worth of points on relic fragment systems.\n* '''Flawed Relic''' - Will increase a current maximum relic level by 2, up to level 10. Can be used as 10 [[Power Scrolls]] worth of points on relic fragment systems.\n* '''Perfect Relic''' - Will increase a current maximum relic level to 10, and will not go beyond level 10. Can NOT be used as points on relic fragment systems.\n* '''Flawless'''(not currently yet available!) - Will increase a current maximum level by 1. Can only be used from level 10 to level 15. Can be used as 20 [[Power Scrolls]] worth of points on the relic fragment system.\n\n[[File:MetaTalismanRelicQualitiesCrumbling.PNG|An Imbueologist Relic of Crumbling Quality.]]\n[[File:MetaTalismanRelicQualitiesFlawed.PNG|An Imbueologist Relic of Flawed Quality.]]\n\n[[File:MetaTalismanRecyclerRelicCrumblingAdd.gif|Meta Talisman Relics can be used to add to the maximum level of your current relic. This is a Recycler Relic of \"Crumbling Relic\" quality being applied to the Antique of the Artisan. Here the Maximum level is being increased from 2 to 3.]]\n\n===Relic Fragments===\n:'''Small Relic Fragments'''\n::Small Relic Fragments can be used to build Relics of [[Meta_Talismans#Relic_Qualities|Crumbling Relic Quality]]. Small Relic Fragments will have a specific Relic they originally belong to and start with 1 point in their Relic Fragment System. These Small Relic Fragments can be used to absorb [[Power Scrolls]] to add 1 point to their Relic System, or absorb Relics for points listed in [[Meta_Talismans#Relic_Qualities|Relic Qualities]]. \n\n::[[File:MetaTalismanRelicQualitiesSmallFragment.PNG|An Imbueologist Relic Small Relic Fragment.]]\n\n:'''Relic Fragments'''\n::There are other Relic Fragments can be purchased from the Gold Sink Vendor that can be used with the [[Meta_Pets#Meta_Spider|Meta Spider Pet]], [[Meta_Pets#Meta_Crab|Meta Crab Pet]], or [[Meta_Pets#Meta_Mantis|Meta Mantis Pet]]. Relic Fragments will have a specific Relic they originally belong to and start with 0 points in their Relic Fragment System. These Relic Fragments can be used to absorb [[Power Scrolls]] to add 1 point to their Relic System, or absorb Relics for points listed in [[Meta_Pets#Relic_Qualities|Relic Qualities]]. Each Relic Fragment may have a different total amounts to reach before they can be applied to a [[Meta_Pets#Meta_Spider|Meta Spider Pet]], [[Meta_Pets#Meta_Crab|Meta Crab Pet]], or [[Meta_Pets#Meta_Mantis|Meta Mantis Pet]] and you can read more about the relic totals in their respective sections.\n\n::[[File:MetaTalismanRelicNecrosisRelicFragment.PNG|A Necrosis Relic Fragment and Brood Relic Fragment.]]\n\n===Relic Changes===\nContent releases that has come after the 10th Anniversary has brought some changes to the way relics gain levels, where they come from, and new functionality such as combining different relics together. This is a community driven FAQ to cover all the changes related to a Major Patch releases:\n* January 25th, 2023: [https://www.uoforum.com/threads/8-7-0-0-major-patch-crafter-talisman-relic-update-housing-biowners-and-more.110164/ 8.7.0.0 - Major Patch - Crafter Talisman, Relic Update, Housing Biowners and more]\n* February 6th, 2023: [https://www.uoforum.com/threads/8-7-2-0-classic-housing-upgrade-talisman-dye-and-crafting-achievement-fixes-more.110168/ 8.7.2.0 - Classic Housing upgrade, Talisman Dye, and Crafting Achievement Fixes.. & More]\n* February 26th, 2023: [https://www.uoforum.com/threads/server-update-8-7-3-0-tons-of-talisman-relic-updates-rogue-talisman-provisional-update-and-more.110169/ Server update 8.7.3.0 - Tons of Talisman Relic updates, Rogue Talisman Provisional update, and more.]\n* March 5th, 2023: [https://www.uoforum.com/threads/8-7-4-0-notification-updates-minor-fixes-and-tons-of-extra-backend-logging.110178/ 8.7.4.0 - Notification updates, minor fixes, and tons of extra backend logging.]\n\n====What changed about relics?====\nRelics now have four levels: Crumbling, Flawed, Flawless (not yet released), and Perfect. Perfect relics are those which are unchanged from the recent update...spider, archery, and rogue relics.\n\n====What do the different levels mean?====\nWhen a relic is applied to a talisman or pet, it starts with zero experience and a maximum level cap. That level cap is determined by the level and number of relics you have applied.\n*Crumbling relics add +1 to the relic level cap, up to a max of level six.\n*Flawed relics add +2 to the relic level cap, up to a max of level 10.\n*Flawless relics will add +1 to the relic level cap, from level 11 to level 15 (not currently available).\n*Perfect relics will add +10 to the relic level cap, to a max of level 10.\n\nRelics added must be of the same type. For example, if you have a tread relic with a level cap of 2, you need to add more tread relics to increase the level cap.\n\nRelics can gain experience past their level cap, but will not exceed their current max. For example, if your relic is at 2/2 and says 0/1600 xp, you can still earn xp until it says 1600/1600 but cannot proceed to the next level until you have applied another relic to increase your cap to 2/3.\n\n====I hear that relics will be able to go as high as level 15. How do I do that?====\nThat is a separate change coming at an undetermined date in the future. When that happens, flawless relics will be added which will increase your relic level cap by +1 and is the only relic type that can be used to increase level caps beyond 10.\n\nOnce that change is implemented in the future, a typical progression would look like this: six crumbling relics to have a level cap of six, two flawed relics to increase the level cap to 10, then five flawless relics to reach a final level cap of 15.\n\n====If I already had a relic applied to my talisman before this update, did anything change?====\nNo. If you already had a relic applied to your pet or talisman before this update, you already had a relic level cap of 10 and that did not change. This change only applied to relics that were not already applied to a pet or talisman.\n\n====Do the new relic types also raise my current level?====\nNo. The relics simply increase the level cap of the relic, they do not replace the experience that has to be earned to achieve each level.\n\n====Which relic types can be used to charge spider relics?====\nAny! Now both pet and talisman relics can be used to charge spider relics. Crumbling relics are equivalent to 1 [[Power Scrolls|Power Scroll]], flawed relics are equivalent to 10 [[Power Scrolls]], flawless relics will be equivalent to 20 [[Power Scrolls]], perfect relics (spider, archery, rogue) cannot be used to charge spider relics.\n\n====How do I find these relics?====\n:'''Craft Relics'''\n::[[Bulk_Order_Deed#Rewards|Bulk Order Deed turn-ins]] will have a chance to drop [[Meta_Pets#Relic_Fragments|small relic fragments]] for the [[Antique_of_the_Artisan|Artifact of the Artisan]]. The character turning in the [[Bulk_Order_Deed|Bulk Order Deed]] must have the [[Antique_of_the_Artisan|Artifact of the Artisan]] equipped to have a chance at [[Meta_Pets#Relic_Fragments|small relic fragments]]. The chance of getting a [[Meta_Pets#Relic_Fragments|small relic fragment]] from [[Bulk_Order_Deed#Rewards|Bulk Order Deed turn-ins]] is about 1%.\n\n::[[Meta_Pets#Relic_Fragments|Small relic fragments]] can be combined with additional [[Meta_Pets#Relic_Fragments|small relic fragments]] to create a [[Meta_Pets#Relic_Fragments|crumbling relic]]. Each fragment is worth one point and a total of 12 need to be combined to make the [[Meta_Pets#Relic_Qualities|Crumbling Relic]]. [[Power_Scrolls|Power scrolls]] and other relics can also be added to a [[Meta_Pets#Relic_Fragments|small relic fragment]] to create a [[Meta_Pets#Relic_Qualities|Crumbling Relic]]. [[Power_Scrolls|Power scrolls]] are equivalent to one point, [[Meta_Pets#Relic_Qualities|Crumbling Relics]] are equivalent to 1 point, and [[Meta_Pets#Relic_Qualities|Flawed Relics]] are worth 10 points. [[Meta_Pets#Relic_Qualities|Perfect Relics]] cannot be combined with small relic fragments.\n\n::When [[Meta_Pets#Relic_Fragments|small relic fragments]] are combined, the final [[Meta_Pets#Relic_Qualities|Crumbling Relic]] that is created will match the fragment which you double clicked. For example, if you double click [[Antique_of_the_Artisan#Recycler|a small Recycler Relic fragment]] and target 11 [[Antique_of_the_Artisan#Imbueologist|small Imbueologist Relic fragments]], the resulting [[Meta_Pets#Relic_Qualities|Crumbling Relic]] will be a [[Antique_of_the_Artisan#Recycler|Recycler Relic]] type.\n\n:'''Other Relics:'''\n::[[Monster_of_the_Week|Monster of the Week mobs]], [[Idol_of_Forbidden_Magic#Graveyards|World Objectives (such as necromancer cemetery mobs)]], [[Treasure_Map|Treasure Maps]], [[Message_in_a_Bottle|Messages in a Bottle]], [[Whirlpool|Whirlpools]] and [[Paragons|Paragon Chests]] have a chance to drop [[Meta_Pets#Relic_Qualities|Crumbling Relics (not including crafting relics)]]. The chance of getting a [[Meta_Talismans#Relic_Qualities|Crumbling Relic]] can include either Meta Talisman Relics and [[Meta_Pets| Meta Pet Relics]].\n\n::[[Dungeon_Bosses|Dungeon Bosses]] and [[Champion_Spawns|Champion Bosses]] have a chance to drop [[Meta_Pets#Relic_Qualities|Flawed Relics]].\n\n::[[Meta_Pets#Relic_Qualities|Flawed Relics (all types)]] can also be created by using the transmutation cube (available on the gold sink vendors) and a new recipe to combine 8 [[Meta_Pets#Relic_Qualities|Crumbling Relics]]. The 8 [[Meta_Pets#Relic_Qualities|Crumbling Relics]] must all be of the same type.\n\n::It is unknown at this time how [[Meta_Pets#Relic_Qualities|Flawess Relics]] will be obtained.\n\n====Have the aesthetic relics changed at all?====\nYes! Previously, aesthetic relics could be applied to a talisman at any time and meta pets that had met specific level requirements. Now, aesthetic relics can be applied to a talisman or meta pet at any time, no matter what level they are. Aesthetic relics cannot be used to charge spider relics or combined with small relic fragments to create crumbling relics.\n\n==Meta Dragon==\nMeta Dragons are the highest single DPS Meta Pet but will require more attention for healing.\n\n===How To Obtain===\nMeta Dragons can be obtained by killing the [[Random_Dungeon_Adventure#Dragon_Progenitor|Dragon Progenitor]] in a [[Random_Dungeon_Adventure|Random Dungeon Adventure]] or by killing [[Dungeon_Bosses#Akor|Akor]] one of the [[Dungeon_Bosses|Dungeon Bosses]]. Once you've killed the [[Random_Dungeon_Adventure#Dragon_Progenitor|Dragon Progenitor]], he has a chance to drop a Dragon Egg. After killing [[Dungeon_Bosses#Akor|Akor]] there is a chance an egg will drop and if it drops, it will appear on the ground under the top level of the temple. The Dragon Egg comes in a variety of hues and determines the color of the Meta Dragon that it hatches.\n\n===Follower/Control Slots===\nMeta Dragon requires 3 Follower Slots\n\n===Hues===\nMeta Dragons are hued based on the hue of the Dragon Egg obtained from the [[Random_Dungeon_Adventure#Dragon_Progenitor|Dragon Progenitor]]. The following hues are possible drops:\n*1109, 1154, 1173, 2655, 2963, 1155, 1284, 971, 972, 691, 742, 811, 900\n\n===Meta Relics===\nYou man apply one relic at levels 2, 4, 6, 7 for a total off four relics on a Level 7 pet.\n\n*'''Molten Breath'''\n:Chance to breath fire in a line at your current combatant. All creatures within this line will take moderate damage. When the line of fire hits its target, a small explosion takes place and damage all enemies within a small radius of the impact location.\n\n*'''Noxious Blood'''\n:A poisonous explosion of your pets blood will take place on a small chance whenever it is damaged. All creatures within the vicinity of your pet will be poisoned.\n\n*'''Quicksilver'''\n:Your pet gains a burst of speed while attacking, greatly increasing his dexterity and returning all of his stamina. This lasts for a very short time.\n\n*'''Gold'''\n:Your pet has a chance to turn monsters that attack it into a paragon.\n\n*'''Bloody Talons'''\n:Your pet has a chance to apply a small damage over time to its combatant. This ticks once every 0.5 seconds for a total of 10 ticks.\n\n===Stages===\n\nSome suggested creatures to hunt have been listed with each level. Depending on your relics and character skills, you may be able to take on bigger and nastier creatures. [[Provocation]] is particularly useful to allow your pet to chip away at big monsters while their tear each other apart.\n\n{| cellpadding=\"5\" cellspacing=\"0\" border=\"1\" width=\"70%\"\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"5%\" | Level\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"65%\" | Description\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"20%\" | Image (Hue 1284)\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"5%\" | Taming\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"5%\" | Exp\n|- align=\"center\"\n|1\n| style=\"text-align: left;\" |'''Dragon Hatchling: '''This is when your Meta-Dragon is at his weakest. He cannot yet cast spells but applies lesser poison on hit. This pet looks like a snake.<br/><br/> You are best off levelling on lowly forest creatures and weaker opponents such as ettins and ogres.\n| [[image:dragon_hatchling.png|Dragon Hatchling]]\n|50\n|0\n|- align=\"center\"\n|2\n| style=\"text-align: left;\" |'''Dragon Hatchling (Phase 2): '''Your dragon is still quite weak but has doubled in strength and gained his first relic ability slot. He will now use normal poison while attacking. This pet looks like a larger snake. <br/><br/> You can now step up to some tougher monsters such as ettin and ogre paragons, mummies, efreets and dull copper elementals. Stay close and keep your pet healed up.\n| [[image:dragon_hatchling2.png|Dragon Hatchling (Phase 2)]]\n|60\n|25K\n|- align=\"center\"\n|3\n| style=\"text-align: left;\" |'''Dragon Youngling: '''Your pet has once again become stronger. He still does not know any magic but can now use greater poison when it striker. He has grown legs and looks like a komodo dragon. <br/><br/> You should now able to to tackle daemons and dragons. \n| [[image:dragon_youngling.png|Dragon Youngling ]]\n|85\n|75K\n|- align=\"center\"\n|4\n| style=\"text-align: left;\" |'''Dragon Whelpling: '''Your dragon has finally gained magic but at the cost of poisoning on hit. His AI has changed from melee to mage. He has also gained the ability to breath fire and a second relic ability slot is gained at this level. Your pet is finally starting to look like a dragon and takes on the form of a swamp dragon. <br/><br/>Titans, dragons and daemons will continue to give good experience but you can now also mix in heavier hitters like Ogre Lords.\n| [[image:dragon_whelp.png|Dragon Whelpling]]\n|90\n|250K\n|- align=\"center\"\n|5\n| style=\"text-align: left;\" |'''Young Dragon: '''Your dragon has gained in size, skills and strength. He has taken on the form of a young dragon.<br/><br/>Keep on those titans, dragons and daemons. Balrons, Ogre Lord Paragons, Shadow Wryms and Vampires should be manageable now.\n| [[image:youngdragon.png|Young Dragon]]\n|100\n|750K\n|- align=\"center\"\n|6\n| style=\"text-align: left;\" |'''Mature Dragon: '''Your dragon has once again gained in strength and unlocked a third relic ability slot. He is now a larger form of dragon. <br/><br/> Much the same as level 5 but you may want to explore even harder hitters like ancient wyrms if you have provocation.\n| [[image:dragon.png|Mature Dragon]]\n|110\n|1.5M\n|- align=\"center\"\n|7\n| style=\"text-align: left;\" |'''Elder Dragon: '''Your pet has achieved even higher strength. It has gained its fourth and final relic ability slot. In rare cases, the Elder Dragon may take the form of a mongbat [[File:mongbat_1284.png|15px|mongbat]]. <br/><br/> Keep on chipping away with those big creatures. Paragons should now be easier to handle and you should be able to tackle some big monsters without provocation.\n| [[image:elder_dragon.png|Elder Dragon]]\n|120\n|3M\n|- align=\"center\"\n|7.5\n| style=\"text-align: left;\" |'''Evolved Elder Dragon: '''Your pet has entered its final form. It has altered its physical form to epic proportions. All skills, abilities, and strength remain the same once you have achieved this form. <br/><br/> [[File:DragonFruit.PNG|Dragon Fruit]]. <br/><br/> To gain this final form you will need to accumulate 4,500 dragon fruit. This is done by killing monsters that have 400 or more HP and using a level 7 Elder Dragon that has two or more rollovers. '''Once your dragon reaches this form it will no longer create dragon fruit.'''\n| [[image:7.5DragonEvo.png|Evolved Elder Dragon]]\n|120\n|*Fruit*\n|}\n\n==Meta Spider==\nMeta Spiders are the tankiest Meta Pet while still delivering good damage.\n\n===How to Obtain===\nUnlike other Meta Pets, the Meta Spider is purchased from the Unique Wares Vendor near West Britain bank:\n\n[[image:uniquewares_spider.png|Unique Wares Vendor]]\n\nIt can be purchased at a cost of 10 million gold. Each relic will cost 50,000 gold and must be strengthened with [[Power Scrolls]] or Relics as described in [[Meta_pets#Relic Fragments|Relic Fragment System]].​ This meta pet also has the [[Tameables#Pack_Instinct|pack instinct]] trait for arachnid.\n\n===Follower/Control Slots===\nMeta Spider requires 4 Follower Slots\n\n===Hues===\nThe following hues are possible:\n* 1935, 2727, 1938, 1461, 1366, 1955, 1920, 2949, 1175\n\n[[File:spiderhue.jpg|thumb|none]]\n\n===Meta Relics===\nYou man apply one relic at levels 2, 4, 6, 7 for a total off four relics on a Level 7 pet.\n\n*'''Brood'''\n:Summons smaller spiders to fight alongside your pet. As it levels the number of summoned spiders increases. Requires 150 power scrolls.\n\n*'''Carapace'''\n:Increases the spider's armor for a duration and refreshes its stamina. Requires 200 power scrolls.\n\n*'''Dessicate [sic]'''\n:Similar to bloody talons for Meta Dragon and Meta Steed but it does not have a fixed amount of damage. Every tick varies, this can be lower than talons, but also much higher. It also heals the spider for 50% of the damage dealt. Requires 200 power scrolls.\n\n*'''Necrosis'''\n:Provides a similar effect to Meta Dragon's molten relic except the damage is a circular range. Requires 200 power scrolls.\n\n===Stages===\n{| cellpadding=\"5\" cellspacing=\"0\" border=\"1\" width=\"70%\"\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"5%\" | Level\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"65%\" | Description\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"20%\" | Image\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"5%\" | Taming Skill\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"5%\" | Exp\n|- align=\"center\"\n|1\n| style=\"text-align: left;\" | '''Spider Hatchling: '''Doesn't look much like a spider? Don't tell it that!\n! [[image:spider_hatchling.png|Spider Hatchling]]\n|50\n|0\n|-  align=\"center\"\n|2\n| style=\"text-align: left;\" | '''Spiderling: '''That's a spider!  Although small, he can eat a lot, including his first relic!\n! [[image:spiderling.png|Spiderling]]\n|60\n|25K\n|- align=\"center\"\n|3\n| style=\"text-align: left;\" | '''Nymphal Instar: '''Your meta spider gains in power...\n! [[image:nymphal_instar.png|Nymphal Instar ]]\n|85\n|75K\n|- align=\"center\"\n|4\n| style=\"text-align: left;\" | '''Spider Pupae: '''Your meta spider gains in power... And demands a second relic.\n! [[image:spider_pupae.png|Spider Pupae]]\n|90\n|250K\n|- align=\"center\"\n|5\n| style=\"text-align: left;\" | '''Molting Spider: '''Your meta spider gains in power...\n! [[image:molting_spider.png|Molting Spider]]\n|100\n|750K\n|- align=\"center\"\n|6\n| style=\"text-align: left;\" | '''Mature Spider: '''Your meta spider gains in power... And demands a third relic.\n! [[image:mature_spider.png|Mature Spider]]\n|110\n|1.5M\n|- align=\"center\"\n|7\n| style=\"text-align: left;\" | '''Ancient Spider: '''Your meta spider gains in power... You do not want to be caught in a dark room with this. A fourth relic can now be applied. In rare cases, the Ancient Spider may take the form of a wolf spider as seen at Level 2.\n! [[image:ancient_spider.png|Ancient Spider]]\n|120\n|3M\n|- align=\"center\"\n|7.5\n| style=\"text-align: left;\" | '''Evolved Ancient Spider: '''This is the final form of the meta spider... Beware that which stalks in the darkness and is forever hungry... <br/><br/> [[File:SpiderMolter.PNG|150px|Spider Molter]] <br/><br/> To gain this final form you will need to acquire and fill a Spider Molter. You must feed this item powerscrolls up to 750 points to then upgrade your spiders physical image.\nThe Points are as follows:\n\n105 = 1, 110 = 2, 115 = 3, 120 = 4\n! [[image:7.5SpiderEvo.PNG|Evolved Ancient Spider]]\n|120\n|*Molter*\n|}\n\n==Meta Crab==\nMeta Crabs are high DPS Meta Pets that are frequently used with other Meta Pets as they have low Follower Slots and has the [[Tameables#Pack_Instinct|pack instinct]] trait. It is not uncommon for a tamer to have 5 level 6 Meta Crabs.\n\n===How to Obtain===\nThe Meta Crab Egg is gained from defeating the New Shipwrecked RDA boss.\n\n===Follower/Control Slots===\nMeta Crab requires 1 Follower Slot from levels 1-6. At Level 7 it requires 3 Follower Slots.\n\n===Hues===\nThe following hues are possible:\n* Adventurers are still collecting these ancient secrets\n\n===Meta Relics===\nYou may apply up to two relic between levels 2 and 6. At level 7 four relics will be allowed to be applied.\n\nThe meta crab will be a mountable pet for levels 5 & 6 and loses the ability to be mounted at level 7.\n*'''Brood'''\n:Summons smaller crabs to fight alongside your pet. As it levels the number of summoned crabs increases. Requires 150 power scrolls.\n\n*'''Carapace'''\n:Increases the crab's armor for a duration and refreshes its stamina. Requires 200 power scrolls.\n\n*'''Cloud Burst'''\n:Similar to bloody talons for Meta Dragon but is an AOE based damage over time to those mobs afflicted by the relic. Relic triggers from having received damage to the crab.\n\n*'''Tidal Wave'''\n:Sends out a wave to damage a target if it hits a single target it bounces back to the meta crab and heal it. If there are several targets available it will bounce to additional targets after hitting the first.\n\n*'''Calming Tide'''\n:Provides a mana returning wave that is sent to the meta crab owner once that placer drops below their max available mana.\n\n===Stages===\n{| cellpadding=\"5\" cellspacing=\"0\" border=\"1\" width=\"70%\"\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"5%\" | Level\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"65%\" | Description\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"20%\" | Image\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"5%\" | Taming Skill\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"5%\" | Exp\n|- align=\"center\"\n|1\n| style=\"text-align: left;\" | '''Crab Hatchling: '''Enter the crab attack, it is cute isn't it?  This hatchling can cast simple magic spells and apply lesser poison the enemy on hit. If you feed it Poisoning Skill scrolls it gains a chance to do normal poison at 100 skill, but most of the time will lesser poison. \n! [[image:Lvl1X.PNG|Crab]]\n|50\n|0\n|-  align=\"center\"\n|2\n| style=\"text-align: left;\" | '''Crab Hatchling: '''Holy crab cakes! You can now attach the first relic! This hatchling loses the ability to cast spells but gains stronger poison on hit. It will only be able to do normal poison even if poisoning scrolls are added.\n! [[image:Lvl2X.PNG|Crab]]\n|60\n|25K\n|- align=\"center\"\n|3\n| style=\"text-align: left;\" | '''Crab: '''Your meta crab gains in power... Now has the ability to apply deadly poison on hit.\n! [[image:Lvl3X.PNG|Crab ]]\n|75\n|75K\n|- align=\"center\"\n|4\n| style=\"text-align: left;\" | '''Malleable Crab: '''Your meta crab gains in power... While losing the ability to poison on hit, the crab can now cast magic spells again.\n! [[image:Lvl4X.PNG|Crab]]\n|90\n|250K\n|- align=\"center\"\n|5\n| style=\"text-align: left;\" | '''Hardened Crab: '''Your meta crab gains in power... And demands a second relic.\n\nCrab can be mounted now.\n! [[image:Lvl5X.PNG|Hardened Crab]]\n|100\n|750K\n|- align=\"center\"\n|6\n| style=\"text-align: left;\" | '''Rock Crab: '''Your meta crab gains in power... \n\nCrab is still able to be mounted.\n! [[image:Lvl6X.PNG|Rock Crab]]\n|110\n|1.5M\n|- align=\"center\"\n|7\n| style=\"text-align: left;\" | '''Giant Crab: '''Your meta crab gains in power... This makes you think twice before swimming out into the ocean. All four relics can now be applied. In rare cases, the Giant Crab may take on one of two forms besides the default giant crab and one form is much more rare.\n\nTo gain the level 7 form it must be fed crab cakes at level 6 and also be 120 taming. This will allow it to evolve into its level 7 form.\n\n\nYour Crab loses the ability to be mounted.\n! [[image:Lvl7X.PNG|Giant Crab]]\n|120\n|3M\n|- align=\"center\"\n|}\n\n==Meta Mantis==\n\n===How to Obtain===\nMeta Mantis can be obtained through defeating the boss of the [[Mesozoic Lands]]. The boss has a small percent chance to drop an Insect Egg. While the level 6 Mantis may show 110 in the Meta stone to control, the molting level requires 120 [[Animal Taming]] skill to get to the 6th form. There are rumors of 2 alternate forms, if you have any sightings reach out to us in [[Discord]] so we can give you credit!\n\n===Follower/Control Slots===\nMeta Mantis requires 4 Follower Slots\n\n===Meta Relics===\nA Meta Mantis takes its first relic at level 2, a second relic at level 4, a third relic at level 6 and a fourth relic at level 7.\n\nThe Mantis has a special ability that applies to all of its relics, each physical attack that the Meta Mantis takes from enemies will decrease all enabled relic's Current Cooldowns by 2 seconds.\n\n*'''Carapace'''\n:Increases the Mantis' armor for a duration and refreshes its stamina. Requires 200 power scrolls.\n\n*'''Counter Attack'''\n:Periodically defends you when a combatant attacks you\n\n*'''Magmatic Blast'''\n:Throws a projectile at the target leaving lava on the ground providing AOE damage.\n\n*'''Mantis Strike'''\n:Occasional empowered attack with amplified damage.\n\n===Stages===\n{| cellpadding=\"5\" cellspacing=\"0\" border=\"1\" width=\"70%\"\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"5%\" | Level\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"65%\" | Description\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"20%\" | Image\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"5%\" | Taming Skill\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"5%\" | Exp\n|- align=\"center\"\n|1\n| style=\"text-align: left;\" | '''Mantis Larva (Small):''' A new life begins... This larva is hungry but cant eat anything much bigger than itself, it usually enjoys small woodland animals but is rumored to grow very fast if it can ever catch a citizen off-guard! The island of [[Magincia]] is a great hunting ground for your new hungry friend.\n! [[image:Mantis stage1.JPG|Mantis]]\n|40\n|0\n|- align=\"center\"\n|2\n| style=\"text-align: left;\" | '''Mantis Larva (Large):''' Your friend is looking quite well fed, in fact they are now large enough to apply its first Relic! However to get to the next stage in its lifecycle, it will require much more food... they say that orcs are its favorite food and that the [[Orc_Mines|Orc Mines]] are a great place to find them.\n! [[image:Mantis stage2.JPG|Mantis]]\n|60\n|25K\n|- align=\"center\"\n|3\n| style=\"text-align: left;\" | '''Mantis Shrimp:''' The first molt has finally happened, and your little buddy has sprouted legs and raptorial claws! It will need to find bigger prey than orcs in order to molt again...\n! [[image:Mantis stage3.JPG|Mantis]]\n|85\n|75k\n|- align=\"center\"\n|4\n| style=\"text-align: left;\" | '''Mantis Nymph:''' A second molt has made this mantis a formidable foe, as well as, has created room for a second Relic! The new form is quite deadly with relics and can take on even larger prey!\n! [[image:Mantis stage4.JPG|Mantis]]\n|90\n|250k\n|- align=\"center\"\n|5\n| style=\"text-align: left;\" | '''Mantis:''' Your Mantis grows quite large as it swells with prey! This naturally makes the Mantis an easier target and will require much more food to molt and grow its protective chitinous plates.\n! [[image:Mantis stage5.JPG|Mantis]]\n|100\n|750k\n|- align=\"center\"\n|6\n| style=\"text-align: left;\" | '''Armored Mantis:''' The Mantis has molted for the final time into a form with tough chitin and deadly spikes. Along with these new defenses, there is room for a third Relic!\n! [[image:Mantis stage 6.JPG|Mantis]]\n|120\n|1.5M\n|- align=\"center\"\n|7\n| style=\"text-align: left;\" | '''Tempered Armor Mantis:''' The Mantis has been in battle long enough that its chitinous plates have been worked like tempered iron, and in doing so has created room for a fourth and final Relic! While there may not be a change in its appearance this form is much stronger than the last... however there are rumors of 2 alternate forms, if you have any sightings reach out to us in [[Discord]] so we can give you credit!\n! [[image:Mantis stage 6.JPG|Mantis]]\n|120\n|3M\n|}\n\n==Meta Steeds==\nMeta Steeds are ridable Meta Pets. Currently selections are the Mammal and Reptile version. \n\nFirebreath damage was added to meta steeds in December 2018. Damage is calculated as level x 2.\n\n====How to Obtain====\nMeta Steed eggs can be obtained using crystal fragments obtained during [[Invasions|Invasion]] events. The menu for [[Invasions|Invasion]] rewards can be accessed by typing the [rewards [[Server_Commands|command]]. [[File:invasionsMenuSteed.png|thumb|200px|Invasion reward menu]]\n\n===Follower/Control Slots===\nMeta Steeds requires 2 Follower Slots\n\n===Hues===\nThe following may not be a definitive list as new hues are added regularly.\n* From Invasion Rewards: 2500 (Newspaper) & 2503 (Ember).\n\n===Meta Relics===\nYou man apply one relic at levels 2, 4 and 6 for a total off three relics on a Level 6 pet.\n\n*'''Bloody Talons'''\n:Your pet has a chance to apply a small damage over time to its combatant. This ticks once ever 0.5 seconds for a total of 10 ticks.\n\n*'''Gold'''\n:Your pet has a chance to turn monsters that attack it into a paragon.\n\n*'''Paralytic Venom'''\n:Your pet has a chance to temporarily reduce a creature's dexterity and intelligence.\n\n===Stages===\n====Mammal====\n{| cellpadding=\"5\" cellspacing=\"0\" border=\"1\" width=\"70%\"\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"5%\" | Level\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"65%\" | Description\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"20%\" | Image (Hue 2503)\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"5%\" | Taming Skill\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"5%\" | Exp\n|- align=\"center\"\n|1\n| style=\"text-align: left;\" |'''Kitty: '''A cute little kitty cat.  I hope it bites!\n| [[image:Meta_Steed_Level_Mammal1.png|Kitty]]\n|50\n|0\n|- align=\"center\"\n|2\n| style=\"text-align: left;\" |'''Dog: '''Your best friend. It will be by your side, and devour your enemies for you and accepts its first relic has a treat.\n| [[image:Meta_Steed_Level_Mammal2.png|Dog]]\n|60\n|25K\n|- align=\"center\"\n|3\n| style=\"text-align: left;\" |'''Horse: '''Your meta is now a ridable steed!\n| [[image:Meta_Steed_Level_Mammal3.png|Horse]]\n|75\n|75K\n|- align=\"center\"\n|4\n| style=\"text-align: left;\" |'''Mythical Beast: '''Your meta gains in power... And craves a second relic.\n| [[image:Meta_Steed_Level_Mammal4.png|Mythical Beast]]\n|90\n|250K\n|- align=\"center\"\n|5\n| style=\"text-align: left;\" |'''Skeletal Steed: '''Your meta gains in power...\n| [[image:Meta_Steed_Level_Mammal5.png|Skeletal Steed]]\n|100\n|750K\n|- align=\"center\"\n|6\n| style=\"text-align: left;\" |'''War Horse: '''This is the final form of your mammal meta steed. This majestic creature can now make use of its third and final relic ability.\n| [[image:Meta_Steed_Level_Mammal6.png|War Horse]]\n|110\n|1.5M\n|}\n\n====Reptile====\n{| cellpadding=\"5\" cellspacing=\"0\" border=\"1\" width=\"70%\"\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"5%\" | Level\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"65%\" | Description\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"20%\" | Image (Hue 2963)\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"5%\" | Taming Skill\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"5%\" | Exp\n|- align=\"center\"\n|1\n| style=\"text-align: left;\" |'''Frog: '''A newly hatched frog.  I hope it can eat more than flies!\n| [[image:Meta_Steed_Level_Reptile1.png|Frog]]\n|50\n|0\n|- align=\"center\"\n|2\n| style=\"text-align: left;\" |'''Giant Toad: '''Now we're talking.  Big toad means it can kill bigger enemies and make use of its first relic ability.\n| [[image:Meta_Steed_Level_Reptile2.png|Giant Toad]]\n|60\n|25K\n|- align=\"center\"\n|3\n| style=\"text-align: left;\" |'''Raptor: '''Your meta has evolved so you can now ride it!  Watch out for the claws!\n| [[image:Meta_Steed_Level_Reptile3.png|Raptor]]\n|75\n|75K\n|- align=\"center\"\n|4\n| style=\"text-align: left;\" |'''Reptilian Pupa: '''Your meta gains in power... And is hungry for a second relic.\n| [[image:Meta_Steed_Level_Reptile4.png|Reptilian Pupa]]\n|90\n|250K\n|- align=\"center\"\n|5\n| style=\"text-align: left;\" |'''Hiryu: '''Your meta gains in power...\n| [[image:Meta_Steed_Level_Reptile5.png|Hiryu]]\n|100\n|750K\n|- align=\"center\"\n|6\n| style=\"text-align: left;\" |'''Reptalon: '''This is the final form of your reptile meta steed. This powerful ally can now make use of its third and final relic ability.\n| [[image:Meta_Steed_Level_Reptile6.png|Reptalon]]\n|110\n|1.5M\n|}\n\n==Contributors==\nThe community would like to thank the following brave adventurers who contributed their time and experiences for others to enjoy:\n* kamster#8704\n* SonicBoom#5267\n* Suikoden13 [RiS]#2083\n* Tackos#7492\n* Sidnne#7432\n\n[[Category:Player vs Monster]]"
          }
        ]
      }
    }
  }
}