{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "2318": {
        "pageid": 2318,
        "ns": 0,
        "title": "Militias",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Quests]][[Category:Player vs Player]]\n__TOC__\n== Militias Overview ==\n\nThe Militia system was introduced in October 2017 to replace [[Factions]]. The system's code was completely rewritten as the overly complex nature of Factions severely restricted the developers abilities to expand and enhance Factions. You must be in a guild to join the guild's militia. \n\n<gallery class=\"center\" widths=\"250px\" heights=\"250px\">\nFile:JoinMilita.PNG|'''How to Join'''<br />(click to preview)\nFile:MilitaTab1.PNG|'''Active Militia Member'''<br />(click to preview)\nFile:Capture Point.JPG|'''Courage Capture Point'''<br />(click to preview)\nFile:MilitiaSeekEnemies.png|'''Seeking Enemies'''<br />(click to preview)\n</gallery>\n\n=== Joining / Leaving  ===\n\nTo join your guild's militia, open the Guild menu and select the Militia button and then click Join! There will be a small amount of skill loss for two minutes when you first join a militia. As the number of players in a guild's militia is capped at 30, there is also an option for managing the Militia roster to kick members from the militia.\n\n[[File: ManageRoster.PNG]]\n\nYou can leave a militia through the same menu but note that there is a delay before you leave and you will not be able to re-join any militia for 12 hours. Presently when you \"leave guild\" it will also instantly remove you from militia.\n\n=== Finding your foes ===\n\nTo track down enemy militia that are nearby, speak the phrase \"I seek my enemies\".\n\n[[File:SeekEnemies.PNG]]\n\n=== Bounty Points ===\n\nBounty points can be earned by:\n* Killing enemy militia members\n* Holding special Capture Points around the lands.\n\n=== Individual Perks ===\n\n[[File:MilitiaPurchase.PNG]]\n\nAs a militia member, you will be able to use your hard-earned personal militia points to:\n\n* Create special shrouded robes from a menu with a variety of hues. This sets the hue for all the militia in the guild.\n\n<gallery class=\"left\" widths=\"250px\" heights=\"250px\">\nFile:MilitiaShroudHues.PNG|'''Milita Shroud Hues'''<br />(click to preview)\nFile:MilitiaShroud3AR.PNG|'''Militia Shroud'''<br />(click to preview)\n</gallery>\n\n* Temporarily Sanctify (bless) weapons for 5 days\n\n[[File:SanctifyWeapon5D.PNG]]\n\n* Temporarily Sanctify (bless) armor for 24 hours\n\n[[File:SantifyArmor1D.PNG]]\n\n=== Guild Perks ===\n\n[[File:GuildPerks.PNG]]\n\nAs a militia guild, you will be able to use your hard-earned guild militia points to:\n\n* Activate guild pet resurrection for a gold cost at milita stable masters. This allows tamers to avoid skill point loss on pet death.\n\n'''NOTE: The Pet Res perk is PASSIVE and you do not need to click the button to activate this perk. So, always keep 1,670 bounty points in your Guild's bank and you'll be able to res pets without penalty.'''\n\n: [[File:PetRezMilitia.PNG]]\n\n* Activate evil monster kills, that provide 1 guild bounty for each monster kill made deposited to the guild bounty pool.\n\n: [[File:Evilmonsterbounty.PNG]]\n\n* Activate reduced reagent purchase cost in towns.\n\n: [[File:ReducedRegs.PNG]]\n\n* Activate increased champion spawn score.\n\n\nPassive benefits of being a militia member include:\n\n* The use of wands for those currently in militia. While this applies to all wands that are available the main wands used include Lightning, Mana Drain and Greater Healing. These wands strength are tied to players Magery/Evaluating Intelligence. They do not use mana, useable while running and can't be interrupted when hit. There are use limitations when using lightning wands and the explosion spell.\n\n: [[File: WANDS.PNG]]\n\n* Notification of capture points being assaulted\n\n: [[File: MilitiaJournalAssault.png]]\n\n* Notification of murders (Approximate locations provided)\n\n: [[File: MilitaMurderHunting.PNG]]\n\n* Ability to use previously collected Faction Shrouds. Compared to militia shrouds, faction shrouds will not decay and will not cost bounty. Player must be in Militia to initially equip these shrouds. Thanks to Tarek#6446 for collecting all the hues and screenshots!\n\n: [[File:FactionShroudsV2.PNG]]\n: [[File:FactionHues.PNG]]\n\n=== Capture Points ===\n\nThere are three Capture Points: West Britain, Mystery Location #1, & Mystery Location #2. These Capture Points are the main source of Bounty to your individual and guild bounty pool.\n\nEach Capture Point nets you 75 individual and guild Bounty Points and can be recaptured every hour. Total distributed based on your militia bounty tax setting.\n\n* Courage - Britain\n* Force - Minoc\n* Wisdom - Moonglow\n\n<gallery class=\"center\" widths=\"250px\" heights=\"250px\">\nFile:Courage Capture Point.JPG|'''Courage - Britain'''\nFile:Minoc Capture Point.JPG|'''Force - Minoc'''\nFile:Wisdom Capture Point2.JPG|'''Wisdom - Moonglow'''\n</gallery>\n\n==Ascension==\nMilitia Ascension is a system where you find special items called Runes placed on Rune Altars deep within dangerous dungeons around the world. Your goal is to transport these runes back to your chosen Guild Sanctuary to gain Rune Rewards. Rune Rewards provide extremely valuable perks such as choosing next Militia Dungeon, becoming the Militia Dungeon Master, or becoming the Militia Dungeon Treasurer. In addition to Rune Rewards, Militia members gain Militia Silver by participating in dungeons designated as Militia Dungeons which can also be redeemed for rewards. \n\n===Unlocking Ascension For Your Militia===\nGuild leaders can unlock Ascension through the Ascension tab of their Guild Menu. From here, place a Sergeant at Arms NPC at one of your houses. Your Sergeant at Arms can be customized and will represent your Militia for Ascension. It can also be summoned to any guild house of your choosing. \n\nOnce your Sergeant at Arms is placed, you'll need to select 1 of the 4 available Guild Sanctum to release the power of the Runes. Be careful with your choice as you cannot change Guild Sanctum locations. Once selected, your Militia will now be able to obtain Runes.\n\n<gallery class=\"center\" widths=\"250px\" heights=\"250px\">\nFile:SergeantOfArmsMenu.png|'''Militia Ascension Menu'''\nFile:SergeantOfArmsDressRedeem.png|'''How to Redress and Redeem Rewards'''\n</gallery>\n\n===Sanctum Locations===\n*Sanctum of Deceit - Near the entrance of Deceit \n*Sanctum of Dominance - Near the entrance of Wrong\n*Sanctum of Imperium - Near the entrance of Hythloth\n*Sanctum of Supremacy - Near the entrance of Destard\n\n===Obtaining, Transporting, and Releasing Runes===\nRunes will spawn in dungeons around the world every 4-6 hours in a Rune Altar. Your goal is to pick the Rune up and safely transport it to your assigned Guild's Sanctum. Guild Sanctums are locations of great power and natural lava flow which is great for working on ancient relics.\n\nBe careful on your journey though! Once you pick up a Rune, you will be unable to Recall or Gate Travel. You will also not be able to enter houses or non public areas. Additionally, a message is sent to other Militias and they will try to hunt and kill you for your Rune. If killed, your Rune will drop and any player can pick it up to transport to their Guild Sanctum. If you're a coward, you can drop the Rune 60 seconds after you pick it up.\n\n<gallery class=\"center\" widths=\"250px\" heights=\"250px\">\nFile:RuneAltar.png|'''Rune Altar'''\nFile:AscensionRune.png|'''Transporting a Rune to Guild Sanctum'''\nFile:GuildSanctum.png|'''Guild Sanctum'''\n</gallery>\n\nAfter the Rune reaches the inner hall of your Guild’s Sanctum, it will summon your Guild’s Sergeant at Arms, which will begin attempting release the power from within the Rune. You will need to protect your Sergeant at Arms from death as he channels for 10 minutes to release the power of the Rune. Just as when you picked the Rune up, a message is sent to Militias when a Rune is placed for channeling so be prepared for battle! If successful, you’ll receive a Rune Reward. If your Sergeant At Arms is killed, the Rune will be sent back to the Rune Altar.\n\n<gallery class=\"center\" widths=\"250px\" heights=\"250px\">\nFile:RealingRunePower.png|'''Releasing the Power of the Rune'''\n</gallery>\n\n====Tracking a Rune====\nOnce a rune has been obtained, you can track the location of the Rune by saying the phrase \"I seek the objective\". This is very important for enemy Militia members who want to steal the rune or kill the Sergeant at Arms. A minimap will pop up if you are over 300 tiles away from the Rune with a red marker indicating it's current location. If you're within 300 tiles you'll be given the direction of the Rune above your head.\n\n<gallery class=\"center\" widths=\"250px\" heights=\"250px\">\nFile:Enemy Militia 1.png|'''Seeking Rune Beyond 300 Tiles'''\nFile:Enemy Militia 2.png|'''Seeking Rune Within 300 Tiles'''\n</gallery>\n\n===Rune Rewards===\n====Rune Rewards====\nEach Rune will provide different rewards, and there will be more Runes added over time.\n\n* Rune of Domination: This Rune will allow your guild to redeem 1 raffle ticket for choosing next week’s Militia Dungeon.\n* Rune of Preparation: This Rune will enter your guild to be next week’s Militia Dungeon Master.\n* Rune of Balance: This Rune will enter your guild to be the next week’s Militia Dungeon Treasurer.\n\n<gallery class=\"center\" widths=\"250px\" heights=\"250px\">\nFile:RuneofDomination.png|'''Rune of Domination'''\nFile:RuneofPreparation.png|'''Rune of Preparation'''\nFile:RuneofBalance.png|'''Rune of Balance'''\n</gallery>\n\n====Militia Dungeon, Dungeon Master, & Treasurer====\nEvery Sunday at 6pm (server time) a draw will pick where the next week’s Militia Dungeon, Dungeon Master, and Dungeon Treasurer.\n\n*Militia Dungeon\n**Designated dungeon where Militia members can gain Militia Silver. Militia members will receive a notification when they enter a Militia Dungeon\n\n*Militia Dungeon Master\n**The Dungeon Master can place traps throughout the dungeon which gives them the upper hand to dominate rival Militias. Traps are made from [[Tinkering]].\n***Current Traps: Gas Trap, Saw Trap, Spike Trap, & Explosion Trap\n\n*Militia Treasurer\n**The Militia Treasurer’s Guild will automatically collect a percentage of Silver obtained from their guild throughout the dungeon. This will be able to be retrieved from your Sergeant of Arms at the end of the week.\n\n<gallery class=\"center\" widths=\"250px\" heights=\"250px\">\nFile:MilitiaDungeon.png|'''Entering a Militia Dungeon'''\n</gallery>\n\n===Militia Silver===\nMilitia Members can hunt in the designated Militia Dungeon to collect Militia Silver. Militia Silver is automatically put into your pack as you kill monsters. A new Militia Dungeon will be selected each week. Any Militia member of any guild can hunt in the Militia Dungeon. \n\nThere will be seasons with the silver, it will change every 6 months. Each time the season changes you will be able to redeem them for new rewards including exclusive hued wearables.\n\n====Militia Silver Shop====\n\nYou can spend your Militia Silver at the Militia Shop near WBB.\n\n<gallery class=\"center\" widths=\"250px\" heights=\"250px\">\nFile:Militia Shop.JPG|'''Militia Shop'''\n</gallery>"
          }
        ]
      }
    }
  }
}