{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "2343": {
        "pageid": 2343,
        "ns": 0,
        "title": "Monster Contracts",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Quests]][[Category:Player vs Monster]]\n[[File:Monster_Contracts_Menu.PNG|thumb|The Monster Contract Menu. Here you can see the Name and Amount of monsters the contract is for along with the \"Add Corpse\" button.]]\n\n__TOC__\n=Description=\nMonster Contracts are monster hunting tasks assigned to you in exchange for [[Rares#Statues|a monster statuette]]. Some of the contracts will require you to kill tough creatures. If you are new to the server, you may be best off trading these tougher contracts to other players.  Completing the contract will give you a random reward.\n\n[[File:HeraclesLocation.png|Heracles Location]]\n\nTo obtain a contract, find Heracles the Hunter near West Britain bridge and double click him, then target a [[Rares#Statues|statue]] in your pack (it will consume the [[Rares#Statues|statue]]!) and he will present you with a contact to fulfill. There are no limits on contracts and you can get as many as you wish.\n\n[[File:TargetItem.png|Target Statue]]\n\nOnce a contract is given, you have 14 days (336 Hours) to fulfill it. If you cannot complete the task then the contract will be voided. Once the contract is completed, double click Heracles and target the completed contract to receive your reward.\n\n[[File:Monster_Contracts_Deed.PNG|Monster Contract Deed. The Tooltips lets you see the Monster name and current progress along with how much time is left before the contract expires.]]\n\nTo fill an contract you can double click the contract and select the corpse of the creature, of which you must have the looting rights for. You can also select the contract itself and it will auto grab all acceptable corpses in the area around you. Please note that when a corpse is consumed that the items inside the corpse will no longer be retrievable so it would be wise to first loot your kill before adding their corpse to the contract!\n\n[[File:Monster_Contracts_Menu.PNG|The Monster Contract Menu. Here you can see the Name and Amount of monsters the contract is for along with the \"Add Corpse\" button.]]\n\n==Notes==\n* You can use almost any type of [[Rares#Statues|statue]] and even [[Rares#Monster_Drop_Rares|mounted dragon heads]], however it would be wise not to use any [[Rares#Statues|specially colored statues]] as these are generally worth more to a player than as a contract!\n\n=Contract Monsters=\nThere are many different types of monsters that may be requested to be hunted by Heracles with some stronger than others and some harder to find than others! The amount of monsters kill may vary depending on the strength or availability of the monster type. \n\nWhile we do not have a full listing of every monster type that can drop here is a known listing, thanks to our [[Monster_Contracts#Contributors|Contributors]]:\n* Abnormal Dread Spider\n* Amazon guard\n* Ancient Lich\n* Arctic Ogre Lord\n* Blood Daemon\n* Blood Vortex\n* Crystal Elemental\n* Defiled blood elemental\n* Devourers of Soul\n* Dread Spider\n* Efreet\n* Pyroclastic Elemental\n* Rai-Ju\n* Reaper\n* Revenant Lion\n* Skeletal Dragon\n* Succubus\n* Undead Night\n* Vampire\n* Werewolf\n\n=Rewards=\n[[File:BloodyExplosion.jpg|thumb|Bloody Explosion Relic]]\nThe default for completing a contract is always a check for some amount of gold, which may or may not reflect the strength of the contract. Remember that this is extra gold in addition to all the gold you should be getting from the monsters corpses BEFORE adding them to your contract!\n\nVery rarely you can receive one of the following items instead of gold:\n* '''[[Power_Scrolls|Fletching Power Scrolls]] 105 - 120:''' The only source in the game for [[Fletching]] Power Scrolls!\n* '''[[Meta_Talismans#Aesthetic_Relics|Bloody Explosion Relic]]:''' An [[Meta_Talismans#Aesthetic_Relics|aesthetic relic]] that can be applied to [[Meta Talismans]]. \n* '''Character Statue Maker'''\n* '''[[Treasure Map|Level 7 Treasure Map]]:'''\n* '''Mounted Pixie'''\n* '''Flag of Domination'''\n* '''[[Cloth|Woodsman Cloth - Hue 1981]]'''\n\n=Contributors=\nThe community would like to thank the following brave adventurers who contributed their time and experiences for others to enjoy:\n* Tupac Amaru"
          }
        ]
      }
    }
  }
}