{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "2341": {
        "pageid": 2341,
        "ns": 0,
        "title": "Montor",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Atlas]]\n[[Category:Dungeons]]\n[[File:MontorLevelRuinedCityMountMont-Or.PNG|Summit of Mount Mont-Or|425px|thumb|right|In the Center of the Lava pit on top of Mount Mont-Or is a pool of lava that actively flows down through the cities old water fall system. This chamber is the location where the Kal'gedeth - Abomination Lord was said to crawl forth from during the cities destruction long ago...]]\n__TOC__\n\n==Notes==\n* The entrance is located in the basement of a building under [[Vesper]] graveyard.\n* Creatures may often be very close to the entrance - tread carefully! You may want to use [[Stealth]] skill or the spell [[Invisibility]] when entering the cave.\n* There is a story behind the release of this dungeon, which can be found here: [https://www.uoforum.com/threads/heaven-and-hell-event.104933/ Heaven and Hell Event - Credits to Skye Wolfsbane]\n* While the Dungeon uses the layout from Montor, these monsters are not from our Sosarian World. Dont be fooled by their appearance as they may not reflect the strength of those similar monsters you find inhabiting Sosaria!\n* It should be noted that since these creatures are from another realm, [[Slayer_Types|Slayer Weapons ]] may or may not work as expected!\n* You can ride mounts into the dungeon, however if you dismount them, you cannot remount them inside the dungeon.\n* The Spells [[Mark]] and [[Gate Travel]] do not work within the dungeon.\n* The terrain is a bit difficult to travel through as this once great city is now in ruins. The Spell [[Teleport]] is allowed, and can be used to get on several roofs and through hard to walk through terrain. Most rubble will block your path, but does not break LOS(Line of Sight) to teleport over!\n* LOS(Line of Sight) can seem strange at first in this dungeon as the city is built on the side of a mountain. This means that Southern Side is lower in height than Northern Side and this can lead to some creatures having spell casting advantages over you!\n\n==Entrance - Vesper Graveyard==\n[[File:MontorLevelEntranceUnderGraveyard.PNG|Vesper Graveyard|425px|thumb|right|Entrance - Vesper Graveyard]]\nThe Entrance of Montor is a cave underneath a building in the [[Vesper|Vesper Graveyard]]. This one of Britiannia's larger graveyards which you can find:\n* Abandoned Funeral Home\n* Corrupted Blood Fountain\n* Graves and Small Mausoleums\n\n<gallery mode=\"packed\" class=\"right\">\nFile:MontorLevelEntranceGraveyard.PNG|Vesper Graveyard Entrance\nFile:MontorLevelEntranceFuneralHome.PNG|Funeral Home\nFile:MontorLevelEntranceUnderGraveyard.PNG|Underneath the graveyard\n</gallery>\n\n===Monsters===\n{| border=\"1\" \"\n|-\n| align=\"center\" style=\"background-color:#000; color:#FFF;\" | '''Slayer Group'''\n| align=\"center\" style=\"background-color:#000; color:#FFF;\" | '''Monsters'''\n|-\n| align=\"center\" | [[Slayer_Types#Arachnid|Arachnid]]\n| align=\"center\" | Giant Spider\n|-\n| align=\"center\" | [[Slayer_Types#Undead|Undead]]\n| align=\"center\" | Bone Knights, Skeleton, Skeletal Knights, Skeletal Mages, Shades, Spectre, Wraith, Zombie\n|-\n| align=\"center\" | None\n| align=\"center\" | Undead Rats\n|}\n\n==Level 1- Ruined City==\n[[File:MontorLevelRuinedCity.PNG|Ruined City of Montor|425px|thumb|right|Ruined City of Montor]]\nThis is the Ruined City of Montor which is in a constant state of chaos as the denizens here fight in a war of good and evil. The remains of the city are quite narrow and can be difficult to traverse, you may also find:\n* Lavafalls and a Magma Chamber\n* Decaying Stone Bridges and Rubble Filled Streets\n* Abandoned Homes and Businesses\n* Foyer to [[Dungeon_Bosses#Kal.27gedeth_-_Abomination_Lord|Kal'gedeth]]\n\n<gallery mode=\"packed\" class=\"right\">\nFile:MontorLevelRuinedCityEntrance.PNG|The entrance and exit to the Ruined City of Montor. This great bridge used to be a high traffic path for carts of goods and travelers, but now lays crumbling over a stream of lava.\nFile:MontorLevelRuinedCityBottomLavaWater.PNG|Great stone stairs leading to sea side lavafalls in the Ruined City of Montor.\nFile:MontorLevelRuinedCityBottomLeft.PNG|A beach-side home left in rubble after the war of Heaven and Hell in the Ruined City of Montor.\nFile:MontorLevelRuinedCityMiddleLavaFalls.PNG|A crumbling forgotten temple between what used to fast flowing rivers of water.\nFile:MontorLevelRuinedCityMiddleRight.PNG|Within the Ruined City of Montor, destroyed shops on a stone street where an ancient statue stands with meaning lost to time.\nFile:MontorLevelRuinedCityTopLeft.PNG|Where once stood expensive homes with hidden away scenic parks, now lies only carnage and torture rooms for the prisoners of a forgotten war in Montor.\nFile:MontorLevelRuinedCityTopRight.PNG|A great church or place of worship that protected passage into an inner floating palace deep in the mountain lake is now the scene of destruction and desecration in Montor.\nFile:MontorLevelRuinedCityMountMont-Or.PNG|Foyer to Kal'gedeth.\n</gallery>\n\n===Dungeon Boss===\nBeware adventurers, [[Dungeon_Bosses#Kal.27gedeth_-_Abomination_Lord|Kal'gedeth]] can be summoned in the peak of the mountain in the magma chamber!\n\n===Monsters===\n* It should be noted, that the creatures found in this list are not from the Lands of Sosaria, and the [[Slayer_Types|Slayer Types]] may not reflect what is expected with regards to the other similar looking creatures you have seen before! \n{| border=\"1\" \"\n|-\n| align=\"center\" style=\"background-color:#000; color:#FFF;\" | '''Slayer Group'''\n| align=\"center\" style=\"background-color:#000; color:#FFF;\" | '''Monsters'''\n|-\n| align=\"center\" | [[Slayer_Types#Abyss|Abyss]]\n| align=\"center\" | Burning Soul, Hell Crawler, Hell Overlord, Oblivion Knight, Stygian Horror, Voidbringer \n|-\n| align=\"center\" | [[Slayer_Types#Undead|Undead]]\n| align=\"center\" | Angelic Scout, Angelic Warrior, Bloodgutter, Fallen Shaman, Holy Nephilim, Horror, Lady of Light, Light of Heaven, Misshapen \n|-\n| align=\"center\" | None\n| align=\"center\" | Animated Corpse, Boneripper, Burning Soul, Carrion Bat, Cherub, Soul Burner\n|}"
          }
        ]
      }
    }
  }
}