{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "2609": {
        "pageid": 2609,
        "ns": 0,
        "title": "New Player Guide",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "__TOC__\n\n==Introduction==\nWelcome to UO Forever (UOF)! This brief guide is to get your started whether you’re a new player to UO, a returning veteran needing a refresher, or familiar with UO but it’s your first time playing UOF.\n\n==Video Guides for First Time Players==\nIf you're BRAND NEW to UO, take 15 minutes to learn the absolute basics of the user interface and core mechanics. It will make the game far less confusing.\n\nUser Interface Guide: https://youtu.be/RlgEZF0QW4k\n\nHow to Play Ultima Online (Core Mechanics) Guide: https://youtu.be/nufU3pF2ar4\n\n==Getting Started==\nAs a new player, you'll be granted [[Young Player Status]]. This gives you special access to the [[Young Player Dungeon]] as well as other features. We highly recommend you review the [[Young Player Status]] page to learn more.\n\n==Navigating Sosaria==\nPart of the fun of Ultima Online is exploring the open world. However, sometimes you need a little help finding that specific vendor or location. \n\nThe [[World Map]] is an excellent page that gives you an overview of all of Sosaria including towns, dungeons, and Moongate locations. We recommend sticking around [[Britain]] until you get more comfortable with the map.\n\n==Recommended Beginner Build - Dexxer/Archer Bard==\nUOF is an open ended adventure with endless possibilities; however, to put the best foot forward we would recommend starting your journey with a recommended build for a few reasons:\n\n# They help you get the feel for UOF with a clear cut plan\n# Progress is consistent and feels rewarding\n# They provide good, steady income to fund future builds\n\nWe encourage players to forgo creating PvP or crafting characters initially as they require a steady source of income to fund gameplay.\n\n===Intro===\nA bard build is highly recommended for beginners as it is extremely safe and efficient at killing mobs. You’ll use the power of provocation to trick creatures into fighting each other and then finish the surviving foes off with your combat skills. Healing is used to recover hp, cure poison, and potentially resurrect an ally (NOTE: you need 60 Healing and Anatomy to cure poison and 80 in both to resurrect). \n\nFor your combat skill - Archery is the recommended skill to choose as it provides the safest option for new players. You can absolutely choose swordsmanship but it comes with higher risk as you'll take more damage while killing monsters. The payoff is your DPS will be higher. Again if its your first time playing UOF, we recommend choosing the Archer route. You can always respec your character to swordsmanship later if it doesn't feel like it fits your style.\n\nStarting Skills\n*50 Archery or Swordsmanship (Archery Recommended)\n*50 Healing\n*20 Tactics\n*0 Anatomy\n\nFinal Build\n*100 Musicianship\n*100 Provocation\n*100 Healing\n*100 Anatomy\n*100 Combat Skill & Archery\n*100 Tactics\n*100 Magery\n\nFinal Stats\n*100 Strength\n*25 Intelligence\n*100 Dexterity\n\n===Getting Started===\nCongratulations on making your first character! You’ll start with a katana or bow & arrows and 150 bandages. Head to West Britain Bank (WBB) and open your bank by standing near a banker and type “banker bank”. WBB is located West of where you start. You can access your map by clicking on the World Map button on the toolbar at the top of your screen.\n\nDeposit your 500 gold to keep it safe. Inside the bank is a blue Welcome Bag which has a full set of leather armor which you should equip. Now its time to head to the Bowyer to purchase some extra arrows if you started with Archery or to the Blacksmith to get a heater shield if you started with Swordsmanship.\n\n<gallery class=\"center\" widths=\"250px\" heights=\"250px\">\nFile:WBB.JPG|'''West Britain Bank'''\n</gallery>\n\nThe blacksmith located north east of WBB. Once you have your heater shield you'll have 36 armor and its time to head to the Young Dungeon.\n\n<gallery class=\"center\" widths=\"250px\" heights=\"250px\">\nFile:Brit blacksmith.JPG|'''Britain Blacksmith'''\nFile:BritBowyer.JPG|'''Britain Bowyer'''\n</gallery>\n\nThe Young Dungeon is located just outside the inn you left when you first created your character.\n\n<gallery class=\"center\" widths=\"250px\" heights=\"250px\">\nFile:Young_dungeon_entrance.JPG|'''Young Dungeon Entrance'''\n</gallery>\n\nLife is going to be a little rough for a bit but it gets much easier as you progress - which should happen quickly. Having low combat skills, tactics, anatomy & strength makes your damage really low. Your attack speed will also increase as you gain more Dexterity. Finally, expect to fail bandages a lot until you gain more healing and anatomy.\n\nStart attempting to slay and looting everything you see in sight using bandages to survive. Especially zombies as they provide good gold, easy to kill, and don't do much damage. Plus, you'll receive 1,000 gold once you've killed about 10 of them for completing the [[Bones To Pick]] Achievement. Your goal is to obtain roughly 1,700 gold total so you have enough money to train musicianship, provocation, tactics, and to get a horse. Avoid Murderer NPCs and ghouls if possible for now.\n\nKite monsters using your bow and use bandages on yourself once you’ve been damaged to attempt to heal yourself. After a few seconds you’ll be healed a set amount; however, be cautious as your bandages will tend to fail at a low skill level and you could heal less if a creature hits you while you are applying bandages.\n\nIf you're running low on arrows, you can attempt to rebuy more at the Bowyer but your best bet is to kill Skeleton Archers and Ratmen Archers as well as Centaurs to loot arrows.\n\nOnce you’ve gained at 1.7k in gold and loot, head to the bard in Britain to train musicianship and provocation to 50 and purchase a few lutes. The bards are located right next to the Blacksmith you visited earlier. Single left click on the bard to see the training and purchasing options. Provocation will make your life easier as you can provoke monsters onto each other and avoid damage. \n\n<gallery class=\"center\" widths=\"250px\" heights=\"250px\">\nFile:Brit bard.JPG|'''Britain Bard'''\n</gallery>\n\nLet’s get you a ride. Head over to the Animal Trainer in Lord British's Castle and purchase a horse for 550gp. This will make traveling around much faster. The Castle is located just north of the Britain Bank. \n\n<gallery class=\"center\" widths=\"250px\" heights=\"250px\">\nFile:Brit animal tamer.JPG|'''Britain Animal Tamer'''\n</gallery>\n\nIf you have any remaining gold, you could train other useful skills such as Anatomy/Tactics from the Blacksmith or purchase more bandages or heal potions from an Alchemist. Now it's time to head back to the Young Dungeon and continue clearing it. The goal now is to gain skill, gold, and getting more comfortable with PvM in general. Be mindful of how much you loot as you’ll walk/be unable to move if you’re carrying too much weight. Use the telepads to get safely back to the Young Dungeon entrance. \n\nBe sure to complete the [[Vengeance]] quest so you can obtain the [[Ring of Forgiveness]]. This ring allows you to teleport back to the Britain healer if you're killed once every 12 hours.\n\nOnce you’re able to easily clear the Young Dungeon, head back to Britain and train any skills from the Final Build listed above to 50 if they are not already at that skill level. It’s time to prepare for your first REAL dungeon!\n\n===Preparing for the Dungeon Despise===\nIt’s time to put your big boy/girl pants on and head out into Sosaria. We recommend your first real dungeon to be Despise as it is easily accessible since it is north of Britain. \n\n<gallery class=\"center\" widths=\"500px\" heights=\"500px\">\nFile:Despise.jpg|'''Despise Location'''\n</gallery>\n\n====Upgrading Your Bow====\nThe beginner bow is underwhelming to say the least. It's slow and misses a lot. We strongly recommend you upgrade your bow for a better overall playing experience. You'll want to get a composite bow and ideally an accuracy modifier attached to it. These bows can be purchased from players.\n\n*Accurate\n*Surpassingly Accurate\n*Eminently Accurate\n*Exceedingly Accurate\n*Supremely Accurate\n\nFor a full list of weapon modifiers you can visit the [[Weapon Modifiers]] page.\n\n====Obtaining the Spell Mark====\nEven though Despise is nearby, running back and forth from Britain and Despise can be tedious so you’ll want to obtain the spell Mark.\n\nMark is 6th circle spell you cast on runes (purchased from Mages) which marks your location. You will teleport to the marked located when you cast the spell Recall on the rune. \n\nYou’ll want to mark multiple runes to Britain bank as well as the entrance to Despise. Keep one of each on you and put the rest in your bank. You mark several runes incase you die and lose your runes. Since you only have 50 magery, you’ll want to purchase some Mark Scrolls as it significantly increases your chance to successfully cast the spell. Without scrolls, at 50 magery, you’ll unsuccessfully cast (fizzle) so much it will be frustrating.\n\nHere are your options for obtaining Mark:\n*You can purchase the scrolls from players or vendors\n*You can ask players or Companion for help and they’ll most likely give them to you (join our Discord for the quickest)\n*You can create a new character (toon) with 50 inscription and magery and attempt to craft them yourself but this would be a similar experience to trying to cast the spell yourself\n\nA side goal would be to obtain a Runebook where you can store your runes and not worry to lose them as your Runebook is blessed.\n\n====Skill Training====\nSome players choose to macro skills prior to setting out in the wild. While not necessary, its important to understand what macroing is to see if its the right fit for you.\n\n=====Macroing=====\nMacroing is automating skill gain for your character through scripts. It can be done through the Script tab of your Forever Client. While macroing is not required, - you can make great skill gains simply hunting in dungeons (50% skill gain increase) - it can be a convenient way to increase the power of your character prior to jumping into Despise. Or people choose to macro simply because they have other obligations and want to build their character while away from the computer. Many skills are legal to macro unattended but please review the rules (https://www.uoforever.com/rules.php) to understand which ones you cannot do unattended. All skills from the Final Skill Build can be done unattended.\n\nSome skills are free to macro (such as Anatomy), but other takes resources (Magery) which costs gold or can be more complicated as you’ll need a partner or multi-client (Combat Skills and Healing).\n\nYou’ll hear the term “multi-account” and that simply means you can have two or three clients open on the same computer. This is done for a number of reasons but for this guide’s purpose you would use it help macro your character.\n\n=====Macroing Guide=====\nHere is how efficiently macro each of the Final Build Skills for your Dexxer or Archer/Bard:\n\n*Musicianship/Provocation - Visit the Bard's Table which is located just due south of the Young Dungeon entrance (pics below). Stand the table and provoke any monster onto yourself. This method is extremely efficient as you gain 50% skill gain within dungeons\n<gallery class=\"center\" widths=\"250px\" heights=\"250px\">\nFile:Young dungeon bard table.JPG|'''Young Dungeon Bard's Table'''\n</gallery>\n*Magery - Follow the Magery macroing guide on the [[Magery]] wiki page. You'll want to macro Magery early or you'll run into skill cap problems. In order to macro Magery, you will also need Meditation to regen mana. Once you've completed macroing Magery, you can set Meditation's arrow down so the skill lowers as you creep closer to the skill cap.\n*Anatomy - Run a script to use anatomy on a second player (multi-account). You will want this skill GM’d before you macro Healing.\n*Healing - Kill your player on your second account and have your primary character attempt to resurrect your multi-account character. Do not accept the resurrection on the second account. You can macro this way fully from 50 to GM.\n*Dexxer/Archery & Tactics - Multi account and run a script to attack each other than back off to heal when you’re low HP. It’s probably not worth macroing these skills as you’ll make great gains simply hunting - especially in dungeons.\n\n====Gearing Up====\nWhether you choose to macro or gain skill simply playing - its time to gear up for our venture to Despise. Head back to the Young Dungeon or Britain Graveyard to gain gold if you’re running low to purchase these supplies.\n\n*Full set of plate armor (if dexxer?) (NEED RECOMMENDATION HERE)\n*6 Runes (3 marked for Britain with 2 in the bank. 3 runes brought with you to mark Despise)\n*About 30-50 of each reagent\n*Heal potions, refreshes, etc?\n*100 bandages\n\nMake sure your Strength and Dex are 100 and Intelligence is 25.\n\n===Despise===\nNow that you're trained and geared up, it's time to head to Despise. As mentioned before, it's located North of Britain.\n\n====Navigating & Surviving Despise====\n\nDespise is a great beginner dungeon as the first two floors are not very difficult to solo. Check out the [[Despise]] wiki page for more detailed information.\n\nThe first two floors should be no problem if you're macroed. You need to be very careful once you begin the 3rd floor as the difficult of the monsters begin to ramp up. We would highly recommend not going beyond the 2nd floor unless you're in a party.\n\nJust like in the Young Dungeon, use your provocation and combat skills to slay monsters and bandages/potions to survive. Be sure to have the spell Cure handy in case you are poisoned and you will want to cast Reactive Armor on yourself if you are a Dexxer as it will reflect damage.\n\nDon't get too greedy with your loot if you no longer have your [[Young Player Status]]. At any time a Player Killer (PK) can come by and kill you for your loot. So, make a habit of regularly recalling out to bank your loot once you have a nice haul.\n\n===Next Steps===\nOnce you're able to clear Despise easily, you've pretty much graduated from being a newbie PvMer - Congratulations! You now have a toon who is able to easily generate gold for your future builds such as a crafter, PKer, tamer, or [[Meta Talismans]] build. Or you can continue on your bard path and tackle more dungeons listed below.\n\nWe strongly recommend you join a guild for comradery, friendship, and be able to to start getting more involved in higher difficulty dungeons and fighting Champions ([[Champion Spawns]]). \n\nFinally, as mentioned before, you should join [[Discord]]. It's an amazing resource to find friends, guilds, get questions answered quickly, and get the most up to date information from Staff.\n\n==PvM Location Guide==\n\nUO Forever is an open world and you are free to explore wherever you wish; however, some people appreciate a bit of guidance.\n\nAs a beginner, we recommend getting your footing in the [[Young Player Dungeon]]. Once you feel more comfortable with combat, we recommend you visit [[Despise]] as your first real dungeon but would not advise going beyond the 2nd floor unless you are with friends. From there, the world is your oyster but here is a handy chart to help give you some insight of the danger of each dungeon and floor. \n\nWe've categorized the chart by overall difficulty of the most common PvM locations. As a general rule, the first few floors of a dungeon should not extremely difficult but some locations get exponentially harder as you progress. \n\n===Dungeon Difficulty Chart===\n\n{| class=\"wikitable\"\n! style=\"font-weight: bold;\" | Dungeon\n! style=\"font-weight: bold;\" | Difficulty\n! style=\"font-weight: bold;\" | Location\n|-\n| [[Ankh]]\n| <span style=\"color:red\">Hard</span>\n| Marble Island\n|-\n|| [[Asylum]]\n| <span style=\"color:red\">Hard</span>\n| Center of the Britain Hedge Maze\n|-\n|| [[Booty Island Dungeon]]\n| <span style=\"color:blue\">Intermediate</span>\n| Booty Island\n|-\n|| [[Britain Sewers]]\n| <span style=\"color:green\">Beginner</span>\n| Britain\n|-\n|| [[Covetous]]\n| <span style=\"color:blue\">Intermediate</span>\n| South of Minoc, west of Vesper, and northwest of Cove\n|-\n|| [[Deceit]]\n| <span style=\"color:blue\">Intermediate</span>\n| Dagger Island\n|-\n|| [[Delucia Passageway]]\n| <span style=\"color:blue\">Intermediate</span>\n| Southwest of Trinsic\n|-\n|| [[Despise]]\n| <span style=\"color:green\">Beginner</span>\n| North of Britain\n|-\n|| [[Destard]]\n| <span style=\"color:red\">Hard</span>\n| Southeast of Skara Brae and northwest of Trinsic.\n|-\n|| [[Exodus]]\n| <span style=\"color:red\">Hard</span>\n| Yew\n|-\n|| [[Fire Dungeon]]\n| <span style=\"color:blue\">Intermediate</span>\n| Serpent's Hold\n|-\n|| [[Grinch's Grotto]]\n| <span style=\"color:blue\">Intermediate</span>\n| Hythloth\n|-\n|| [[Hythloth]]\n| <span style=\"color:blue\">Intermediate</span>\n| Fire Island\n|-\n|| [[Ice Dungeon]]\n| <span style=\"color:blue\">Intermediate</span>\n| Northwest of Wrong\n|-\n|| [[Khaldun]]\n| <span style=\"color:red\">Hard</span>\n| Southwest of Trinsic.\n|-\n|| [[Montor]]\n| <span style=\"color:red\">Hard</span>\n| Vesper graveyard\n|-\n|| [[Orc Mines]]\n| <span style=\"color:green\">Beginner</span>\n| Northwest of Britain, southeast of Yew\n|-\n|| [[Shame]]\n| <span style=\"color:blue\">Intermediate</span>\n| South of Yew, north of Skara Brae, west of Britain\n|-\n|| [[Spider Cave]]\n| <span style=\"color:blue\">Intermediate</span>\n| Southwest of Shame, south of Yew, north of Skara Brae, west of Britain, and west of Orc Mines\n|-\n|| [[Terathan Keep]]\n| <span style=\"color:blue\">Intermediate</span>\n| Spider Cave\n|-\n|| [[The Abyss]]\n| <span style=\"color:blue\">Intermediate</span>\n| Fire Island\n|-\n|| [[The Grotto]]\n| <span style=\"color:blue\">Intermediate</span>\n| Middle of the ocean, west of Ocllo\n|-\n|| [[Wind]]\n| <span style=\"color:blue\">Intermediate</span>\n| North of Britain\n|-\n|| [[Wrong]]\n| <span style=\"color:blue\">Intermediate</span>\n| Northwest of Minoc\n|-\n|| [[Young Player Dungeon]]\n| <span style=\"color:green\">Beginner</span>\n| Britain\n|}\n\n\n==Additional Revenue Options==\nUsing one of the Recommended Builds will set you up nicely to generate consistent income; however, if you would like to switch things up a bit, here are a few options to continue exploring Sosaria while gaining some income.\n\n===Escorting===\nEscorting is a simple way to gain gold by escorting NPCs found in major towns to other towns or dungeons. You can travel by foot or magic using gate travel. There isn't a specific build for escorting as you could do them while PvMing or Treasure Hunting so think of it as an add on option to your gold generating build. Check out the [[Escorts]] page for more information.\n\n==Tips==\n1. To keep the lights on always, you don't need to cast the night sight spell or use potions. Go to Razor, Filters and Check Lights.\n\n2. Don't go gray opening a corpse you don't have looting rights to! Open paperdoll. Go to the pentagram on top. Go to the UO symbol. Second column, check “Disable Open Innocent Corpses.”\n\n3. To recall somewhere quickly, make a rune for Home or a Bank. Type [recall Home (or whatever your named your rune).\n\n4. Watch others play on Twitch! We have many streamers who are willing to answer questions and watching others is a great way to learn the game. Look in the #streamers thread on Discord for who is streaming UOF.\n\n5. Join [[Discord]] and the UOF Forums. There you will have a whole community to help you. Visit UOF's homepage to join. https://www.uoforever.com/.\n\n6. If you wish to end your young status early (which is not recommended), simply use the phrase \"I wish to renounce my young player status\". Be sure this is what you want to do as you cannot get young status back once it is renounced."
          }
        ]
      }
    }
  }
}