{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "1607": {
        "pageid": 1607,
        "ns": 0,
        "title": "Paperdoll",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "__TOC__\n==Description==\n[[Image:3d0561aa80467ec4c8a2294f647b569b.png|frame]]\nThe Paperdoll is one of the most important and commonly used menu in the game. You used it to change your character clothing and equipment. You can also access other important menus such as Options and Log Out. The Paperdoll can be opened in four different ways. \n*Chose the Paperdoll button on the bar menu;\n*Double-click your character while dismounted;\n*Open a Contextual Menu on your character and select the \"Open Paperdoll\" option; or\n*Use a Macro. The default macro for opening the Paperdoll is Alt-P.\n\n==Equipment==\nThe Paperdoll is your primary means of changing clothing and armor for your character. To remove an item, move your cursor over the item, left-click and drag the item away. You can now place that item in your backpack or another container. To equip an item, reverse the process. If you already have an item equipped that takes up the slot of the item you are trying to equip, a click noise will be made and the item will remain on your cursor when released.\n\n===Equipment Slots===\nThere are 19 different equipment slots.\n*Belt - Bracelet - Back - Chest - Sash - Earrings - Footwear - Gloves - Head - Left Hand - Legging - Neck - Right Hand - Ring - Robe - Shirt - Skirt - Sleeves - Talisman\nThe Head, Earring, Neck, Ring, and Bracelet have boxes on the left side for easier removal of those items.\n\n==Titles==\nIn the bottom area your Reputation title will be displayed, along with your name, skill proficiency, and champion spawn title (if turned on). The reputation title is a combination of Fame and Karma. Your skill title is determined by your highest skill level. Your champion spawn title depends on how many Champions you have defeated. You can choose to turn your champion spawn title on and off by opening a contextual menu on your character and selecting the \"Toggle Monster Title Display\" option.\n\n[[Category:Interface]]"
          }
        ]
      }
    }
  }
}