{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "1681": {
        "pageid": 1681,
        "ns": 0,
        "title": "Paragons",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Player vs Monster]]\n[[image:Paragon_monster.png|thumb|300px|An example of a paragon monster.]]\n__TOC__\n==Description==\nIt would seem that all inhabitants of Sosaria share a common virtuous goal of Valor on the battlefield, and for a very small number of them, they have been chosen to become a Paragon for their cause. When you come across a Paragoned creature, they will appear noticeably more powerful than the creature of their type. You will be able to recognize them by their Blood Red(Hue 1157) color and the \"paragon\" title in their names.\n\n==Abilities==\nYou may also notice that these paragon creatures stand out with new abilities and mannerisms such as:\n* Have the health of 5 of their type\n* Faster Health Regeneration\n* Greater Resistances and Armor\n* Hit Harder with melee, spells, fire breath and damaging auras(such as fire or life draining)\n* Any skills they use will also be much greater, which can mean harder to hit, they can do more magic damage, or if they can poison, the [[Poisoning#Types_of_Poison|Poison Level]] can be greater than normal\n* Move Faster and will begin attacking at farther ranges\n\n==Rewards==\nDefeating a Paragon in battle will have greater rewards than that of a normal creature. Paragons always carry much more gold and have a chance to drop a Paragon Chest. The Fame and Karma received from slaying Paragons is always much greater as well, which can be either positive or negative depending on the creatures notoriety.\n\n===Chests===\nParagon have a chance to drop chests of loot, which scales with the difficulty of the Paragoned creature. The chests must be lockpicked with the [[Lockpicking|Lockpicking skill]] and come trapped which can be removed with the [[Remove_Trap|Remove Trap skill]] or simply cast [[Telekinesis]] on the chest to trigger the trap from a safe distance of five or more steps away. Paragon Chests always contain one [[Treasure Map|Treasure Map]] and this map will  always be one level higher than the level of [[Treasure Map|Treasure Map]] that the creature would normally drop.\n\nHere is a list of the common items found in a Paragon Chest:\n* Gold\n* Gems \n* Scrolls\n* [[Reagents]]\n* [[Armor]]\n* [[Weapons]]\n* [[Treasure Map|Treasure Maps]]\n* [[Consumable Perks]] - Small chance to drop\n* [[Meta_Talismans#Relic_Qualities|Crumbling Relics]] or [[Meta_Pets#Relic_Qualities|Crumbling Relics]] - very small chance to drop\n\n==Chest Styles==\nParagon Chests come in all of the metal ore colored hues as well as Evil Mage(Hue 1109), Ice White(Hue 1150), and natural hue(Hue 0). They always contain the name of the creature that dropped the chest. There are 2 forms of these chests, one is a the normal metal chest while the other is a \"gold trimmed\" metal chest which can leave the outlines of the colored chests a lighter hue. When a [[Holiday_Monsters|Corrupted Holiday Spirit]] becomes a paragon there is a chance that a [[Holiday_Monsters#Rewards|Corrupted Holiday Spirit Chest]] can drop and the name and hue will be unique to that particular [[Holiday_Monsters#Corrupted_Holidays|Spirits Holiday]].\n\n[[image:Paragon_chest_hues.png]]\n\n'''Normal Hues'''\n* Natural(Hue 0)\n* Ice White(Hue 1150)\n* Evil Mage(Hue 1109)\n\n'''Metal Ore Hues'''\n* Dull Copper(Hue 2419)\n* Shadow Iron(Hue 2406)\n* Copper(Hue 2413)\n* Copper Bronze(Hue 2418)\n* Golden Yellows(2213)\n* Agapite(Hue 2425)\n* Verite(Hue2207)\n* Valorite(Hue 2219)\n\n'''Corrupted Holiday Spirit Hues'''\n* Red(Hue 37)\n* Holiday Green(Hue 1272)\n* Neon Pink(Hue 1166)\n* Metallic Mint(Hue 2655)\n* Pumpkin Spice(Hue 1358)\n* Hocus Pocus(Hue 1378)\n* Cyan(Hue 88)\n* Light Yellow(Hue 1169)"
          }
        ]
      }
    }
  }
}