{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "1612": {
        "pageid": 1612,
        "ns": 0,
        "title": "Party",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[image:party_menu.png|thumb]]\n__TOC__\n==Description==\nA party is two or more players that have chosen to be part of the same group. Being in a party allows for useful things such as party tracking, split fame from killing creatures, party chat, the ability to loot each other and each others creatures and much more.  \n\n==Creating a Party==\nType '''/add''' and target the person you wish to add with the cursor that appears.\nor Single click on the person to obtain the menu, select 'add party member'\n\n===Joining a Party===\nType '''/accept''' to join a party.\n\n===Leaving a Party===\nType '''/quit''' or single click yourself and select the appropriate menu option.\n\n==Party Menu==\nThe party menu can be accessed by the second scroll inside of your [[Paperdoll]]. Double clicking it will reveal a menu allowing you to perform certain party actions, such as kicking. \n\nEach party member has a red and green dot to heal or cure them by clicking in the button (assuming you have a spell that does this).\n\n==Party Tracking==\n:Using client programs such as [[Razor]], [[UOSteam]] or [[Sallos]] will give you mini maps that have the ability to track and locate party members. See the appropriate pages on how to use this function.\n\n[[Category:Interface]]"
          }
        ]
      }
    }
  }
}