{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "2323": {
        "pageid": 2323,
        "ns": 0,
        "title": "Patch-notes",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "\n== Patch Notes from UOF Discord ==\n\n; February 4, 2018\n: Capture Points - capture points will now count back up if no militia are in range, while out of range militia members with score will lose score until they return to range\n: Murders - when a murder is reported all militia members will be sent a message stating: victim name, killer name, general location\n: Mining - miners will be subject to lower ore harvest amounts for a period following the use of the recall spell\n: OrcBruteIdol replaced with OrcBruteStatue\n: Removed the poker speech restriction\n: Added barkeeper logging\n: Dont announce all muders, only those with multiple murderers reported\n: Added undead rats to barracoon champ\n: Changed leave house to require 10s of not moving instead of a 10s para afterward\n: Runebooks are now labeled with their number of charges\n\n; February 14, 2018\n: The arch demon was strengthened to make it more difficult to kill\n: Removed undead rats from Barracoon champ, added rabid rats instead\n: Recall harvesting cooldown now only applies to mining\n: Guild titles are now always on for everyone\n: When joining militias you will be statted for two minutes\n: The Cure 2.0 double damage has been reinstated\n: Militia bounty will not be transferred when killing those currently in militia statloss\n: Lowered the expiration of militia shrouds to 5 days from 7\n: Added a cost of 30 bounty to get a militia shroud\n\n; February 15, 2018\n: Updated some land tiles through the patcher. Everyone will be hit with a new update through our launcher. Remember to shut down everything \"UO and UOF\" related before installing patches.\n: Fixed issue with artLegacyMUL.zip re-downloading over/over. Let me know if this continues (should be fixed).\n\n; February 16, 2018\n: There is now a BOD-TRADE channel under the TRADE HEADER. #bod-trade\n: Added Low-end POKER Table.\n\n; February 20, 2018\n: Paging has now been added to the militia roster management gump\n: https://i.imgur.com/uqhj5eh.gifv\n: Militia blessing has been enabled\n: for 100 bounty you can sanctify a weapon for 72 hours\n: at the end of that time the weapon is deleted\n: the weapon is also deleted for the following actions: attacking an innocent, use by any other character than the one that sanctified it\n: using the weapon while not in a militia will delete it(edited)\n: Added the old faction death animation and sound when a militia member is killed\n: Added a fix for the arch demon and other dungeon bosses to stop endless healing\n\n; February 26, 2018\n: Lower the capture point spam of messages\n: Fix for bounty loss while dueling\n: Added guild wide bounty with a cap of 1000\n: 10% of any bounty captured in a militia will go to the guild pool\n: All pet res at the militia vendor will use the guild pool\n: Other militia items will use the personal bounty count\n: Akor has gained a teleport attack to teleport to the nearest player and attack them every 30 seconds\n: Fey mobs have had their attack based on karma restriction removed\n: Lord Oaks will take minimal damage unless Silvani is dead\n: Small adjustments to rogue elude and crossbow bonuses\n\n; March 3, 2018\n: Add LOS check for Akor teleport\n: Fixed Akor teleport delay\n: More adjustments to ArchDemon\n: Reverted karma changed to Fey champ mobs\n: Lowered elude cooldown slightly\n: Fixed another place to force guild titles on\n: Disabled AquariumFishingNet for pet trapping, only green nets from fishing should work on pets\n: Lowered required score for booty dungeon bosses to 1\n: Lowered Warden minimum required score to 500\n: Added fix for Militia Sanctify items not deleting when expired\n: Added label for Monster contract duration\n: Increased guild bounty tax to 50%\n: Added button on militia screen to enable or disable militia bounty tax(edited)\n: Only warlord or guildmaster can alter the setting\n\n; March 14, 2018\n: When capturing a militia capture point if you have progress points and leave the range of the capture point, you will now lose 2 progress points instead of 1\n: Added hue number to the custom hue picker gump\n: Added hue picker when hatching a spider egg\n: Fixed hard creature bonus for easter mobs\n: Another attempt to stop butlers from being kicked from houses\n: Butlers are no longer bannable from houses\n: Leave house command has now been changed back to a 5 second para after using\n: Guild titles are no longer forced on for non militia\n: Completed the easter rabbit hunt event\n: Enabled easter mobs\n\n; March 19, 2018\n: Moved the champ score bonus capture point to the old Minax base\n\n; March 26, 2018\n: Restored most of the deleted monster contracts\n: Added new option for disabling the opening of innocent corpses\n\n; April 10, 2018\n: Re-enabled ingot selling to npcs\n: Increased militia sanctify time to 5 days\n: Adjusted loot chances for monster contracts, increased powerscroll chance and increased gold drop\n: Renamed \"a TinySpider\" to \"a tiny spider\"\n\n; April 19, 2018\n: The water champion will now drop white skulls\n\n; May 2, 2018\n: Despise level 3 eastern area should now be fixed\n: Ship repair kits should now break properly\n: Addon deeds for dono decoration items should now be blessed after chopping\n: Karma loss for killing players has been increased\n: Slayers now work on Iron Elementals\n\n; May 5, 2018\n: Added throwable foods\n: Fixed issue where bank boxes would be moved into backpacks in certain regions\n: Added speech and house sign click cooldown enforcement\n\n; June 7, 2018\n: Kirin damage to players has been nerfed\n: The reduced cost reagents capture point has been reenabled\n: Made dragons motm in addition to elder gazers\n\n; June 25, 2018\n: Ankhs will no longer resurrect players that are criminals\n: The reduced cost reagent stone should work properly now\n: Summer corruption monster have been enabled(edited)\n: They are similar to holiday monsters but are more rare, they are hues 88 and 1169\n: Poison healing has been removed from the covetous champ boss\n\n; July 13, 2018\n: Removed tournament fish from mib chests\n: Meta-Spiders can no longer be released\n: Lowered metaspider damage against players\n: When using an rda exit players will exit to a random location, this applies to all rdas\n: The house sign click delay will now be enforced. Fix your macros.\n\n; July 18, 2018\n: Fixed a typo on ankh resurrection message\n: Removed some debugging messages from npc vendors\n: Lowered house sign click delay\n: Dont allow unowned pets to use house to house teleporters\n\n; July 31, 2018\n: Take into account world saves when firebreath delay is computed\n: Add a random delay to portal spawn after reboots\n: Fix for starting with invalid skills\n: Added stone throwing to Ogre Lords when they cannot path to their target\n: Fix for server crash when using Guillotine\n: Enforce jail for youngs with wisp teleport commands\n: Added squelch enforcement to head buyback gump\n: Added logging and diagnostics to booty dungeon gauntlet\n\n; August 1, 2018\n: Ogre Lords no longer throw boulders\n: RDA exit portals no longer teleport you to random places. They instead move you to an area nearby the entrance.\n\n; August 20, 2018\n: Snowmen and nutcrackers no longer throw objects at staff members\n: Storms idols have been enabled for militia\n: Removed broken drop from whirlpools that resulted in a drop received message but no actual item\n: Fix for invasions not working in other maps\n: Fix for incorrect pet aggro message when transferring pets(edited)\n: Safety checks for meta stones\n: Booty dungeon should now work properly all of the time\n: Cannot leave jail with help stuck\n: Unstabling costs are now shown on the unstable menu at all animal trainers\n\n; August 21, 2018\n: Bonded pets with more than 200 hit points will no longer go wild, they will automatically be stabled instead of going wild and will be restored to full loyalty(edited)\n: If the pet is dead, it will be resurrected before stabling\n: Unbonded pets will go wild normally\n: Pets with less than 200 hit points will go wild normally\n: Non-meta pets will have an unstabling fee of 50k gold added to their unstabling cost if auto stabled(edited)\n: Metapets will have a fee of 100k per level added to their unstabling cost if auto stabled(edited)\n: Swamp dragons will have a 400k fee added to their unstabling cost if auto stabled\n: If the pet was trapped in a house that the owner of the pet was not friended to, the house owner will receive the total unstabling fee minus 10k(edited)\n: The 10k is charged by the animal trainer\n: For example: A level 7 meta trapped in a house will be autostabled instead of going wild, it will cost 700k to unstable it, the owner of the trap house will receive 690k of that.\n\n; September 23, 2018\n:Conquests were enabled and can be accessed by typing [conquests."
          }
        ]
      }
    }
  }
}