{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "1586": {
        "pageid": 1586,
        "ns": 0,
        "title": "Pets",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[file:Nightmare_tamed_lo.jpg|thumb]]__TOC__\n==Description==\nPets are creatures that are tamable or controllable by players. Any player can own simple domesticated animals such as horses or beetles and with high enough [[Animal Taming]], you can begin to tame and control much stronger pets such as Dragons. Pets are not limited to any one class or type of character, horses are used by many players and can be purchased from a vendor.\n\nThose proficient in [[Animal Taming]] and [[Animal Lore]] can tame strong creatures and order them to fight their battles for them. This is often coupled with [[Veterinary]] so they can heal their pets with [[Bandages]]. Having a higher [[Animal Taming]], [[Animal Lore]] and [[Veterinary]] skill also permits more [[Stable]] slots than other players.\n\nSome pets cannot be commanded or will be difficult to command with low levels of [[Animal Lore]]. Pets can be bonded]once they've been owned by a single person long enough, allowing them to be Resurrected and granting the ability to [[Recall]] with them instead of [[Gate Travel]]. More information on bonding can be found on the\n\n==Stables==\n[[Stable]]s are locations in towns and cities where a character may \"store\" a mount or other pet while not needed.\n\nCreatures may be placed in the stables by saying the word \"stable\" near a stable master. You may then target the pet you wish to store. Pack animals may not be stabled when loaded, and dead bonded creatures must first be [[resurrect]]ed.\n\nUsing the \"claim\" term allows you to retrieve as many pets as your control slots allow, though it is usually more practical to specify exactly which pet you wish to retrieve (for example, \"claim Keith\").\n\nYou may also say \"claim list\" (or request a pet you do not own, eg \"claim asdf\") to be shown a list of pets you currently have in the stable, from which you may select the desired pet.\n\nSee [[Stable]] for more detailed information.\n\n==Control Slots==\nEach player has a total of 5 control slots, Whenever they own a pet, some of these slots will be used. Without enough control slots, a player cannot control any additional creatures. Horses for example are 1 slot, you can not have 5 horses unstable at once. Most animals like Horses or Pack Horses only require 1 slot. Many stronger creatures such as Dragons take up additional slots to limit how many you can have controlled at once. Creatures that are stabled do not take up a control slot.\n\nYou can view the [[Tameables]] page to see the following slot of all tameable creatures.\n\nNOTE: Ethereal Mounts (Purchased from the [[Ethereal Mounts Vendor]]) take up 1 slot when summoned.\n\n==Getting Pets==\n===From NPCs===\nMost towns have a stable so that players may store their pets when not in use. This stable can also be used to purchase basic creatures such as a horse. Animal Trainers sell basic mounts, pack animals and miscellaneous pets which are considered useless.\n\n===From Players===\nBy single clicking on a pet, a menu is shown that allows the owner of the pet to transfer ownership of it. The owner can then target another player and a [[Trade Window]] appears. This allows players to buy and sell animals. If the player doesn't have the sufficient [[Animal Taming]] and [[Animal Lore]] skills, the transfer will fail.\n\nPlayers with the [[Young Player Status]] can not have animals traded to them in any way. They may purchase one directly from an NPC.\n\n===From The Wild===\nThrough the use of [[Animal Taming]], players may tame creatures of their own. Certain creatures require different skills.\n\n==Bonding==\nIf the owner of the pet possess the minimum [[Animal Taming]] skill as real skill (use 'show real' option on the skill sheet to check), the pet will bond after a period of 7 days when fed with correct food the first time. Subsequent feeding within these 7 days will show a timer with the time left to bond. Correct food can be determined by using [[Animal Lore]] on the pet.\n\nBonded pets will also be able to recall with the owner, when commanded to follow before the recall.\n\nTIP: Putting pets in stables, after the bonding timer started, is a great way to ensure they survive the 7 day period of bonding.\n\n===Resurrecting a Bonded Pet===\nBonded Animals can be resurrected with bandages using both a [[Veterinary]] skill and an [[Animal Lore]] skill of 80+. You'll have to seek out a player who has these skills if you don't have it yourself.\n\n===Resurrecting Bonded Pet Penalty===\nResurrecting bonded pets are penalized by permanently lowering their [[Skills]] by 1-5 points each time they are resurrected.\n\nYou may resurrect pets without penalty by using the Pet Resurrection No Skill Loss Militia Perk. Review the Guild Perks of the [[Militias]] page for more info.\n\n==Naming Pets==\nTo name a pet or change it's name dismount (if required), then click it and drag the mouse cursor away. Your pet's \"bar\" will follow the mouse, displaying (along with other things) it's name.\n\nClick the text and you'll be presented with a cursor allowing you to change it. Note that you can't add any spaces to a pet's name, but you can delete around the ones already present to leave them intact. Press Enter to confirm your changes.\n\n==See Also==\n*[[Animal Taming]]\n*[[Animal Lore]]\n*[[Controlling Pets]]\n*[[Veterinary]]\n*[[Tameables]]"
          }
        ]
      }
    }
  }
}