{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "3784": {
        "pageid": 3784,
        "ns": 0,
        "title": "Player Vendors",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Items]][[Category:Housing]]\n[[File:PlayerVendor1.png|thumb|The Player Vendor is a feature for every house that has been switched to public access, it allows for the owner to place vendors of their own or offer vendor placement to other players to sell their goods!]]\n\n__TOC__\n=Description=\nThe Player Vendor can be added to public houses to sell all your various goods and items. There are currently four types of player vendors, the original vendor contract, player rental contract, long term vendor contract, and long term player rental contract.\n\nBasically, this allows for players to either do their own vendors with the vendor contract or offer rental space to other players with the player rental contracts. The newest change is the addition of the Long Term contracts. \n\n<span style=\"color:red\">'''BE CAREFUL WHEN PLACING VENDORS YOU ARE NOT ABLE TO MOVE THEM. IF YOU DISMISS OR FORGET TO KEEP UPKEEP GOLD ON THEM THEY WILL DISMISS, IF THEY ARE LONG TERM VENDORS BOUGHT WITH DONO COINS THEN YOU WILL LOSE THE VENDOR AND NOT RECIEVE A REFUND ON DONO.</span>\n\n==Patch Notes==\n* [https://uoforever.com/2024/05/14/new-long-term-player-vendor/ Long Term Player Vendor]\n* [https://www.uoforum.com/threads/vendor-management-101-an-easy-graphical-guide-to-selling.49680/ Original Player Vendor]\n\n=Contract=\nThe Long Term Contracts are available from the [[Exotic_Item_Vendor|Nadine the Exotic Item Donation Vendor]] located in front of the [[Britain|West Britain Bank]] and is purchasable with [[Donation_Coin|3500 Donation Coins]].\n\n[[File:LongTermContract.png|The Long Term Contracts which is available from Nadine the Exotic Item Donation Vendor for 3500 Donation Coins. There are two versions, one is the house owner contract and the other is the player rental contract. Be careful when placing the vendor as you will not be able to move them and once dismissed the Donation coins spent will be lost.]]\n\nThe Original Contracts are available from any banker in the cities, these cost 1,252 gold.\n\n[[File:Originalcontracts.png|The Original Contracts are available from any banker in the cities, these cost 1,252 gold. There are two versions, one is the house owner contract and the other is the player rental contract. Be careful when placing the vendor as you will not be able to move them and once dismissed the Donation coins spent will be lost.]]\n\n\nThere are two versions, one is the house owner contract and the other is the player rental contract. <span style=\"color:red\">'''Be careful when placing the vendor as you will not be able to move them and once dismissed the Donation coins spent will be lost.</span>\n\n[[File:Vendors.png|Once vendors are placed they are set to that location, but then can be interacted with in the vendor menus. ]]\n\n==Placing Vendors==\nIn order to place a Vendor within a home, you must be a owner of the house and the home must be switched to public. It is important to plan out vendor placement and house decorations ahead of time, <span style=\"color:red\">'''once vendors are placed you will be unable to customize the home in the customize menu unless all vendors are removed.</span>\n\n[[File:Publicnocustom.png|The house sign menus for security allow you to switch to public, the customize menu is where you go to customize your home.]]\n\n\nBased on the size of your home it will have a total vendor limit. This will only allow you to place as many vendors as the home will allow. \n\n\n[[File:Vendorcount.png|The house sign menus for storage allows you to view your total vendor limit and current vendors existing in the home.]]\n\n\nWhen placing the two types of contracts. The contracts of employment will place at your feet where your standing. As this will be the owners vendor it is useable immedietly. The player rental contract will give you a targeter to select the tile you want the vendor to be placed. Once you have targeted the tile the deed will place itself on the floor, it will be through this deed that you assign another player to ownership of the contract to rent space from you.\n\n\n[[File:Contractvsrental.png|The owner vendor will place immedietly while the player rental will place a deed to use later once a renter is found.]]\n\n\nOnce you have found another player that wants to set up shop in your vendor mall. You will have them select a spot from your empty contracts on the ground. Both will need to stand next to the deed as the owner opens the menu from the deed on the ground, which was placed via the targeting menu of the contract. The owner will set contract length (1 week, 2 week, 3 week, 1 month), rental price per selected length (type zero to set to free), and set contract renewal. The new rental player will also need to set their contract renewal or the vendor will drop after the first contract length has expired. \n\nOnce the agreed settings have been selected the owner will hit \"Offer contract to someone\" and target the player taking on ownership of the rental. \n\n\n[[File:Placevendor.png|This is the interaction menu with another player to create him as an active vendor rental.]]\n\n\nThe player that is then selected to take ownership will recieved a popup asking to confirm the contract of rental. It will show the criteria of the vendor rental and if they want to accept or decline.\n\n\n[[File:Placevendorplayer.png|This is the interaction menu with another player to create him as an active vendor rental.]]\n\n\nAfter hitting accept the vendor for the renter will spawn on the tile of the deed, they will need to click on the vendor and open Contract Options. They will set their vendor to renew from there. \n\n\n[[File:Playercontractsettings.png|Set vendor renewal from contract options.]]\n\n==Customizing your Vendors==\nVendors are able to be customized in their appearance, this includes both being male/female, hair style, hair color, and the clothing they wear. Clothing you modify by opening the paperdoll of the vendor and draging items on and off very similar to how we equip our players with gear. All other customizing features are done through the vendor menu after double-clicking it.\n\n[[File:Customizevendor.png|Vendor paperdoll and vendor menu.]]\n[[File:Customizevendor2.png|Vendor customize settings for male/female, hair style, hair color.]]\n\n\nAlso from the vendor menu you can Rename Vendor and Rename Shop. By renaming vendor that will change what other players will see if approaching the vendor mall. It is typical people will provide a vendor name of the main goods they are selling and most likely to appeal to customers. Rename shop just changes the name by highlighting the vendor and the name present in the vendor menu itself. The list of vendors can be accessed from the house sign as well by clicking it and selecting Vendors. It will provide a list of shops by their shop name to quickly open that vendor. \n\n\n[[File:Shopssign.png|House sign vendors menu.]]\n\n\nYou are able to open the paperdoll from the vendor menu or also by clicking on the vendor itself as done above. \n\nAfter selling your goods you are able to then collect your gold through this vendor menu by hitting \"Collect Gold\"\n\nIf you no longer want to have your vendor, you will empty it out of all its goods and gold then hit \"Dismiss Vendor\"\n\nAs an owner of the property it is alot harder to dismiss a vendor under contract from your home. This usually happens if issues arise with the renter (afk from game with a vendor full of gold or issues with community the owner disagrees with) or if the owner wnats to make house customizations and movement. The owner has the ability to select not to extend the contract and the vendor will end at the end of the period. If a removal needs to be done sooner the own can terminate the contract, but will be prompted to offer the renter a sum of gold for doing so early and that player must also be near the vendor for this option to work.\n\n[[File:Terminatecontract.png|Terminate player rental contract.]]\n\n==Selling Goods with Original Vendor Contract==\n\nAfter all the intital setup has been completed, now will be the time to load your vendor with the gold to maintain its daily upkeep and the items in which you want to sell to the community. The Original Vendor Contract is the option that has existed on UOF since the beginning. So the below will talk about how to sell goods, load vendor funds, and the general costs to maintain your goods daily.\n\nBelow provides an example of a vendor holding 5 million worth of goods. With the original vendor system it will charge 30,050 gold per day to maining this amount of goods. It will continue to charge this amount until the item is sold. The example only showcases a single item. The daily fee will raise and lower based on the total of all items existing on the vendor to produces its daily fee. \n\n[[File:Original5mil.png|Vendor loaded with a 5 million gold item and menu showing the daily fee.]]\n\nOnce the item was purchased for 5 million gold, that money is held by the vendor and the daily fee drops according to what is left on the vendor. In this example the vendor is left empty so the daily fee drops back down to 50 gold per day.\n\n[[File:OriginalBought5mil.png|Vendor menu following the purchase of the 5 million gold item.]]\n\nIf you want to collect your gold, you will interact with the vendor menu to collect gold based on the amount you request. It will then be deposited into your bank account. It is important to remember to leave enough gold in the vendor to maintain sever days or weeks of fees so that the vendor does not expire. If there are no funds available at the daily check, your vendor will fall and all items placed into your bank.\n\n[[File:CollectGoldOriginal.png|Collecting your vendor gold from vendor.]]\n\n[[File:GoldTransfered.png|Message saying gold has transfered to bank.]]\n\n==Selling Goods with Long Term Vendor Contract==\nAfter all the intital setup has been completed, now will be the time to load your vendor with the gold to maintain its daily upkeep and the items in which you want to sell to the community. The Long Term Vendor Contract is the newest vendor option to be released on UOF. This option was explored to give ability to sell high priced items and not charge daily upkeep costs that were astronomical. So the below will talk about how to sell goods, load vendor funds, and the general costs to maintain your goods daily.\n\nBelow provides an example of a vendor holding 5 million worth of goods. With the new Long Term Vendor Contract system it will charge 80 gold per day to maining this amount of goods. Compared to the original vendor this is a huge savings in daily cost! There is a second key difference between the original vendor and the long term vendor. The Long Term Contract vendor will keep a 5% fee per bought item from the vendor.\n\nIn the the same example you will see a 5 million item being sold and the 80g daily fee. \n\n[[File:LongTerm5Mil.png|Vendor loaded with a 5 million gold item and menu showing the daily fee.]]\n\nOnce the item was purchased for 5 million gold, the 5% fee will be deducted (250k gold kept fro this 5 million gold item) and that money is held by the vendor and the daily fee could drop according to what is left on the vendor. In this example the vendor is left empty so the daily fee drops back down to 50 gold per day. This vendor will help players sell very high priced items and fill up their vendors without being charged those high daily fees to keep the vendor active.\n\n[[File:LongTerm5milBought.png|Vendor menu following the purchase of the 5 million gold item.]]\n\nIf you want to collect your gold, you will interact with the vendor menu to collect gold based on the amount you request. It will then be deposited into your bank account. It is important to remember to leave enough gold in the vendor to maintain sever days or weeks of fees so that the vendor does not expire. If there are no funds available at the daily check, your vendor will fall and all items placed into your bank.\n\n[[File:CollectGoldLongTerm.png|Collecting your vendor gold from vendor.]]\n\n[[File:GoldTransferedLongTerm.png|Message saying gold has transfered to bank.]]"
          }
        ]
      }
    }
  }
}