{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "211": {
        "pageid": 211,
        "ns": 0,
        "title": "Power Scrolls",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Items]]\n[[File:PowerScroll.png|right|250px|A Power Scroll, which can be used to increase the maximum trainable level of a character's skill, or used as currency to train relics.]]\n\n__TOC__\n=Description=\nPower Scrolls can be used to increase the maximum trainable level of a character's skill beyond 100.0, or used as currency to train relics. There are currently 4 levels of Power Scrolls:\n* 105\n* 110\n* 115\n* 120\n\n==Notes==\n* Some Skill Enhancing Gear will need to be removed when using a Power Scroll at the skill level required. For instance, if you are trying to use a 105 Mining Power Scroll with 100 Mining Skill but are wearing +3 Mining Gloves, your skill will reflect 103 Mining and therefore not be the 100 Mining Skill Required to use a 105 Mining Power Scroll.\n\n=How to Use=\nEach of these must be used in '''ORDER''' to get from 100.0 (GM) skill to 120.0 (Legendary). There is a caveat which is that before you can use a power scroll for the next level, you must max out that skill first. So before a 105 PS can be used, you must be GM. To use a. 120 PS, you must first be at 115 skill. It is important to note that Skill Enhancing Gear may interfere with the ability to use Power Scrolls, so please remove them before using a Power Scroll!\n\n=Where Do I Get Them?=\nPower scrolls can be obtained as [[Champion_Spawns#Champion_Spawn_Rewards|Champion Spawns]], [[Random_Dungeon_Adventure#Rewards|Random Dungeon Adventures (RDAs)]], [[Dungeon_Bosses|Dungeon Bosses]], [[Bulk_Order_Deed#Rewards|Bulk Order Deeds]], [[Monster_Contracts#Rewards|Monster Contracts]], [[Champion_Spawns#The_Harrower|The Harrower]] and Invasion Bosses. In the case of a Champion spawn, the power scroll will appear in the player's backpack upon Champion death (power scrolls are distributed based on damage to champ and champion related Monsters). For a period of time, Power Scrolls and [[Skill_Scroll|Skill Scrolls]] were available via puzzle chests and lockpickable chests in [[Khaldun]] (low chance), but this has since been changed.\n\n=To Train, or Not To=\n[[Skill Scroll|Skill Scrolls]] are commonly used in conjunction with Power Scrolls to raise skill above 100.0 (GM) and up to 120.0 (legendary), instead of training that skill, but they only give whole points so if you are at 114.1 -- a skill scroll will not bring you to 115 as that would bring your skill to 115.1 (where your max is 115). In this situation, you will need to train that skill to 115, or lose 0.1 points and then use a skill scroll.\n\nThe first skill that a power scroll pushes above GM (100.0) will actually raise your skill cap from 700 to the level that that first skill is at(up to 720). Only this skill can go above GM without requiring points from the original 700 skill point pool. This only occurs for that first skill, subsequent Skills do not raise the skill cap further.\n\n==Skills With Power Scrolls==\n* [[Animal Lore]]\n* [[Animal Taming]]\n* [[Blacksmithing]]\n* [[Carpentry]]\n* [[Fishing]]\n* [[Fletching]]\n* [[Lumberjacking]]\n* [[Mining]]\n* [[Peacemaking]]\n* [[Provocation]]\n* [[Tailoring]]\n* [[Inscription]]\n* [[Tinkering]]\n\n==Other Uses of Power Scrolls==\nPower Scrolls can be used to add 1 point to [[Meta_Pets#Relic_Fragments|Small Relic Fragments]] and other Relics that require them to be added before they are able to be used. This allows them to be a sort of currency in the player market and are often suggested to be saved for these systems, even if you find yourself with a power scroll that has a skill you do not intend to use!\n\n=Storage=\nPower Scrolls can now be stored in a special [[Power_Scroll_Storage_Bookshelf|Power Scroll Storage Bookshelf]] which is purchasable with [[Donation_Coin|4500 Donation Coins]] from [[Exotic_Item_Vendor|Nadine the Exotic Item Donation Vendor]] located in front of the [[Britain|West Britain Bank]].\n\n=Powerscroll Diversion=\nPowerscroll Diversions are a type of [[Stealing#Decoys|decoy]] which are items that players can use to deploy \"fake\" versions of an item. Decoys have a 75% chance of killing the thief [[Stealing#Theft|attempting a theft]] otherwise it will leave them with 1 hp. Most of these Decoys are triggered when an item type for the decoy enters the players backpack or the player is [[Snooping|snooped]] whom is currently carrying this type of decoy, with the exception of Weapon Decoys that trigger when you are disarmed.\n\nThis item is crafted with the [[Inscription|Inscription skill]] and requires the [[Forensics|Forensics skill]] along with [[Thieves_Guild#Forgers_Paints|Forgers Paints]] and blank scrolls to craft.\n\n=See Also=\n* [[Stealing#Decoys|Decoys]]\n* [[Flagging#Stealing_and_Thieves|Flagging for Theives]]\n* [[Forensics]]\n* [[Thieves_Guild#Forgers_Paints|Forgers Paints]]\n* [[Inscription]]\n* [[Meta_Pets#Relic_Fragments|Small Relic Fragments]]\n* [[Snooping]]\n* [[Stealing]]"
          }
        ]
      }
    }
  }
}