{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "2342": {
        "pageid": 2342,
        "ns": 0,
        "title": "Protecting Your Pets",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "__TOC__\n==Pet Trapping==\nIn the ever dangerous lands of Sosaria, there nefarious players who will look to lure your pets away from you, particularly if the pets are valuable. If a pet is lured away to a house you are not friended to and you cannot find it, the pet will be autostabled after it loses its loyalty and it will cost you to unstable it. The owner of the trap house will receive a majority of this cost.\n\n===Pet Luring===\nPets can be lured away by engaging in combat with the pet, this will flag you as normal per the rules of [[Flagging]] which can lead to murder counts in certain circumstances. Pets cannot be lured out of dungeons, the real danger comes when you leave your pet anywhere overland. Trappers can use [[Special_Fishing_Net| Special Fishing Nets]] to catch the pet even from locations that you wouldn't expect are reachable, such as Nujelm roof, and the lure them away on a boat. Pets cannot be pulled by [[Special_Fishing_Net| Special Fishing Nets]] if they owner is nearby or they are in a house.\n\n===Trapped Pet Fees===\n* Bonded pets with more than 200 hit points will not go wild, they will instead be automatically be stabled and will be restored to full loyalty.\n* Unbonded pets and pets with less than 200 hit points will go wild as normal and the pet trapper will be able to re-tame them.\n* Non-[[Meta Pets]] will have an unstabling fee of 50k gold added to their unstabling cost if auto stabled.\n* [[Meta Pets]] will have a fee of 100k per level added to their unstabling cost if auto stabled.\n* [[Tameables#Swamp_Dragon|Swamp dragons]] will have a 400k fee added to their unstabling cost if auto stabled.\n* The pet trapper with be rewarded with the fee paid to unstable the trapped pet, minus 10k which is paid to the Animal Trainer NPC.\n\nFor example, if your Level 7 Meta Dragon is trapped, you will have to pay 700k to unstable it. The pet trapper will receive 690k and the Animal Trainer NPC will receive 10k.\n\n==Protecting your Pets==\nTo avoid the disastrous situation of having your pet trapped, be sure to:\n# Link your pet to a Pet Summoning Ball\n# Regularly stable your pet if you are going to be away from your computer. Stable it if you are logging out!\n# Regularly check who is friended to your house and check all teleporter / door security to prevent unwanted visitors\n\n===Pet Summoning Ball===\nThis blessed item lets you link a bonded pet and summon it to you using Power of Translocation. The ball and powder can both be bought from Nadine the [[Exotic_Item_Vendor|Exotic Item Donation Vendor]]. The ball costs just 1500 [[Donation Coin]]. A small investment to give you peace of mind that you can summon your pet at any time. Even with this item, it is highly recommended that you stable your pet regularly, particularly if you plan to be away from your computer for an extended period of time. You can re-link the pet ball to other pets at any time but it will then only retrieve the latest pet that it has been linked to.\n\nIf you do not want to pay the fee to retrieve your pet, you could use your pet summoning ball but this will also be a costly exercise over time as the stable fee will still be there when you re-stable your pet afterwards.\n\n===Bindings of Devotion===\nIf you are particularly worried about losing your pet, you can purchase Bindings of Devotion from Nadine the [[Exotic_Item_Vendor|Exotic Item Donation Vendor]]. This costs 10,000 [[Donation Coin]] and extends the period that the pet stays loyal to 24 hours. This certainly isn't an essential item but can provide a little extra peace of mind.\n\n<gallery mode=\"packed\" class=\"right\">\nFile:Petballlocation.png|Pet Ball Vendor\nFile:Petheedthiswarning.png|Stable Warning\nFile:Bindingsofdevotion.png|Bindings of Devotion\n</gallery>\n\n==See Also==\n* [[Animal Taming]]\n* [[Animal_Lore|Animal Lore]]\n* [[Controlling_Pets|Controlling Pets]]\n* [[Pets]]\n* [[Special_Fishing_Net]]\n* [[Stable|Stables]]\n* [[Tameables]]\n* [[Veterinary]]\n\n[[Category:Skills]]"
          }
        ]
      }
    }
  }
}