{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "2316": {
        "pageid": 2316,
        "ns": 0,
        "title": "PvP Intro",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "== Description ==\n\nWhile the PvP ruleset on Ultima Online Forever should relatively familiar to anyone who has played the UOR era. Small adjustments are however made from time to time to try and balance or diversify the gameplay. The following guide is an introduction to some of the basics of PvPing on Ultima Online Forever. Thanks to our Superstar Peav for providing the information.\n\n=== Alchemy ===\nThe main theme of solo PvPing on a mage or dexxer is to deal as much damage as possible in a shortest amount of time. In this scenario, the usage of Explosion Potions are widely used by most players, regardless of whether they have [[Alchemy]] or not. Alchemy does however provide an important damage bonus to maximise your damage output.\n\nThe bonus from alchemy skill gives an additonal base and max damage of explosion potions. The damage of an explosion potion without any alchemy skill can be max at 15 damage while a 100 alchemy template can deal up to ~32 damage\n\nIn some templates you may need to choose between Alchemy or [[Magery]]. You should generally favour Magery over Alchemy as a solo player when you can't rely on someone else to heal you. In group combat, it is usually best to decrease Magery to bare minimum and instead focus on sustaining from damage on your enemies and receiving healing from your team mates. The minimum skill to cast Greater Healing 24.0, with this the target is healed by 40% (caster's Magery) + (1-10).\n\nOf course these are not definitive rules but it should give you an idea how to balance your Magery and Alchemy. A useful video guide on Alchy Mage can be found [https://www.youtube.com/watch?v=uaR0A-8mvWY&t here].\n\n=== Healing with Bandages ===\n[[Healing]] with bandages values your Healing, Dexterity, [[Anatomy]] and interrupts while bandaging yourself. The more interrupts you get during the bandage timer the less chance you will heal for and also the less you heal up. For example at 100 Healing and 100 Anatomy with 50 dexterity and 0 interrupts, you will heal 36-60 damage with each bandage.  It will take you about 9 seconds to apply a bandage on yourself and about 4 seconds to apply a bandage on someone else. Each interrupt will decrease the amount you bandage and slightly increase the time taken to heal.\n\nYour dexterity varies the speed of applying bandages. At 100 dexterity gives 6 seconds to apply bandage on yourself and it will take you about 3 seconds to apply a bandage on someone else.\n\nMages with Healing are mainly used for dungeon runners since it gives an edge of survivability. In Group PvP, Mages with Healing are less valuable as there is too much damage to heal in the time it takes to complete a bandage. That isn't to say it is a useless skill, it is just less valuable overall. For Warrior/Dexxers however it is still essential as a source of Healing."
          }
        ]
      }
    }
  }
}