{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "1946": {
        "pageid": 1946,
        "ns": 0,
        "title": "Random Dungeon Adventure",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Guides]]\n__TOC__\n=Description=\n[[File:Rdagate.jpg|100px|right|RDA Portal]] Random Dungeon Adventures, also known as RDAs are portals that spawn randomly through out the world. Entering one of these portals will teleport you into a dungeon containing a very powerful champion boss encounter with other monsters to clear as well. These RDA portals are blaze colored and have a fire elemental explosion effect on top of them. \n\n<span style=\"color:red\">'''Note:'''</span> While you are allowed multiple accounts on UOForever, you may not have more than ONE (1) character, dead or alive, at any given time in a single RDA. Additional characters outside of an RDA Portal are allowed.\n\n==Spawn Rate==\nFollowing changes made in October 2017, RDAs have a chance to spawn from killing monsters. Two monster spawned RDAs can be active. There is a random window of 1-3 hours that a single RDA will stay open. If the RDA is not completed in that time it will close and a new one will spawn somewhere else. If a player does a single point of damage to the spawn the window will be given a 1 hour extension. If an RDA is completed within the time assigned to it, a new RDA won't spawn until that given time expires. For example, if a given RDA spawns with a 1:45 time and is found and completed in 40min the next RDA wont spawn until the full 1:45 passes.\n\n==Paragons==\nAfter damage is dealt by multiple individuals, RDA monsters will have a chance to turn into paragon forms of themselves. This increases the difficulty of the RDA significantly. The only boss capable of becoming paragon is the Dragon Progenitor.\n\n==Fragments==\n[[File:portalFragment.png|100px|right|Portal Fragment]]Aside from those that spawn randomly in the land, a player can also spawn their own RDA if they have five RDA fragments. This RDA can be spawned anywhere except in player housing. The RDA fragments can be obtained by:\n* Finishing as the top scorer in an RDA. \n* From [[Treasure Map|Treasure Maps]] chests. The higher the map level, the greater chance of an RDA fragment.\n* From [[Message in a Bottle|Message in a Bottle]] chests.\n\n==Gem of Portals==\n[[File:gemofportals.png|100px|right|Vendor location]]This gem allows you to view portal statistics. It also allows the owner of the gem to purchase certain upgrades such as the ability to see what portals are active and the ability to receive special items. The gem can be purchased from the Unique Wares Vendor west of Britain bank for 1 million gold.\n\n===Gem of Portals Menu===\n[[File:RDAPortalGemMenu.PNG|100px|right|Portal Menu]]Once you have purchased the Gem you will have access to basic RDA historical data. As mentioned above you will need to open this menu from the Gem itself. The historical data available to you involves ranking and statistical data of all players that have interacted with RDAs in the past. You will be able to view these players profiles that tell you total number of RDAs completed, including data such as total damage, murders, deaths and creatures kill. Total damage done is what builds your character RDA ranking. You also have the ability to search specific characters by their name. In the bottom right of the menu you will see a button for Portal Upgrades. This is where you will go to access how to upgrade your RDA Gem to gain additional features to benefit you.\n\n===Gem of Portals Upgrades===\n[[File:RDAPortalUpgrades.PNG|100px|right|Portal Upgrades]]This menu in the Gem shows the two different upgrades available.\n*'''Display Active Portals''' at 1 million gold, this upgrade then will show you what current RDA is up and active in the world to go locate. In the screenshot of the menu you will see that the RDA Lummox Dojo is up and ready to be found. If there is not an RDA showing then there is not an active RDAs currently in the world and is likely on cooldown.\n\n*'''Increase Drop Rates''' at 2 million gold, this upgrade gives a chance to influence your ability for gaining additional drops at the an RDA. \n\n<span style=\"color:red\">'''Note:'''</span> '''Confirmation is required, but based on past conversation it seems the way that it works is as follows. If you received the item drop in the RDA that is when the drop upgrade would attempt an upgrade roll. If the item drop went to someone without the gem then the upgrade roll would be wasted. This in mind it is most beneficial that all individuals participating have the portal gem and upgrade to provide the upgrade roll is not wasted.\n\n=Rewards=\nThere are a number of potential rewards but don't expect to get something every time, particularly when the RDA is heavily contested!\n[[image:Dragon_egg.png|thumb|300px]]\n* [[Power Scrolls]] - Can be awarded to anyone who has damaged the boss but total score does weigh into chances.\n* [[Meta_Pets#Meta_Dragon|Meta Dragon Eggs]] - Only drops in the Dragon Progenitor encounter.\n* [[Meta_Pets#Meta_Crab|Meta Crab Eggs]] - Only drops in the Ship Wreck encounter.\n* [[Meta Pets|Meta Relics]] - As with power scrolls, relics can be awarded to anyone who has damaged the boss but total score does weigh into chances.\n* [[Random_Dungeon_Adventure#Fragments|RDA Fragments]] - Awarded to the top scorer.\n* [[Consumable Perks]]\n\n=Resources=\n[[File:CrystalMining.PNG|right]]\n* Crystals which are used to make [[Crystal Workbench|Crystal Workbenches]].\n** You will need 120 [[Mining]] to acquire these. \n* Shards required to create the Legendary Hammer\n\n\n=Encounters=\nThe following notes were provided by numerous brave warriors, including Messremb and Bromista who kindly shared their knowledge on the community forums.\n\n\n==Dragon Progenitor==\n[[image:bahamut.png|200px|right]]\n===Notes===\n* '''Spawn:''' Dragons, ancient wyrms, shadow wyrms (cannot be provoked), <s>chromatic dragon,</s> and tentacles of the Harrower\n* '''Slayer Type:''' Dragon / Reptile\n* '''Boss:''' Bahamut the Dragon Progenitor\n** '''Special Ability:''' The Dragon Progenitor boss has a fire breath that can instantly kill a player and do a significant amount of damage against pets.\n** '''Common Drops:''' ~11k gold, hammer shards, 2 [[Skill_Scroll|Skill Scrolls]], 1 [[Power_Scrolls|Power Scroll]]\n** '''Rare Drops:''' \"The dragoon\" [[Titles_and_Hues_Guide|Title]], crafting recipe scrolls, [[Meta_Pets#Meta_Dragon|Meta Dragon]] egg, statue, and [[Meta_Pets|Meta Pet]] relics.\n** '''Minimum Score:''' To be eligible for a drop, you must score at least 1000 points in the RDA.\n* '''Strategy:''' You may require multiple vets or mages to heal the pets. Best approach is 3 or more tamers healing the pet tanking.\n\n==Minotaur Champion==\n[[image:minotaur_champ.png|right]]\n===Notes===\n* '''Spawn:''' Minotaur warriors (cannot be provoked), tentacles of the Harrower\n* '''Slayer Type:''' Repond\n* '''Boss:''' Minotaur Champion\n** '''Special Ability:''' None.\n** '''Common Drops:''' ~11k gold, hammer shards, 2 [[Skill_Scroll|Skill Scrolls]], 1 [[Power_Scrolls|Power Scroll]]\n** '''Rare Drops:''' \"The Matador\" [[Titles_and_Hues_Guide|Title]], crafting recipe scrolls, statue, and [[Meta_Pets|Meta Pet]] relics.\n** '''Minimum Score:''' To be eligible for a drop, you must score at least 1000 points in the RDA.\n* '''Strategy:''' Minotaur warriors now deal additional damage to all tamed pets, making this RDA extremely difficult for tamers alone. Dexxers with slayer armor can survive but cross healing with a friend/party is recommended. Take care when tanking these creatures as they will change targets at times.\n\n==The Dark Father==\n[[image:dark_father.png|right]]\n===Notes===\n* '''Spawn:''' Devourer of souls (cannot be provoked), abyssal horror (cannot be provoked), tentacles of the Harrower.\n* '''Slayer Type:''' Exorcism on main spawn and Dark Father, Silver on boss spawned by Dark Father.\n* '''Boss:''' The Dark Father\n** '''Special Ability:''' Reflects damage and spawns bones that turn into undead spawn.\n** '''Common Drops:''' ~11k gold, hammer shards, 2 [[Skill_Scroll|Skill Scrolls]], 1 [[Power_Scrolls|Power Scrolls]]\n** '''Rare Drops:''' \"The Lightbringer\" [[Titles_and_Hues_Guide|Title]], crafting recipe scrolls, statue, and [[Meta_Pets|Meta Pet]] relics.\n** '''Minimum Score:''' To be eligible for a drop, you must score at least 1000 points in the RDA.\n* '''Strategy:''' Several tamers are recommended, and with pets being cycled out to heal. Dexxers and mages will struggle due to reflect damage. Hit the Dark Father sparingly, focus on killing any undead spawn. Cut the bones with a dagger to prevent additional undead spawn.\n\n==The Beetle King==\n[[image:beetle_king.png|right]]\n===Notes===\n* '''Spawn:'''  Rock beetles (cannot be provoked, move very fast and do all physical damage), doom beetle (high [[Magery]]), and tentacles of the Harrower.\n* '''Slayer Type:''' None\n* '''Boss:''' Beetle King\n** '''Special Ability:''' Throws pools of poison on the ground.\n** '''Common Drops:''' ~11k gold, hammer shards, 2 [[Skill_Scroll|Skill Scrolls]], 1 [[Power_Scrolls|Power Scrolls]]\n** '''Rare Drops:''' \"Bug Stomper\" [[Titles_and_Hues_Guide|Title]], crafting recipe scrolls, statue, and [[Meta_Pets|Meta Pet]] relics.\n** '''Minimum Score:''' To be eligible for a drop, you must score at least 1000 points in the RDA.\n* '''Strategy:''' The Beetle King boss will poison you by throwing poison on the ground if you move around the boss. This can cause your pets up take massive damage from his poison pools. With multiple tamers he can be boxed in to prevent movement. As a warrior, you must stand your ground and try not to move unless you have to to avoid being hit by poison.\n\n==Lummox Chieftain==\n[[image:Numata.png|right]]\n===Notes===\n* '''Spawn:''' Lummox warriors (can be provoked onto, large aggro range, move very fast and hit hard, lummox mages (high magic damage), and tentacles of the Harrower.\n* '''Slayer Type:''' Repond\n* '''Boss:''' Lummox Chieftain\n** '''Special Ability:''' Throws hard-hitting hatchets at random targets.\n** '''Common Drops:''' ~11k gold, hammer shards, 2 [[Skill_Scroll|Skill Scrolls]], 1 [[Power_Scrolls|Power Scroll]]\n** '''Rare Drops:''' \"Flummoxed!\" [[Titles_and_Hues_Guide|Title]], crafting recipe scrolls, statue, and [[Meta_Pets|Meta Pet]] relics.\n** '''Minimum Score:''' To be eligible for a drop, you must score at least 1000 points in the RDA.\n* '''Strategy:''' This can be a very tricky encounter. The entrance is the center of a room and the large aggro range on the lummoxes means that you likely be immediately targeted. It is almost inevitable that you will die a few times. Select a victim to lure the spawn away from one corner of the RDA and then make a run for that corner and slowly work your way out. On the boss himself, cross-heal and look out for those hatchets.\n\n==Undead Treasure Hunter==\n[[image:locke.png|right]]\n===Notes===\n* '''Spawn:''' Undead wardog (very fast, all physical damage), dream wraith (high [[Magery]]), tentacles of the Harrower.\n* '''Slayer Type:''' Silver\n* '''Boss:''' Locke\n** '''Special Ability:''' Summons weaker mirror images of himself which are best killed first before taking on the real Locke. Casts Ultima spell which drops on a huge area dealing a large amount of damage (450 on pets, 50+ on players). Launches a backstab attack which does a large amount of damage to pets and drops players to 10% health and infects them with deadly poisoning.\n** '''Common Drops:''' ~11k gold, hammer shards, 2 [[Skill_Scroll|Skill Scrolls]], 1 [[Power_Scrolls|Power Scrolls]]\n** '''Rare Drops:''' \"The Treasure Hunter\" [[Titles_and_Hues_Guide|Title]] (previously \"Locked and Loaded\"), crafting recipe scrolls, statue, and [[Meta_Pets|Meta Pet]] relics.\n** '''Minimum Score:''' To be eligible for a drop, you must score at least 1000 points in the RDA.\n* '''Strategy:''' Use an archer to get him to cast mirror image and then pull the real Locke off and kill the weak ones. Once all mirror images are dead, pull Locke to the center and attack. Pull off pets when he casts Ultima. Pre-cast cure when he begins his backstack attack. Cure the poison and heal up. Dexers can do a lot of damage to Locke but may need mage support for cures and heals.\n\n<gallery mode=\"packed\" class=\"right\">\nFile:Lockebackstab.png|Backstab\nFile:Lockeultima.png|Ultima\n</gallery>\n\n==Phantom Baron==\n[[image:Kbaronwiki1.PNG|right]]\n===Notes===\n* '''Spawn:'''  Searing Skeletons (path to your character or pets and explode for high damage), Ghost NPC (high [[Magery]] or Melee), and tentacles of the Harrower.\n* '''Slayer Type:''' None\n* '''Boss:''' Phantom Baron\n** '''Special Ability:''' Several.\n** '''Common Drops:''' ~11k gold, [[Skill_Scroll|Skill Scrolls]], 1 [[Power_Scrolls|Power Scrolls]] or Perk.\n** '''Rare Drops:''' [[Titles_and_Hues_Guide|Title]], Crafting recipe scrolls, and [[Meta_Pets|Meta Pet]] relics.\n** '''Minimum Score:''' To be eligible for a drop, you must score at least 1000 points in the RDA.\n* '''Strategy:''' The Baron has several different abilities that is uses during the encounter.\n\n==Queen Crab==\n[[image:Clawdia.PNG|right]]\n===Notes===\n* '''Spawn:'''  Chesapeake Crab, Hardened Octopus, and Tentacles of the Harrower.\n* '''Slayer Type:''' None\n* '''Boss:''' Clawdia the Queen Crab\n** '''Special Ability:''' Summons crab babies, Tidal Wave, Explosive Wave\n** '''Common Drops:''' ~11k gold, [[Skill_Scroll|Skill Scrolls]], 1 RDA Frag, 1 [[Power_Scrolls|Power Scrolls]] or Perk.\n** '''Rare Drops:''' [[Meta_Pets#Meta_Crab|Meta Crab Eggs]], and [[Meta_Pets|Meta Pet]] relics.\n** '''Minimum Score:''' To be eligible for a drop, you must score at least 1000 points in the RDA.\n* '''Strategy:''' Clawdia has three different abilities that is uses during the encounter. \n\nThe first she summons several baby crabs that are initially immune to all damage and will create havoc if not handled. You need to crack their shells by either hitting them with the Tidal wave (best option to take out several) or the Explosive Wave as it runs over them (alot more tricky to pull off). Once their shells are cracked they are a very quick kill from any form of damage. If left unmanaged they will continually heal the boss as more and more babies pile up.\n\nThe second ability is the Tidal Wave. Clawdia will release a wave that move in a several tile wall in front of the crab queen. As the wave hits babies it will grab them and crack their shells when they collide with a stationary object (walls, pillars, etc). If players are hit by this ability they will be grabbed and sent with the wave to the same stationary object in the path and taking 50 damage once you stop.\n\nThe third ability is an Explosive wave. It is somewhat similar to Demon Fire at Arch and Lich Khan and if you are hit you will be instantly killed, as well as your pets. This ability sends out individual waves to pets and players in the encounter and will continue to chase you until they hit a stationary object. This means learning Line of Sight objects and hiding behind them will be your friend. This wave can break the baby shells, but it is somewhat difficult to run that wave through them while they are chasing you.\n\nIt is important to find a good balance of managing the baby crabs and protecting yourself with line of sight or it will get rather chaotic very quickly. A useful tip is that field spells work to block the various waves in the encounter. Paralyze field helps gather up and stop roaming baby crabs and set up for cracking a large amount of them. It also provides a place to pull your pets behind for protection from the explosive way."
          }
        ]
      }
    }
  }
}