{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "1462": {
        "pageid": 1462,
        "ns": 0,
        "title": "Remove Trap",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[File:Flag_remove_trap.gif|thumb]]\n__TOC__\n==Description==\nThe skilled rogue can disarm traps using the [[Remove Trap]] skill. In order to begin learning the art of removing traps, you must first demonstrate proficiency in the thievish arts of [[Lockpicking]] and [[Detect Hidden]] - when you have achieved a base skill level of 50 in each, you may begin training in trap removal.\n\nFor those in search of Treasure Chests, it is less expensive in terms of skill points (and far safer!) to assume they all contain Chest Traps. Casting Telekinesis from a distance will set off any dangerous devices installed and disarm a chest permanently (assuming it was not barred with the Magic Lock spell).\n\nThis skill used to be useful in Factions as it is the only way to remove enemy Faction Traps.\n\n==Usage==\nTo use the Remove Trap skill:\n:Use the Remove Trap Skill\n:Target the item that you wish to disarm.\n:If you are successful in your attempt, the trap is disarmed and you can then attempt to pick the lock of the container. If, however, your fingers slip and you fail to disarm the trap, there is a chance it may be set off. Traps that are set off often reset themselves, requiring another Remove Trap attempt.\n:This skill is quite risky and you would be wise to practice it with caution. Wearing gloves can hinder your ability to disarm traps, as the delicate inner works of certain traps require a fine touch.\n\n==Recommended Leveling==\n:0-50: Train at Tinker or Thief.\n:50-80: Use on 80 skill trapped boxes.\n:80-100: Use on 100 skill trapped boxes.\n\nIt is best to train Remove Trap on a character with Tinkering so you can easily re-trap boxes you disarm.\n\n==See Also==\n*[[Lockpicking]]\n*[[Tinkering]]\n*[[Treasure Map]]\n\n[[Category:Skills]]"
          }
        ]
      }
    }
  }
}