{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "2394": {
        "pageid": 2394,
        "ns": 0,
        "title": "Rifts",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Guides]][[Category:Player_vs_Monster]][[Category:Quests]][[Category:Crafting]]\n__TOC__\n=Description=\nRifts are monster encounters that are player driven both through the crafting and the opening. Once opened the gate will continue to pump out very strong monsters for you to defeat with the purpose of closing the Rift. A wide range of tactics and skill will be required to tackle these with successful results.test\n\n[[File:Abreachopen.PNG|200px|center|Rift Gate]] \n\nThe first Rift was open at [[Britain]] inside the Graveyard. Several Rifts have been opened since that time and become overwhelming in the amount of monsters it pumps out of the gate. Innocent citizens of the land have even needed to board up inside of their homes.\n<gallery mode=\"packed\" class=\"right\">\nFile:RiftSpawn.PNG|Rift Spawn\nFile:RiftSpawn2.PNG|Rift Surround House\nFile:RiftCenter.PNG|Rift Center\n</gallery>\n\n\n==Rift Spawn==\nRifts are only able to be opened by players on the island of [[Ocllo]] in a designated area. They are not able to be opened inside of guard zone, but mobs are able to be pulled into the guard zone. Some have used this as a tactic to guard wack the monsters, juggernauts, they wish not to deal with by using flagging tactics.\n\n[[File:OccloRift.PNG|200px|center|Rift Ocllo]]\n\nCurrently Rifts spawn three different monsters that include Clockwork Minion, Clockwork Overseer, and Clockwork Juggernaut. Their mechanics work similar to those in the dungeon of [[Exodus]] and are no pushover when it comes to difficulty. \n\n{| cellpadding=\"5\" cellspacing=\"0\" border=\"1\" width=\"70%\"\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"20%\" | Name\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"65%\" | Description\n! style=\"background-color:#000; color:#FFFFFF;\" width=\"20%\" | Image\n|- align=\"center\"\n|Clockwork Minion\n| style=\"text-align: left;\" |These are the weakest of the bunch, but still have the ability to pack a punch. With all exodus based minions they have a shield you need to bring down, which will send a massive damage bolt back onto you. This hits for 50HP to a player. It also switches to the target it sends the bolt to so watch out. Best tactic is to clear shield with magic arrow then pets can wreck them. They also have the ability to stun you on hit.\n| [[image:ClockWorkMinion1.PNG|Clockwork Minion]]\n|- align=\"center\"\n|Clockwork Overseer\n| style=\"text-align: left;\" |Similar tactics as the Clockwork Minion, but they have much more HP to deal with. When shield is up attacks do 1 damage. It is important to keep the shield down, watch your life, and make sure your not the primary target.\n| [[image:Clockworkoverseer1.PNG|Clockwork Overseer]]\n|- align=\"center\"\n|'''Clockwork Juggernaut'''\n| style=\"text-align: left;\" |Onto the big boy of the encounter. All the above still apply to him, but his HP pool is massive. Based on the screenshot of the amount of them and the statistics below I am sure you can see why there is a struggle. The difference here is these will also toss packs of more Clockwork Minions onto their target to deal with. In regards to plasma farming it is best to leave them alone. As stated below staggering 33K total HP pool.\n| [[image:ClockworkJugg1.PNG|Clockwork Juggernaut]]\n|}\n\n==Rift Crafting==\nAs mentioned Rifts are completely player driven, and will require skilled crafters and the use of the Soulforge. Plasma is the main resource used in all the crafted items. These items are \"a breach\" and \"a forked bough\".\n\n<gallery mode=\"packed\" class=\"right\">\nFile:Breach.PNG|Breach\nFile:ForkedBough.PNG|Forked Bough\n</gallery>\n\nThe Breach is used to open new rifts, so it will be important that when you open rifts you farm enough plasma to crafter another Breach. This is important to make Rifts self sustaining, but they do require additional materials to be farmed outside of Rifts. The Forked Bough is used to create the Ligneous Wight, it will start weak and will grow increasingly stronger as you feed it more plasma.\n\nThe additional materials you will need to farm to use with Plasma will be Intact Dragon's Hearts and Dragon Bone Shards. The hearts and shards both drop from all forms of dragon monsters, but the drop rate is very low.\n\n<span style=\"color:red\">'''Note:'''</span> '''Plasma does DECAY so again it is very important to be prepared for the crafting of items following your rift adventures or run the risk of losing your Plasma.\n\n<gallery mode=\"packed\" class=\"right\">\nFile:Plasma1.PNG|Plasma\nFile:Dragonheart.PNG|Intact Dragon's Heart\nFile:Dragonboneshard.PNG|Dragon Bone Shard\n</gallery>\n\nThe Soul Forge is used to create the items needed to open these gates and create the new pet, both items are located in the \"corrupted\" menu in the Soul Forge. Requires 100 blacksmithing and 90 magery to attempt craft.\n\n<gallery mode=\"packed\" class=\"right\">\nFile:SoulforgeRift3.PNG|Soulforge - Breach\nFile:SoulforgeRift2.PNG|Soulforge - Forked Bough\n</gallery>\n\n==Ligneous Wight==\nThe Wight is the '''unbondable''' pet gained from collecting plasma and crafting the item to summon this pet. \n\nOnce created it will be weak, but can be given plasma (in a total range of about 2000 plasma) to max out its skills and stats. Below is an example of the max statistics of a particular Wight, but the statistics seems range to some degree.\nThe Wight has the ability of a Mini Quicksilver attack that gives it 200 additional dexterity and a refresh of stamina for the duration. It also has the ability of on hit DP poison. These special abilities are fed by consuming stored Plasma which can run out and will need to be replenished by loading more plasma. \n\n<gallery mode=\"packed\" class=\"right\">\nFile:Wight.PNG|Wight\nFile:WightStats.PNG|Wight Statistics\n</gallery>"
          }
        ]
      }
    }
  }
}