{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "1655": {
        "pageid": 1655,
        "ns": 0,
        "title": "Sallos",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[image:Sallos_complete.jpg|thumb|300px|What Sallos should look like after resolution settings.]]\n__TOC__\n==Description==\nSallos is an alternative client to UOSteam or Razor. It is most noticeable for it's smooth movement, clean interface and fast responding targets. It comes with a fair share of graphical issues and bugs but is still widely used by those engaged in Player vs Player content who don't care.\n\n==Installation==\nMake sure you use the [http://www.uoforever.com/download.php UOF Launcher] to fully install and update your UO client before adding all the patches for the best result. If you still want to use Razor/UOSteam, it is best to keep a separate copy of the UO client folder for Sallos. Once you have confirmed that all the latest patches are applied.\n\nDownload the following:\n# http://www.uoforever.com/wikifiles/sallos/SallosClient.zip\n# http://www.uoforever.com/wikifiles/sallos/SallosArt.zip\n\nThe first file contains the Sallos client, copy this to a folder of your choosing (e.g. C:\\Program Files(x86)\\Sallos\\). The second file contains the art updates that you need to copy into your UO folder, this contains art fixes for:\n* Water\n* Trinsic\n* Minotaur\n* Talisman\n* Galleons\n* Some invisible monsters\n* Cave houses\n* Boats\n\n'''Note:''' The client will crash when you enter a town if you have music turned on. Before tampering with the configuration, it is recommended that you turn off the music.\n\n=== Common Issues ===\n# '''SharpDXAudio2 Error:''' Install the latest DirectX 9 from here: http://www.microsoft.com/en-ca/download/details.aspx?id=8109\n# '''Unable to find ***.UOP:''' This can occur for two reasons\n##You have a client already open. Sallos cannot run when you have another client open that reads from the same UO installation. Close any other running clients and then relaunch Sallos.\n##You do not have a UO installation that uses the UOP file format, which Sallos requires. The client should be installed using the UOF Launcher.\n# '''Jit Compiler Error:''' Download the latest version of the Sallos Launcher. This should be fixed now.\n\n==Configuration File==\n*The first thing I do when I install Sallos is run it once to generate all of the proper configuration files. If you haven't run Sallos yet, do so now. Close Sallos once you've logged into your character and do not leave it running or the files will not be generated.\n\n*We're going to navigate to your Sallos configuration file. The most important aspects of this file are the Resolution options and the restock options. To Navigate to the AppData folder where this file resides, you will need to do one of two tricks since the file is hidden by default.\n\n*First, you can open My Computer and manually type %APPDATA% in the navigation. Once you've landed in this directory go up one folder and open local. The other method would be to manually navigate to the folder. This is typically in your C:\\Users\\USERNAME\\AppData directory and the word \"AppData\" will need to be typed in manually.\n\n[[image:A192e63bc2033dc300995e0e1af03627.png]]\n\nor\n\n[[image:9bce1b301620d19338ab34e83d70a418.png]]\n\n*Once you've reached this directory you'll need to open your LOCAL folder, then SALLOS folder, then the Ultima Online. Inside this folder is a Configuration.xml file. Open it with notepad by Right clicking it and clicking Edit with notepad.\n\n*To be clear, your \"Game window\" is the actual play area of the game while the total \"Screen\" is the entire window including the black space. Since I don't know each individual persons desktop resolution, I cannot give you a solid number to put here.\n\n*To edit the resolution you will scroll down to line 16 which should look something like this below, give or take some numbers.\n\n*<code><screenLayout game-x=\"0\" game-y=\"0\" game-width=\"1570\" game-height=\"800\" screen-x=\"8\" screen-y=\"30\" screen-width=\"1570\" screen-height=\"800\" maximized=\"false\" full-width=\"1024\" full-height=\"786\" fullscreen=\"false\" /></code>\n\n*The \"game-width=\"1570\" is the width of the game window, which the \"screen-width=\"1570\" is the width of the entire window. This leaves me with no black space in my game window. If you prefer that, minus 100 or so from the number and keep testing till you get what you want. [[image:19d293a40dfd8a82a78a028f5b6a2cb7.png|thumb|300px]]\n\n*Finish editing your resolution as you see fit, typically basing it off of your desktop resolution.\n\n*Now you can edit your restock macro. Restocks aren't as advanced as Razor and UOSteam. The amount of reagents that Sallos restocks is in this configuration file and is character specific. Scroll down until you see \"restock\" and change the desired reagent amount.\n\n[[image:41094c72f435fba8d1613d0c0304dbfe.png|thumb|300px]]\n\n*Save the file and launch Sallos again. Once you've loaded, if you are not satisfied with the resolution, go back to the configuration file and make the desired changes. Be sure to entirely close Sallos before ever editing the configuration.xml file.\n\n==Usage==\n*First thing you need to know is that all context menus are opened by holding shift and left clicking. By default in Razor you only need to left click. If you want to open a paperdoll or vendor menu, you'll need to hold shift when clicking.\n\n*Shift is actually used for alot of things in Sallos. Think of it as a \"Safety\" key. You can freely drag a players health bar like in Razor by holding left click and dragging it off of their player. However, to move the health bar again you have to hold shift when doing so.\n\n*The same applies to closing health bars. In order to remove a health bar from your screen, you must hold shift and right click it.\n\n*I'd suggest testing all of this out by dragging your health bar from yourself, moving it around and then trying to open your paperdoll by shift clicking yourself and clicking Paperdoll.\n\n==Options==\n*To open your Sallos options, the default Ultima Online options have been replaced. Open your paperdoll and click options to be presented with the following screen.\n\n[[image:386277701f79ec3bd1b3586ed852b2b5.png|thumb|300px]]\n\n*Macros will be skipped below, there will be a separate section for this.\n:Footsteps: Enable and disable footsteps.\n:Music: Enable and disable music\n:Sound: Enable and disable sound.\n:Display Settings: Change display quality, shadows, rough or smooth character quality and animated movement.\n:Notoriety Hues: Changes the color of the default Notorieties.\n:Always Light: Disables night time and darkness. Never cast In Lor again!\n:Always Run: Makes your character always run instead of walk.\n:Clear hands Before Cast: Drops any hand equipped item to your bag when casting a spell.\n:Container Grid: Adds a visible grid in your bag and containers that neatly separates items.\n:Health Icons: Adds small health bars under players.\n:Hotkeys Enabled: Enables or disables all hotkeys.\n:House Level: Does not function.\n:Incoming Names: Show the names of incoming players or corpses.\n:Key Passthrough: Allows you to type in chat even if the key is a hotkey.\n:Moongate Confirmation: Disable the \"Unsafe Moongate\" prompt when entering moongates.\n:Notoriety Halos: Adds small colored circles under players based on their Notoriety.\n:Notoriety Query: Enables or Disables whether or not you want the Criminal Actions warning to appear.\n:Protect Cures: Prevents you from dropping a cure on someone who is not poisoned (Leaves cursor up)\n:Protect Heals: Prevents you from dropping a heal on someone who is poisoned (Leaves cursor up)\n:Protect Poisons: Prevents you from casting poison on someone who is already poisoned (Leaves cursor up)\n:Queue Targets: Queues your targets.\n:Screenshots: When enabled, Sallos captures a screenshot anytime someone dies on your screen. These images are saved in your Pictures folder in windows.\n:Siege Rulesets: Disables the ability to move into guard zones unless holding shift. Useful for PK's.\n:Smooth Movement: Enables the \"Enhanced Client\" feel of smooth movement.\n:Scavanger: Loots these items from the ground automatically when passing them.\n\n==Macros & Hotkeys==\n[[image:9b128471e7d4477b01a33bb02852dbc9.png|thumb|300px]]\n*In the options menu, navigate to the Macros button and click it. This will bring up your Macro / Hotkey editor. I'd suggest clicking \"Show Keyboard\" and then spamming the delete button to clear out all of the default macros.\n\n*To set your own macro you can either click in the empty button field and press the desired key or you can click on the key in the visual keyboard.\n\n*Once you've chosen a key, use the drop down menu to determine your actions. Most of these actions are self explanatory but I will go over some of them later.\n*When navigating these drop down menus, use straight left and right actions with your mouse. If you unhover the menu at any time, the menu resets. You'll see what I'm talking about on your own, it's annoying.\n\n*Once you've selected the desired actions, you can add a second action if you wish or you can just choose another hotkey from the keyboard and continue making more macros. Keep in mind that there is no save button, you either click the x or choose another key using the visual keyboard.\n\n==Macro Functions==\nI will only be listing a few of the macros that might not be self explanatory.\n\n*Actions > Target > Find: This will find a new target and set it as last target, prioritizing them. It uses smart features so you dont auto find a blue if you're a blue. Works on mobs and players and will always choose a player over a mob if they're on screen.\n\n*Actions > Warmode: If you've deleted all of your macros like I mentioned in the beginning of the guide, you may want to rebind Alt+c for attack mode if you're used to it. It's not default.\n\n*Equipment > Set Equipment > Slot #: This sets your equipment and is paired with the Arm equipment macro. Useful for weapons. Set a Set Equipment macro, click your weapon then use an Arm Equipment macro for the same slot number.\n\n*Interface > All Names: All names is obvious but this function will also auto open corpses (Sometimes. It's kinda buggy)\n\n*Interface > Open > Overview: This is actually your Sallos Map. Sometimes people don't realize it because of it's name.\n\n*Interface > Say: This will let you say whatever you type into the macro obviously but you can also use it to issue commands which we'll go over later.\n\n*Items > Use Once > Set/Use: This allows you to set and use use once items such as trapped pouches. Bind a key for each, set your pouches, then use another key to pop them.\n\n*Items > Use Potions > Smart: This will use a smart heal or cure depending on your status. If you're poisoned, it will automatically use a cure. If you're not poisoned, it will use a heal.\n\n*Options > Toggle Hotkeys: I highly recommend binding this to something and getting used to enabling and disabling your hotkeys when in conversation.\n\n*Other > WaitForTarget: When making a macro such as heal self, the macro will look something like\n:Cast Heal\n:WaitForTarget\n:TargetSelf\n\n*If you do not insert WaitForTarget, the heal will never execute unless you press the key again. It's important to add the WaitForTarget in Sallos with macros like these.\n\n==Commands==\n*Some of the features in Sallos do not have default hotkeys and aren't even displayed in the Macros editor. I usually try to bind important commands to a \"Say macro\". Commands are used by typing a period \".\" and a space. You'll see in the chat \"Client\" and when you press enter it will execute the command.\n\n*When using this feature in the say function, do not forget to add the space.\n\n*All commands are prefixed by a period followed by a space: \". \"\n\n'''Commands'''\n*Disturb\n:Attempts to disrupt spell casting by re-equipping an item or by using a candle.\n\n*LeaveHouse\n:Ejects your character from its current house.\n\n*OpenRunebooks\n:Catalogs all nearby runebooks.\n\n*Dress\n:Equips any previously worn items.\n\n*Recall rune-name\n:Recalls to the specified rune.\n\n*Gate rune-name\n:Gates to the specified rune.\n\n*Target\n:Produces a blank target cursor. Useful for changing last targets.\n\n*Acquire\n:Changes last target to a nearby enemy.\n\n*AlwaysRun\n:Enables or disables the always-run setting.\n\n*SmoothWalk\n:Enables or disables the smooth-movement setting.\n\n*Footsteps\n:Enables or disables footstep sounds.\n\n*Sound\n:Mutes or unmutes ingame sound effects. Toggles if no value is specified.\n\n*Music\n:Mutes, unmutes, or stops ingame music. Toggles if no value is specified.\n\n*QueueTargets\n:Enables or disables the queue-targets setting. Toggles if no value is specified.\n\n*Remove\n:Temporarily removes a targeted item or character from the clients vision. Useful for seeing behind obstacles or for removing an object in someones bag covering an item you wish to steal.\n\n*UseGate\n:Uses the nearest moongate.\n\n*Friend\n:Adds a player to or removes a player from the friends list. Friended players have an icon above their heads and are treated as party members by the targeting system.\n\n*Scavenge\n:Scavenges nearby items.\n\n*RegDrop\n:Moves all held reagents to a targeted container.\n\n*PotDrop\n:Moves all held potions to a targeted container.\n\n*DragToBag\n:Moves a targeted item to your backpack. Useful for quickly looting corpses.\n\n*Move\n:Moves a targeted item—and all items of the same type—to a targeted container. Useful for dropping off potions into kegs.\n\n*Stack\n:Stacks a targeted item with all items of the same type. Useful for combining scrolls or bottles.\n\n*BringTo\n:Brings a targeted item type to the located of the targeted item. Useful for stacking potions in one spot in your bag.\n\n*TurnTo\n:Turns to face the targeted location.\n\n*Noto\n:Changes the notoriety-query setting.\n\n*NotoQuery\n:Changes the notoriety-query setting\n\n*AutoPickup\n:Enables or disables the scavenger agent.\n\n*DropTarg\n:Clears the active target cursor. Just like pressing escape.\n\n*CancelStealth\n:Cancels automatic restealthing and allows running.\n\n*Give [Recalls / Gates]\n:Gives recalls or gate reags to a targetted player.\n\n*FPS\nDisplays rendering speed in frames-per-second.\n\n*Restock\n:Restocks reags and potions from a targeted container. This container only needs to be set once and can be removed from the config file.\n\n*ClearMoves\n:Clear the item movement queue.\n\n*Organize\n:Arrange the items in you bag to a template preset by SetOrganize\n\n*SetOrganize\n:Used to set the template of your bag to be used with Organize\n\n*RenamePet\n:Allows you to rename your pet.\n\n==Misc Features==\n*Auto drink Refresh potions when stam reaches 0.\n*Auto open doors when facing them.\n*Ctrl click party health bars to track them on map.\n*Auto count stealth steps.\n*Auto restealth.\n*Enemies on map are red dots.\n\n==Misc Notes==\n*There may be problems multi clienting in Sallos. However, it is possible.\n*Anti Virus's flag Sallos, when downloading, extracting and launching. Disable it.\n*Change your config in the AppData folder at any time. Sallos must be closed.\n*Last targets will use beneficial spells on last beneficial target and harmful spells on last harmful target."
          }
        ]
      }
    }
  }
}