{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "1463": {
        "pageid": 1463,
        "ns": 0,
        "title": "Snooping",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[File:Flag_snooping.gif|thumb]]\n__TOC__\n==Description==\n[[Snooping]] is considered a prerequisite for the [[Stealing]] skill. A character only can steal random items from other characters, NPCs, or pack animals unless they possess the [[Snooping]] skill. Like the [[Hiding]] skill, [[Snooping]] can be practiced to its own end, i.e. just to be able to see what others are toting around Sosaria. However unlike [[Hiding]], it is typically looked upon as aggressive act.\n\nYou cannot be guard whacked for [[Snooping]] nor will you be flagged as a criminal. [[Snooping]] will lower your Karma. You might consider the use of the [[Stealth]] skill as most players will not let you get close to them if they suspect ill intentions.\n\nThere are no [[Power Scrolls]] for Snooping; the maximum skill for all players is Grand Master, or 100 points. There is no cool down timer for this skill's use, so the gains come that much more quickly than others and it's often used as a source to train [[Dexterity]] quickly.\n\n==Usage==\nSnooping only allows you to see into the backpack of another character, Pack Horses, Pack Llamas and NPC backpacks.\n\nWhile standing no more then a single tile away double click the pack. If successful, you will be able to see the contents in the same way as you see your own backpack.\n\nWhether you succeed or not, there is a chance you will be noticed, wherein nearby players will receive a message concerning your action, and if hidden, a chance of being revealed. Your chances of success increase with higher levels of the Snooping skill, while your chances of being detected decreases.\n\nSnooping is an essential skill for the aspiring thief in that once you can see into a pack you may target a specific item to Steal. Without the use of Snooping you can only blindly target the characters themselves and hope that the random item you grab will be of some value.\n\n==Recommended Leveling==\n:0-50: Train at an NPC [[Thieves_Guild|Thief Guildmaster]]\n:50-100: Use the snooping skill on any player or pack animal rapidly.\n\n==See Also==\n*[[Stealing]]\n*[[Stealth]]\n*[[Hiding]]\n\n[[Category:Skills]]"
          }
        ]
      }
    }
  }
}