{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "1525": {
        "pageid": 1525,
        "ns": 0,
        "title": "Special Moves",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Overdrive]][[Category:Player vs Monster‏‎]][[Category:Player vs Player]]\n__TOC__\nSpecial moves are passive and active abilities which can be unlocked when you have 80 skill in certain combat skills and anatomy\n\n==Fencing==\n===Paralyzing Blow===\nSpears have a passive chance to strike a Paralyzing Blow on a target, locking them in place for a short period of time. Anatomy is factored into your chance to hit a Paralyzing Blow: (Anatomy / 100) * (Paralyzing Blow Base Chance).\n\n==Mace Fighting==\n===Crushing Blow===\nTwo handed mace weapons have a passive chance to provide 150% damage, significantly reduce stamina, and damage your target's armor. Anatomy is factored into your chance to hit a Crushing Blow: (Anatomy / 100) * (Crushing Blow Base Chance).\n\n==Swordsmanship==\n===Concussion Blow===\nAxes have a passive chance to strike a Concussion Blow on a target, which reduces target's intelligence by half for 15 seconds. Anatomy is factored into your chance to hit a Concussion Blow: (Anatomy / 100) * (Concussion Blow Base Chance).\n\n==Wrestling==\n===Stun & Disarm===\nThe only two usable spell moves are [[Stun]] and [[Disarm]] which are dependent upon [[Wrestling]]. Stun is used to lock a target in place, unable to cast spells or move. Disarm is used to disarm an opponent for a short period of time. Special Moves can be accessed through your client assistance program by setting a hotkey for that skill, or through the client itself through Settings > Macros > New macro > Add:\n\n[[File:Special_Moves_Stun_Disarm_Macro_Preview.PNG]]\n\n==Overdive Notes==\nStun is NOT available on [[Overdrive|Overdrive Server]]:\n\n==See Also==\n*[[Anatomy]]\n*[[Arms Lore]]\n*[[Disarm]]\n*[[Stun]]\n*[[Wrestling]]"
          }
        ]
      }
    }
  }
}