{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "1571": {
        "pageid": 1571,
        "ns": 0,
        "title": "Special Fishing Net",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[file:Special_fishing_net.png|thumb]]\n__TOC__\n==Description==\nA Special Fishing Net is used in deep water to attract sea monsters such as Water Elementals, Sea Serpents, Deep Sea Serpents and even a Kraken. In the [[Naval Warfare Reborn]] expansions, Special Fishing Nets were retooled to allow players to throw them at other players pets, if the player is dead or not near his pets, they will be teleported to your ship.\n\n==Usage==\nThey are occasionally found by fishers with at least 80.0 Fishing skill as loot on sea serpents and can always be found in chests fished up from a [[Message in a Bottle]]. Simply double click the net and target any portion of the deep sea within range. After a few splashing effects, monsters should spawn.\n\nTo use this on players pets, double click the fishing net and target their pet. If they are close enough and the owner of the pets is not within range or is dead, the pets will teleport to your boat.\n\n==Colors==\nWhile the standard Special Fishing Net is a Verite (hue 2208) color, there is a smaller chance for them to spawn in one of the 14 special colors:\n\n[[file:Aqua_special_fishing_net.png]][[file:Blood_special_fishing_net.png]][[file:Brown_special_fishing_net.png]][[file:Charcoal_special_fishing_net.png]][[file:Fire_special_fishing_net.png]][[file:Green_special_fishing_net.png]][[file:Iris_special_fishing_net.png]][[file:Ocean_special_fishing_net.png]][[file:Pink_special_fishing_net.png]][[file:Red_special_fishing_net.png]][[file:Spinach_special_fishing_net.png]][[file:Turquoise_special_fishing_net.png]][[file:Violet_special_fishing_net.png]][[file:Yellow_special_fishing_net.png]]\n\nFrostwood (1151), Red (333), Golden Yellows (2218), (1105), Blaze (1161), Green (477), Blue (205), Blue (500), Mica (1170), Familiar Purples (1205), Cyan (883), Cyan (489), Blue (211), Yellow (155)\n\n==Fabled Fishing Nets==\nFabled Fishing Nets are an even rarer version of the Special Fishing Net which work the same way as your normal version, however they will drag up more difficult monsters from the sea! These can be found in the [[Fishing#Fishing_Rewards|Ancient Sunken Treasures Chests]] that are fished up from using a Ancient SOS [[File:Ancient_sos.png]].\n\n[[File:Fabled_fishing_net.png]]\nPure White (1153)\n\n==Contributors==\nThe community would like to thank the following brave adventurers who contributed their time and experiences for others to enjoy:\n* Colin#1767\n* Khan#6354\n\n==See Also==\n*[[Message in a Bottle]]\n*[[Fishing]]\n*[[Naval Warfare Reborn]]"
          }
        ]
      }
    }
  }
}