{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "2067": {
        "pageid": 2067,
        "ns": 0,
        "title": "Stats",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "__TOC__\n\n==Summary==\nIn Ultima Online your characters Stats determine how she is able to use the different [[skills]].  Each character has 225 Points to distribute over the three stats: [[Stats#Strength|Strength]], [[Stats#Intelligence|Intelligence]], and [[Stats#Dexterity|Dexterity]].\n\nA character gaining prowess in melee skills will want to focus on their Dexterity as [[Stamina]] determines how fast a weapon is swung.  While a Mage will invest in intelligence as they are allowed only to cast spells when they have an appropriate amount of [[mana]].  All characters must distribute in Strength as it determines a character's hit points.\n\n==Strength==\n{{:Strength}}\n\n==Dexterity==\n{{:Dexterity}}\n\n==Intelligence==\n{{:Intelligence}}\n\n==Adjusting Stats==\nYou may sometimes want to shift around your stats. While building your character, this is simple enough. You can just open your [[Status]] and toggle the arrows as required. Each of the [[skills]] in the game has a primary and secondary stat that it can alter. The primary stat will increase 75% of the time, the secondary stat 25% of the time. The following is a breakdown of the primary / secondary stat affected by skills:\n\n* '''Dexterity / Intelligence:''' Musicianship, Begging, Camping, Remove Trap, Snooping, Stealing, Stealth, Tailoring, Tinkering, Hiding, Lockpicking\n* '''Dexterity / Strength:''' Archery, Bowcraft/Fletching, Parrying, Fencing, Fishing\n* '''Intelligence / Dexterity:''' Alchemy, Peacemaking, Poisoning, Provocation, Cartography, Cooking, Detect Hidden, Discordance, Forensic Evaluation, Healing, Herding, Inscription, Tracking, Item Identification, Veterinary\n* '''Intelligence / Strength:''' Anatomy, Animal Lore, Magery, Meditation, Arms Lore, Spirit Speak, Evaluate Intelligence, Taste Identification\n* '''Strength / Dexterity:''' Lumberjacking, Mace Fighting, Mining, Blacksmithing, Carpentry, Resisting Spells, Swordsmanship, Tactics, Wrestling\n* '''Strength / Intelligence:''' Animal Taming\n\nYou do not necessarily have to gain in a particular skill to raise a stat. This is useful if you have already reached your skill cap and do not want to drop any skills to allow the stat adjustment to take place. To achieve this, simply ensure that the skill you want to use has the status arrow pointed up and then use the skill. For example, if you already have 700 skill points but you want to raise your Dexterity, you can point the status arrow for Musicianship upwards and play an instrument to raise your dexterity.\n[[File:AdjustStats.png|200px|center]]"
          }
        ]
      }
    }
  }
}