{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "2305": {
        "pageid": 2305,
        "ns": 0,
        "title": "Staying Safe in Sosaria",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "__TOC__\n\n=Description=\nFor both new and experienced veterans, there is much to learn and keep in mind when exploring the lands of Sosaria on UO Forever. The following guide is a run through the most common \"gotchas\", tips and tricks for staying safe.\n\n==Protect Prized Pets==\nRare pets, particularly [[Meta Pets]] are very attractive targets for griefers who will try to lure your pet away. If a pet is lured away to a house you are not friended to and you cannot find it, the pet will be subject to the [[Protecting_Your_Pets#Pet_Trapping|Pet Trapping]] system. In the case of a [[Meta Pets]] it will return to its original egg form, thus losing all experience and relics in the process! To avoid this disastrous situation, be sure to:\n# Link your pet to a Pet Summoning Ball\n# Regularly stable your pet if you are going to be away from your computer. Stable it if you are logging out!\n# Regularly check who is friended to your house and check all teleporter / door security to prevent unwanted visitors\n\n====Pet Summoning Ball====\nThis blessed item lets you link a bonded pet and summon it to you using Power of Translocation. The ball and powder can both be bought from Nadine the [[Exotic_Item_Vendor|Exotic Item Donation Vendor]]. The ball costs just 1500 [[Donation Coin]]. A small investment to give you peace of mind that you can summon your pet at any time. Even with this item, it is highly recommended that you stable your pet regularly, particularly if you plan to be away from your computer for an extended period of time.\n\n====Bindings Of Devotion====\nIf you are particularly worried about losing your pet, you can purchase Bindings of Devotion from Nadine the [[Exotic_Item_Vendor|Exotic Item Donation Vendor]]. This costs 10,000 [[Donation Coin]] and extends the period that the pet stays loyal to 24 hours. This certainly isn't an essential item but can provide a little extra peace of mind.\n\n<gallery mode=\"packed\" class=\"right\">\nFile:Petballlocation.png|Pet Ball Vendor\nFile:Petheedthiswarning.png|Stable Warning\nFile:Bindingsofdevotion.png|Bindings of Devotion\n</gallery>\n\n==Britain Safe Trading Zone==\nThe area inside and on the rooftop of West Britain Bank has been designated a safe area. Upon entering the area, a message will appear saying that \"You have entered the Britain Safe Trading Zone\". Within this area you can trade without having to worry about thieves. You also cannot be attacked within this area. Be warned however, outside of those walls, you are at the mercy of Britannia's dextrous thieves. If you are meeting someone to trade, you are advised to drop the item off in you bankbox at a quieter banking first. Many an item has been lost as players rushed with the valuables in their backpack.\n\nYou will also find that many stand on top of the bank to show off their fanciest attire or gate to their vendor shop. While it is safe to leave your character there, you are advised to stable your pets if you are to go \"AFK\" for a long period of time.\n\n<gallery mode=\"packed\" class=\"right\">\nFile:Safetradingzone.png|Safe Trading Zone Roof\nFile:Safetradingzoneinside.png|Safe Trading Zone Inside\n</gallery>\n\n==Home Security==\nA [[Custom Housing|house]] can be a nice safe haven but there are a few things to keep in mind!\n\n===Beware AoE Spells===\nThere are a few Area of Effect (AoE) spells that can be used to attack players while they are stood in a house:\n* Earthquake has an 8 tile range and can damage players through walls but it cannot kill them. It can however be used to kill animals - Yet another reason to stable your pet!\n* Chain Lightning and Meteor Swarm have a 3 tile range and can deal damage to players through walls as well.\n\nYou are advised not to stand near walls and don't go afk with valuables. In the smallest classic style house, the footprint is 7x7. You must be three tiles away from each wall, which means in your house, only the exact center tile is completely safe from death. Even then, earthquake can hit you, but cannot kill you as it damages in percentages.\n\nCertain house designs with arches and low walls may also allow a player to be attacked with normal offensive spells. You are advised to consider this when designing your house!\n\nIf you want to stay logged in while away for a long period of time, you are advised to stable your pets, make sure you don't have any valuables on you and stand away from the walls. If you are still concerned, you could alternatively stand at the Britain Safe Trading Area.\n\n===Refresh Your House===\nThis doesn't mean you need to do a spot of spring cleaning, although that too is advised! Rather this refers to keeping your house from falling into disrepair. Familiarise yourself with the [[House Decay]] process. You can avoid house decay by refreshing your house regularly. To refresh, you, a co-owner or a friend can double clicking the house sign, use a door or use a teleporter. If successful a message saying \"Your house's age and contents have been refreshed.\"\n\n===Check Your Security===\nRegularly review who you have listed as friends and co-owners of the house and what the security settings of storage, doors and teleporters are. You could build a seemingly impenetrable fortress but if you then leave the front door accessible to everyone, all your efforts will be wasted! Read the [[Custom_Housing#Home_Security|Home Security]] and [[Custom_Housing#House_Commands|House Commands]] entries to understand how you can secure your house.\n\nNote that after you customise your house, the security settings of objects, including doors and teleporters may revert back to Friend access. Double check the settings and lock them down as necessary!\n\n==Carry Trapped Pouches==\nThere are very few genuinely safe areas in Ultima Online. You would be amazed how often someone or something finds you even in the remotest of places. It therefore pays to be prepared for an encounter with an aggressor! Aside from the normal supplies of things like reagents, bandages and potions, you are also advised to carry a few trapped pouches on each of your characters.\n\nWhen used, trapped pouches will cause a small explosion which causes 1 damage to you. This is very useful in scenario where your aggressor is casting Paralyze on you to score an easy kill. If you do not have the Resisting Spells skill or Magic Reflection spell active, the paralyze effect will have you sitting there like a target dummy waiting to be killed. A quick use of a trapped pouch will break you free from your paralysis.\n\nThe trapped pouches are normal pouches that have had the Magic Trap spell cast on them. You can buy normal and already trapped pouches from any provisioner. On the gold sink vendor, there is also a blessed chargeable trapped pouch that can be charged up to 30 times - A real time saver for any regular PvPer.\n\nTo use a trapped pouch, simply double click on it or use the [[Server Commands|command]] [pouch. You can also trigger a pouch using a macro or Hotkey using [[Razor]], [[UOSteam]] or [[Sallos]].\n\n<gallery mode=\"packed\" class=\"right\">\nFile:trappedPouch.png|Regular trapped pouch\nFile: Chargeabletrappedpouch.png |Chargeable trapped poucn\n</gallery>\n\n==Create An Escape Macro==\nWhen you are overwhelmed in a PvM or PvP scenario and the only option is to escape, it is essential to have a single key ready to recall you to safety. There are methods to create a single macro that will work on all your characters. For example, the following easily modifiable [[UOSteam]] macro was provided by DAVE GL on the UOForever forums:\n<pre>\n\nif not listexists 'home'\n  createlist 'home'\n  pushlist 'home' 0x401fb957 //serial for runebook for char 1\n  pushlist 'home' 0x4048cd67 //serial for runebook for char 2\n  pushlist 'home' 0x40725d1b //serial for runebook for char 3\n  pushlist 'home' 0x41b25eac //serial for runebook for char 4\n  pushlist 'home' 0x4048603a //serial for etc\nendif\nwhile @findtype 0x22c5 'any' 'backpack'\n  ignoreobject 'found'\n  for 0 to 'home'\n    if @serial 'found' == serial 'home[]'\n      if @serial 'found' == serial 0x41b25eac //for tamers, remove if statement if your not a tamer\n        msg 'all come'\n        msg 'all come'\n      endif\n      cast \"Recall\"\n      waitfortarget 2000\n      target! 'found'\n      break\n    endif\n  endfor\nendwhile\nclearignorelist\n\n</pre>\n\nIf you are a particularly jumpy player, you could even bind macros to several keys! ;)\n\n==Keep Blessed Items In Your Main Bag==\nThere are a few items in UO Forever that are either blessed or newbified. These items will remain in your backpack cannot be stolen. However, if you place the item within another back, that bag and its contents could be stolen. So be sure to keep your ethereal mount, spell books, runebooks, blessed clothing, treasure map book, etc. in your main bag!\n\n<gallery mode=\"packed\" class=\"right\">\nFile:cantsteal.png|Can't be stolen\nFile:couldsteal.png|Could be stolen\nFile:didsteal.png|Was stolen\n</gallery>\n\n==Getting back to town==\nInvariably you will at some point find yourself dead in a remote location. To get back to town, you have several options:\n* Rescue yourself - It is well worth having a character on each of your accounts to gate your dead characters back to safety.\n* Ask a friend to rescue you - If you are truly desperate, you could even ask your enemies for help ;).\n* Use your ring / candle of forgiveness - These items cost 15,000 Gold and are available from the gold sink vendor near West Britain bank. Speaking the phrase \"I seek forgiveness\" will teleport you to the Britain healers. This command can be used once a day.\n* Use the Help Stuck option - A last resort. This should generally only be used when your character is truly stuck. It is not a taxi service and its daily use is also limited.\n\n<gallery mode=\"packed\" class=\"right\">\nFile:Ringofforgiveness.PNG|Vendor with forgiveness items\n</gallery>\n\n[[Category:Guides]]"
          }
        ]
      }
    }
  }
}