{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "16": {
        "pageid": 16,
        "ns": 0,
        "title": "Stealing",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Skills]][[Category:Player vs Player]][[Category:Player vs Monster]]\n[[File:StealingFlag.gif|thumb]]\n__TOC__\n=Description=\nStealing is a skill that allows you to steal from players, Pack Animals, creatures and even chests. It is paired well with [[Snooping]], [[Stealth]] and [[Hiding]] in most thief templates. In order to steal from [[Flagging#Blue|Innocent players]], you must choose to join the [[Thieves Guild]] and in doing so revoke your rights to be able to give [[Player_Killing#Murder_Counts|murder counts]]. You may still steal from [[Flagging#Aggressor_Flag|enemy players]], [[Flagging#Grey|grey creatures]] and [[Flagging#Criminal_Flag|criminals]] freely without the need to join the [[Thieves Guild]].\n\n==Patch Notes==\n* [https://www.uoforum.com/threads/8-7-8-0-quality-of-life-items-redo-and-more.110199/ 8-7-8-0-quality-of-life-items-redo-and-more.110199]\n* [https://www.uoforum.com/threads/8-7-7-0-plentiful-bounty-perk-decoy-enhancements-and-more.110192/ 8-7-7-0-plentiful-bounty-perk-decoy-enhancements-and-more.110192]\n* [https://www.uoforum.com/threads/patch-notes-8-2-0-0-and-8-2-1-0.110016/ patch-notes-8-2-0-0-and-8-2-1-0.110016]\n\n=Usage=\nActivating the Stealing ability will allow you to target a container or player. You can steal a random item by clicking a character or their backpack as well as creatures and pack animals. If paired with the [[Snooping]] skill, you can choose the item you wish to steal.\n\nYou will be revealed when stealing an item if you are hidden or invisible. It's wise to [[Stealth]] over to a target before hand to keep them from catching onto your motives. You must also have 2 free hands to steal an item, so wielding a weapon or otherwise, you will not be able to make the attempt.\n\nEven attempting to steal from another [[Flagging#Blue|innocent player or innocent creature]] will [[Flagging#Criminal_Flag|flag you as a criminal]], the chances of being flagged are decreased with higher skill level, the more characters and NPCs around increases the chance of flagging as well. If you are not seen, you will retain your [[Flagging#Blue|innocent status]].\n\nBlessed or \"Newbied\" items along with various other items such as [[Bank|Bank Checks]] cannot be stolen unless they are in a second container inside of the backpack.\n\nAlong with the above factors, a weight calculation is involved. Stealing heavier objects is more difficult than stealing a light object.\n\nA helpful video guide can be found [https://www.youtube.com/watch?v=rUSgeq_7pNI| here].\n\n=Thefts=\nThefts are a direct result of holding an item which is flagged as \"stolen\", anyone in possession of a stolen item will subjected to the following while continuing to hold an item:\n* [[Flagging#Criminal_Flag|Flagged as a criminal]].\n* Removes the ability to cast [[Recall]], or use [[Gate_Travel|Gate Travel]].\n* Unable to place the stolen item in your character's bank.\n* A visible indicator of the Stolen Item Effect (the Eyes) will be present above your character, while in possession of said item.\n\n==Stolen Item Effect==\nThe Stolen Item Effect (The Eyes) will appear above an item for a short period of time throughout the duration of the theft. This is to help indicate that the item is stolen and to track its movement through the process of theft. If the item is in a container the Stolen Item Effect (The Eyes) will appear above the container. If the container is your backpack, the Stolen Item Effect (The Eyes) will appear above your character.\n\n==Duration of Theft==\nThe duration of the theft will last as follows:\n* Stolen item duration: 3 minutes 30 seconds. \n* If you actively use the Stealing Skill on the item from an [[Flagging#Blue|Innocent (blue) character]] and continue to hold it, you will be [[Flagging#Criminal_Flag|flagged as criminal]] for a maximum for 5 minutes and 30 seconds.\n* If you successfully steal an item and are unnoticed in this attempt, a Grace Period will be granted before the item starts [[Flagging#Criminal_Flag|flagging your character]] for the first 25 seconds.\n* Stolen item effect (The Eyes) will appear every 8 seconds.\n\n==Notes==\n* [[Powerscrolls]], [[Weapons]], [[Reagents]], [[Potions]], [[Meta_Pets#Meta_Relics|Meta Relics]] and [[Meta_Talismans#Relics_and_Abilities|Meta Talisman Relics]] will no longer trigger the [[Stealing#Stolen Item Effect|\"stolen item\"]] protection.\n\n=Decoys=\nDecoys are items that players can use to deploy \"fake\" versions of an item. Decoys have a 75% chance of killing the thief [[Stealing#Theft|attempting a theft]] otherwise it will leave them with 1 hp. Most of these Decoys are triggered when an item type for the decoy enters the players backpack or the player is [[Snooping|snooped]] whom is currently carrying this type of decoy, with the exception of Weapon Decoys that trigger when you are disarmed.\n\nThese decoys are crafted with the [[Inscription|Inscription skill]] and [[Forensic_Evaluation|Forensic Evaluation skill]] along with [[Thieves_Guild#Forgers_Paints|Forgers Paints]] and blank scrolls to craft.\n\nThere are four known Decoy types:\n* [[Power_Scrolls#Powerscroll Diversion|Powerscroll Diversion]]\n* Meta Relic Diversion\n* Relic Diversion\n* Weapon Diversion\n\n=Recommended Leveling=\nStones are how much an item weighs, people tend to use potion bottles or apples to train stealing.\n\nStealing can be done from a pack horse, a remote location from a bag or on the steps of your house.\n\n:0-50: Buy from NPC\n:40-50: Steal 3 Stones\n:50-60: Steal 4 Stones\n:60-70: Steal 5 Stones\n:70-80: Steal 6 Stones\n:80-90: Steal 7 Stones\n:90-100: Steal 8 Stones.\n\n=Contributors=\nThe community would like to thank the following brave adventurers who contributed their time and experiences for others to enjoy:\n* Colin\n* Sift\n\n=See Also=\n*[[Flagging]]\n*[[Forensic_Evaluation|Forensic Evaluation]]\n*[[Hiding]]\n*[[Inscription]]\n*[[Snooping]]\n*[[Stealth]]\n*[[Thieves Guild]]\n*[[Thief Protection Guide]]"
          }
        ]
      }
    }
  }
}