{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "1464": {
        "pageid": 1464,
        "ns": 0,
        "title": "Stealth",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Skills]]\n[[File:Flag_stealth.gif|thumb]]\n__TOC__\n==Description==\nStealth allows a character to move silently while maintaining invisibility, but it becomes much easier to detect such a character compared to Hiding. A character must have at least 80.0 in Hiding to be able to use Stealth. Otherwise, the message \"You are not hidden well enough. Become better at hiding.\" will display. Stealthers can be revealed by common practices such as the reveal spell or the detect hidden skill.\n\nStealthing is usually part of a thief template but there are fun templates such as Stealth archers which can be deadly in large groups. Stealth on this server allows the player to continuously walk while stealthed without \"skill checking\", meaning there is no cooldown if you do not fail the stealth.\n\n==Usage==\nSimply use the hiding skill and walk in the desired direction. You cannot run or it will break the stealth, so client features such as \"Always Run\" should be disabled when stealthing.\nStealthing around banks will usually result in your reveal, characters often macro detect hidden near the bank. Stealthing with any heavy armor will not allow you to do so.\n\n==Recommended Leveling==\nIn order to begin to train Stealth, you must have at least 80.0 [[Hiding|Hiding Skill]] in order for the option to train stealth to appear. You must also have at least 0.1 Stealth Skill in order to passively start gaining while using the Stealth skill.\n\nTraining Stealth:\n:0-50: Purchase from a [[Thieves Guild|Thief Guildmaster/Guildmistress]]. \n:50-65: Stealth while wearing Leather Armor(add a piece at a time as it gets higher.) Don't use a helmet.\n:65-95: Stealth while wearing Studded Leather Armor(add a piece at a time as it gets higher.) Don't use a helmet.\n:95-100: Stealth while wearing Ringmail Armor and a Close Helmet.\n\n==See Also==\n*[[Stealing]]\n*[[Hiding]]\n*[[Snooping]]\n*[[Thieves Guild]]\n*[[Thief Protection Guide]]"
          }
        ]
      }
    }
  }
}