{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "1520": {
        "pageid": 1520,
        "ns": 0,
        "title": "Template",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "__TOC__\n==What is a template?==\nIn Ultima Online, you can be anything you want to be, there are dozens of different [[Skills]] to choose from and you can combine any 7 of them to create the ideal character for you. Some [[Skills]] work in conjunction with each other to give passive bonuses or are prerequisites for another. This is why we create \"Templates\". A [[Template]] is the combination of the 7 skills you have chosen for your character to generalize it.\n\nSkills can be gained up to 100 each, totaling at 700 skill points with the exclusion of [[Power Scrolls]]. For example, a bard will require both the [[Musicianship]] skill as well as a secondary bard skill in order for it to succeed. [[Provocation]] will not work without [[Musicianship]]. Another example would be a Thief. Thieves usually have [[Hiding]] and [[Stealth]]. Thieves are unable to train [[Stealth]] without obtaining some [[Hiding]] skill first.\n\nAside from skills, another part of your template are your [[Stats]]. Warrior types that swing weapons and wear heavy armor often have very high [[Dexterity]], while casters or mages often sacrifice their [[Dexterity]] and get [[Intelligence]] instead. Typically all players have between 85-100 [[Strength]] when they are done with their characters.\n\n==Example of a Template==\n'''PvP Stun / Inscription Mage'''\n:[[Magery]] (Used to cast spells on my targets and allies)\n:[[Meditation]] (Used to passively and actively gain [[Mana]] to cast more spells)\n:[[Evaluate Intelligence]] (Used as a Damage booster for Magery)\n:[[Resisting Spells]] (Reduces incoming spell damage from my Enemies)\n:[[Wrestling]] (Allows me to stun my opponents coupled with anatomy and punch them to interrupt their spells)\n:[[Anatomy]] (Coupled with Evaluating Intelligence, this grants me the passive Defensive Wrestling ability, decreasing overall melee hit chance)\n:[[Inscription]] (Increases my defensive spells, such as magic reflection, protection and reactive armor)\n\n----\n\n:[[Strength]]: 95 (Provides 95 health, typically I'd choose 100, but I sacrificed 5 for my Dexterity)\n:[[Intelligence]]: 95 (Provides 95 mana, typically i'd choose 100, but I sacrificed 5 for my Dexterity)\n:[[Dexterity]]: 35 (Provides me with 35 stamina, granting me the capability to stun a target and still have stamina left over. Usually this would be 25 on a basic mage)\n\n==Usage==\n:To actually choose a template, you can set your skills up and down in the interface.\n:Open your paperdoll and click on Skills.\n:On the left of every skill, there is an arrow.\n:Point the arrows down for skills that are not part of your 7 skill template.\n:Point the 7 skills from your template up.\n:The same can be done with your Stats, by double clicking your health bar."
          }
        ]
      }
    }
  }
}