{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "1658": {
        "pageid": 1658,
        "ns": 0,
        "title": "Templates",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "__TOC__\n\n\nThe wonderful thing about UO is that you are free to combine your skills as you like. However, to create effective templates, there are certain skill combinations that will work better than others. The following are some common templates found on UO Forever. These can all be built using the base 700 skill points. You needn't worry about going for 720 skill points while you are new to the server. 700 is more than enough to create many powerful PvP and PvM templates. Many of the templates were taken from JoeB's handy forum [http://www.uoforum.com/threads/templates-from-old-wiki.51432/ thread].\n\n=Player vs Monster - General Purpose=\n\nIf you are interested in pursuing the [[Meta Talismans]], some suggested templates information can be found on the [[Meta Talismans]] page.\n\n==Bard Warrior==\n; Description\nThe classic starter template for new players - Versatile and independent. Great for soloing in PvM and surviving player killers (PKs). Tactics takes priority over Anatomy, due to its larger damage bonus. Anatomy and Healing at minimum requirements for resurrecting. 60 Magery allows for nearly guaranteed recalls, heals, cures, and buffs in a pinch. High resist is important for survival, most notably for resisting poisons. This template allows you to provoke one mob upon another while hitting either one with archery.\n\n; Strengths\nProvides a good PvM offense from a distance due to the Archery and Provocation Skills. Does not need to be near mobs to be effective. Great for Champion Spawns. Very cheap to build.\n\n; Weaknesses\nDoes not have great defensive Skills. You will want to get out fast when PKs come around - Have that recall escape macro ready!\n\n; Variations\nSome will opt to take a melee skill (Swords / Fencing / Macing) rather than Archery. This can help you output more damage in a short space of time but you will lose the ability to kite a hard hitting monster when you don't have another monster to provoke onto.\n\nOthers will opt to reduce Magery and use just recalls from their runebooks. With the extra points, you can bump up Resisting Spells, Anatomy and/or Healing.\n\n; Skills\n* 100 [[Provocation]]\n* 100 [[Musicianship]]\n* 100 [[Archery]]\n* 100 [[Tactics]]\n* 80 [[Anatomy]]\n* 80 [[Healing]]\n* 80 [[Resisting Spells]]\n* 60 [[Magery]]\n\n; '''Stats'''\n* 100 Strength\n* 90 dexterity\n* 35 intelligence\n\n==Bard Tamer==\n; Description\nThis is an extremely powerful template. Although defenses are weak, his offense outweighs any offense in the game. The provocation tamer can use his powerful pets while provoking mobs on to other mobs. This means that he can fight the largest and meanest mobs in the game without too much worry about taking damage.\n\n; Strengths\nVery good offense due to powerful pets and the ability to provoke one mob onto another. Can heal, buff, and cure not only himself but also his pets. Healing his pets via Veterinary is much more cost effective than using magery. In addition, can keep mobs off of himself by provoking mobs onto his own pets.\n\n; Weaknesses\nDoes not have wrestling nor defensive wrestling. Melee attacks will almost always hit the tamer. It is imperative to learn to keep your pets engaged with mobs and other players. In addition, since there is no Evaluating Intelligence, this tamer's magery spells will not be very powerful. Lacking Resisting Spells, this template really need to stay on top of mobs in his area to prevent them dealing damage to him.\n\n; Variations\nIf you are hunt with a guild that has a lot of provokers already, you could opt for Discordance instead of Provocation. This will help take down some of the harder hitting monsters, particularly Champ Spawn bosses and paragon versions of monsters. You will however sacrifice some solo farming potential with this change.\n\n; Skills\n* 100 [[Animal Taming]]\n* 100 [[Animal Lore]]\n* 100 [[Veterinary]]\n* 100 [[Provocation]]\n* 100 [[Musicianship]]\n* 100 [[Magery]]\n* 100 [[Meditation]]\n\n; Stats\n* 100 Strength\n* 100 Intelligence\n* 25 Dexterity\n\n==Basic Tamer==\n; Description\nThe simple tamer template. Uses his powerful pets to hunt. Has the ability to heal, cure, and resurrect his pets as needed. This template is good for most hunting situations and is flexible enough to work moderately well in light PvP.\n\n; Strengths\nVery good offense do to powerful pets and full strength magery spells. Can heal, buff, and cure not only himself but also his pets. Healing his pets via Vetrinary is much more cost effective than using magery.\n\n; Weaknesses\nDoes not have wrestling no defensive wrestling. Melee attacks will almost always hit the tamer. It is imperative to learn to keep your pets engaged with mobs and other players.\n\n; Variations\nIf you trust your pets to do most of the damage, you could opt to switch Evaluating Intelligence for Wrestling to give you a bit more defence in tight PvM or PvP situations.\n\n; Skill Template\n* 100 [[Animal Taming]]\n* 100 [[Animal Lore]]\n* 100 [[Veterinary]]\n* 100 [[Resisting Spells]]\n* 100 [[Magery]]\n* 100 [[Evaluating Intelligence]]\n* 100 [[Meditation]]\n \n; Stats\n* 100 Strength\n* 25 Dexterity\n* 100 Intelligence\n\n=Player vs Monster - Treasure Hunting and Fishing=\n==All-in-one Treasure Hunter==\n; Description\nThis template is meant to be a Jack of all trades sort of treasure hunter. I personally had all of my character slots filled so having a one slot character that can handle it all is really useful.The real benefit of this setup is to avoid having to manage multiple characters to do a successful treasure hunt or fishing/SOS hunting. You have everything you need to combat most challenges without needing assist from another character.\n\n; Strengths \nYou can decode maps up to max level, fish up whirlpools, do SOSs, unlock paragon and dungeon chests. I really consider this character the quintessential treasure hunter/adventurer. You utilize provocation to keep heavy hitters on eachother alongside clever usage of EVs and Daemon summons along with energy bolts, explosion, and fire horns for supplemental damage. The REAL benefit of this setup is in the money. Between provo in dungeons and SOS and treasure hunts, you will make a lot of money and have fun doing it!\n\n; Weaknesses \nThe only real weakness I see here is the lack of firepower from the archery setups with slayer bows. Sometimes it's a little on the slow side as far as damage is concerned. Also because provocation plays a big part in this build you have to have two Monsters, whether that's two enemies, or a summoned pet and your intended target, and sometimes that's a little tricky at sea. But having nets on you helps as it gives you more targets to provo! Also lack of spell resist could be problematic but I have noticed it having little effect as mobs are usually fighting each other so it's best dropped it in favor of meditation.\n\n; Skill Template\n* 100 [[Fishing]]\n* 100 [[Cartography]]\n* 100 [[Lockpicking]]\n* 100 [[Provocation]]\n* 100 [[Musicianship]]\n* 100 [[Magery]]\n* 100 [[Meditation]]\n\n; Stats\n* 100 Strength\n* 25 Dexterity\n* 100 Intelligence\n\n; Variations\nAs you only need 70 Cartography to decode any level of treasure map, you can boost skills in other areas. You could opt to add some Evaluating Intelligence to add some damage to Magery spells or boost your Provocation success rates by raising it above 100. For the highest level treasure maps, you will likely need additional support characters so you may be able to shift skills around some more skills on this template.\n\n== Archer Mage Fisherman ==\n; Description\nThis template has fishing obviously. The archery allows you to hit enemies and mobs alike from a distance. This template also has bandage Healing and magery Healing. The Magery mainly though is for casting EV's, gating however can be utilized in any way by the player. Slayers with archery is really key here because you can do high damage while avoiding close contact. Typically you need support of other fisherman in general depending on what you are fishing for.\n\n; Strengths\nSlayer Weapons and distance fighting are key strengths. The Magery ability to cast evs and gate in other chars as well as heal/cross heal also is a big strength with this template. The dropping of the bow makes you vulnerable to fizzling if being directly melee'd however that is not a huge issue at sea.\n\n; Weaknesses\nEveryone is vulnerable at sea. As a fishing template this really has little weaknesses but can be used improperly. The magery while it is defensive only in terms of attacking spells still allows summons which are easily utilized at sea.\n\n; Skill Template\n* 100+ [[Fishing]]\n* 100 [[Tactics]]\n* 100 [[Anatomy]]\n* 100 [[Archery]]\n* 100 [[Resisting Spells]]\n* 100 [[Magery]]\n* 100 [[Healing]]\n\n; Stats\n* 90 Strength\n* 45 Dexterity\n* 90 Intelligence\nThis is really at the preference to the player and how he utilizes his/her magery.\n\n==Mage Fisherman==\n; Description\nThis is a fisherman char which is very efficient and important to have if in a group. Fishing as a \"crew\" is the best means of fishing. This template can not only cross heal but lay down a lot of ev's as well as gate in chars, etc. The magery can be used offensively as well as it has eval and can be used from a distance to avoid melee shots which is important at sea. \n\n; Strengths\nMagery is the main strength in this as it gives you offensive spells and summons. This char will have more mana than a dexxer/mage so you can utilize your magery much more efficiently as well as regenerate with meditation quickly. Gating out is another thing you can do. Also this has Healing in the template which gives you 3 different ways to heal: Potions, Healing, magery.\n\n; Weaknesses\nLack of wrestling makes you very vulnerable to all melee attacks. Any landed hit will also cause you to fizzle which is a risk for all mages but even more so with one without wrestling.\n\n; Variations\nTo keep an eye out for pirates on the seas, you could opt to take Tracking instead of Healing/Anatomy and use the \"Scan the horizons\" command to give you warnings of nearby vessels. This template can also pair well with the [[Meta Talismans|Meta Mage]] Talisman. In that case, you could again look at dropping Healing/Anatomy to take up Spirit Speak which will give you some mana back with each offensive cast while you have the Meta Mage Talisman equipped.\n\n; Skill Template\n* 100+ [[Fishing]]\n* 100 [[Magery]]\n* 100 [[Evaluating Intelligence]]\n* 100 [[Meditation]]\n* 100 [[Resisting Spells]]\n* 100 [[Anatomy]]\n* 100 [[Healing]]\n\n; Stats\n* 100 Strength\n* 25 Dexterity\n* 100 Intelligence\n\n==Dungeon Chest Crawler==\n; Description\nThis template has a single minded goal and is definitely not for everyone. That single goal is to move throughout a dungeon safely and pick and open dungeon treasure chests. It utilizes hiding and stealth to move around unseen, while lockpicking and remove trap will allow chests to be opened while hidden. This character should never been seen by players or mobs, which is his only defense.\n\n; Strengths\nYou can pick any lock in the game and open chests while hidden as you can remove the trap without casting telekinesis. This template can stealth, therefore can move undetected, even around high end mobs.\n\n; Weaknesses\nThis template has little to no offensive or defensive capabilities. It is meant to stay hidden so as not to be attacked.\n\n; Skill Template\n* 100 [[Magery]]\n* 100 [[Meditation]]\n* 100 [[Lockpicking]]\n* 100 [[Detect Hidden]]\n* 100 [[Remove Trap]]\n* 100 [[Hiding]]\n* 100 [[Stealth]]\n\n; Stats\n* 100 Strength\n* 25 Dexterity\n* 100 Intelligence\n\n\n=Player vs Player=\n==Alchy Stun Mage==\n; Description\nThe Alchy Stun Mage is arguably the most offensive of all Mage Templates. It combines magery with the power of explosion potions and the ability to stop their opponents with a stun. In the field, an Alchy Stun Mage will destroy and in The Duel Pits, it can devestate. Please note that this is also one of the most challenging Templates to play as it requires a combination of strategy, timing, and mage PvP.\n\n; Strengths\nOffensively strong, with the ability to deal large amounts of damage on the run or in one place.\n\n; Weaknesses\nHard to master. Only basic defenses.\n\n; Skill Template\n* 100 [[Magery]]\n* 100 [[Evaluating Intelligence]]\n* 100 [[Meditation]]\n* 100 [[Resisting Spells]]\n* 100 [[Wrestling]]\n* 100 [[Anatomy]]\n* 100 [[Alchemy]]\n\n; Stats\n* 95 Strength\n* 35 Dexterity\n* 95 Intelligence\n\n==Heal Stun Mage==\n; Description\nThe Heal Stun Mage is a smooth blend of offensive and defensive capabilities all in a Mage package. They depend on typical magery damage while using the ability to stun their enemies. When taking damage, they are able to heal themselves with a bandaid to have a \"background Healing\" ability.\n\n; Strengths \nAble to heal without magery and while moving. Can stun their opponents.\n\n; Weaknesses \nBandaids rely upon dexterity and mages typically have low dexterity. This causes slow bandaid applications. No extra offensive capabilities.\n\n; Skill Template\n* 100 [[Magery]]\n* 100 [[Evaluating Intelligence]]\n* 100 [[Meditation]]\n* 100 [[Resisting Spells]]\n* 100 [[Wrestling]]\n* 100 [[Anatomy]]\n* 100 [[Healing]]\n\n; Stats\n* 95 Strength\n* 35 Dexterity\n* 95 Intelligence\n\n==Stun Scribe Mage==\n; Description\nThe scribe mage is very valuable because of inscriptions defensive bonuses. When using inscription at GM the most important spells that are buffed are Reactive Armor, Protection, and Magic reflect. Be aware that inscription on UO:F does NOT increase spell damage. It increases the amount of time that Protection lasts as well the hits absorbed with reactive armor. With reflection it gives you an increase in the amount of spells you can reflect approx 16 circles. That is double from just having GM Magery which only allows you 8 circles reflected. The stun ability speaks for itself. Allows you to stun an opponent when on the offensive and or on the defensive.\n\n; Strengths\nA very survivable template if used properly. The use of reflect, protection, reactive vary in usefulness depending on the situation you're in. The stun makes you a very offensive threat as well as the ability to reflect a lot of spells. The ability to cast without interruption with protection also makes you able to be very offensive or defensive. Reactive armor limiting damage by dexxers is extremely useful as well.\n\n; Weaknesses\nYou cannot stack defensive spells. So if you have reflection up and so happen to be fighting a dexxer there is nothing you can do about it at the time which makes your inscription skill utterly useless. The defensive spells only last so long and have cool down timers between casting again so there are times where your Inscription skill gives you no advantage at all. \n\n; Skill Template\n* 100 [[Magery]]\n* 100 [[Evaluating Intelligence]]\n* 100 [[Meditation]]\n* 100 [[Resisting Spells]]\n* 100 [[Wrestling]]\n* 100 [[Anatomy]]\n* 100 [[Inscription]]\n\n; Stats\n* 95 Strength\n* 35 Dexterity\n* 95 Intelligence\n\n==Alchy Dexxer==\n; Description\nThis is a dexxer template which uses the Alchemy skill for added damage for explosion potions and utilizes magery for supporting spells, whether it be a defensive buff like reflect, reactive armor or blessing.. This does not include evaluating intelligence or meditation so magical spells will not provide high damage for offensive use. Since Publish 2, two handed weapons (excluding archery) can be used while throwing explosion potions.\n\n; Strengths\nCan be very deadly as any Alchemy dexxer can be. Also can be very defensive as you have 3 modes of Healing: Potions, bandages and magery. \n\n; Weaknesses\nThe magery can be used improperly or sometimes can be basically useless rendering the skill useless. Any dexxer has its disadvantages of Healing on a bandage tick and relying on Healing potions. When you drop your weapon to cast a spell you lack a defensive skill so you will be hit with almost every single offensive swing thus causing you to potentially fizzle. Important to remember that when dropping weapons as a dexxer at any time. \n\n; Skill Template\n* 100 Weapon Skill ([[Swordsmanship]], [[Fencing]], or [[Macing|Mace Fighting]])\n* 100 [[Anatomy]]\n* 100 [[Tactics]]\n* 100 [[Healing]]\n* 100 [[Resisting Spells]]\n* 100 [[Magery]]\n* 100 [[Alchemy]]\n\n; Stats\n* 100 Strength\n* 90 Dexterity\n* 35 Intelligence\n\n==Alchy Nox Dexxer==\n; Description\nThe Alchy Nox Dexxor is without a powerful but flawed template. It utilizes Alchemy to deal explosion potions with extra oomph, yet also can deadly poison you on nearly every hit. Cure success rates are however very high on the server. Your poison will be more of an annoyance than a damage dealer in most cases. The template is usually different from player to player depending upon their play style. It is a difficult template to play, but can be very rewarding. The template provided below is only a sample of the type of setup this template requires. \n\n; Strengths\nCan poison enemies. Can throw explosion potions for extra damage or while moving for ranged damage. Can use magic melee weapons.\n\n; Weaknesses\nThis template's weaknesses are defined by how a player chooses to align the skill points. In general though, this template has an extremely deadly damage output, but very little to no defense. \n\n; Skill Template\n* 100 [[Fencing]] or [[Swordsmanship]] \n* 100 [[Tactics]]\n* 100 [[Anatomy]]\n* 100 [[Healing]]\n* 100 [[Resisting Spells]]\n* 100 [[Poisoning]] \n* 100 [[Alchemy]]\n\n; Stats\n* 100 Strength\n* 90 Dexterity\n* 35 Intelligence\n\n==Lumberjacker==\n; Description\nThe Lumberjacker is a specialty template that utilizes the non-melee skill Lumberjacking to provide a 35% damage bonus to Axe damage.\n\n; Strengths \nExceptionally Strong offensive capabilities when using Axes, particularly against mages with the axes [[Swordsmanship#Special_Move|Concussion Blow]] special ability.\n\n; Weaknesses\nNo ranged attack. Basic defensive abilities. Axes are quite slow.\n\n; Skill Template\n* 100 [[Swordsmanship]]\n* 100 [[Tactics]]\n* 100 [[Anatomy]]\n* 100 [[Healing]]\n* 100 [[Resisting Spells]]\n* 100 [[Magery]]\n* 100 [[Lumberjacking]]\n\n; Stats\n* 100 Strength\n* 90 Dexterity\n* 35 Intelligence\n\n==PvP Tamer==\n; Description\nThis template is based on a tamer template but includes a 5x Mage build for PvP purposes. In comparison to The Basic Tamer template, this one uses wrestling instead of Veterinary to be able to survive against attacking melee players. It is expected that this tamer will heal and cure their pets through magery. \n\nTwo alternative builds have been included below for more variety. The first has Alchemy instead of wrestling for a total offense. The second has Inscription for total defense.\n\n;Strengths\nAny tamer build is very strong inherently, however it takes experience to know how to play it well. These builds will allow an experienced tamer to take down multiple PvP targets at the same time as powerful pets like White Wyrms and Dragons do major damage.\n\n;Weaknesses\nSince pets are required for this template, your movement speed will be dependent upon theirs. For mountable pets such as nightmare's, they cannot be re-mounted until a fight is over, which could allow an enemy to escape easily by riding away on their own mount.\n\n; Skill Template 1:\n* 100 [[Wrestling]]\n* 100 [[Evaluating Intelligence]]\n* 100 [[Meditation]]\n* 100 [[Magery]]\n* 100 [[Resisting Spells]]\n* 100 [[Animal Lore]]\n* 100 [[Animal Taming]]\n\n; Skill Template 2:\n* 100 [[Alchemy]]\n* 100 [[Evaluating Intelligence]]\n* 100 [[Meditation]]\n* 100 [[Magery]]\n* 100 [[Resisting Spells]]\n* 100 [[Animal Lore]]\n* 100 [[Animal Taming]]\n\n; Skill Template 3:\n* 100 [[Inscription]]\n* 100 [[Evaluating Intelligence]]\n* 100 [[Meditation]]\n* 100 [[Magery]]\n* 100 [[Resisting Spells]]\n* 100 [[Animal Lore]]\n* 100 [[Animal Taming]]\n\n; Stats\n* 90 Strength\n* 30 Dexterity\n* 100 Intelligence\n\n\n=Crafting=\n\n== Basic Crafter and Resource Gatherer==\nThe Basic Crafter Template with separate resource gathering character:\n* 100 [[Magery]]\n* 100 [[Blacksmithing]]\n* 100 [[Tinkering]]\n* 100 [[Carpentry]]\n* 100 [[Tailoring]]\n* 100 [[Hiding]]\n* 100 [[Musicianship]]\n\nAnd the Resource Gatherer to go with above crafter:\n\n* 100 [[Mining]]\n* 100 [[Fletching|Bowcraft/Fletching]]\n* 100+ [[Inscription]]\n* 100 [[Magery]]\n* 100 [[Meditation]]\n* 100 [[Hiding]]\n* 100 [[Lumberjacking]]\n\nWood is only 2g to buy from vendors, so typically not worth gathering unless you plan on selling wood.\n\nAlchemy is a very common skill for PvP characters, so it may be best to use your PvP character as an alchemist, if you have one. The same is true for Lumberjacking. If you have that on a PvP character, you could switch in another crafting skill, possibly tailoring or blacksmithy to increase the number of [[Bulk Order Deed|BODs]] you can get.\n\nAlternatively, if you do not like bowcraft, Lumberjacking, and Inscription, you can easily use the below template to cover mining, while still being able to have a useful character. In this case, it is a fishermap:\n\n* 100 [[Magery]]\n* 100 [[Mining]]\n* 100 [[Fishing]]\n* 100 [[Meditation]]\n* 100 [[Evaluating Intelligence]]\n* 100 [[Resisting Spells]]\n* 100 [[Hiding]]\n\nThe above build allows the gatherer to fish up [[Message in a Bottle|MIB's]] solo - fend off the weak miner PKs and hide while gathering."
          }
        ]
      }
    }
  }
}