{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "2729": {
        "pageid": 2729,
        "ns": 0,
        "title": "Thief Protection Guide",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Guides]]\n==General Protection==\n\nOther than the obvious stuff like always keeping your weapon equipped around thieves, making sure you don't drink potions or recall with a good weapon around thieves. Your general protection for your everyday items is to simply use a trapped tinker box. It protects most things if you put it in, as most thieves wont even open chests in someone's bag. Review the \"How They Work\" section of the [[Tinker Trapped Boxes]] article.\n\n==Disarm Thief Protection==\n\nHonestly, there is no good protection against it happening. if you have a good weapon and they are gunning for it, they will get it unless disarm fails a few times for them. There is no delay from when you are disarmed, to when the thief can steal the weapon. Your best protect is noticing a disarm thief around and choosing to put your good weapon away and come back with something less desirable. They will leave eventually if you don't have anything of value. Or you can bring multiple weapons to keep switching when you get one stolen. Always best to try to kill a thief with a mage. So be pro-active and switch weapons out if you see them around. only real defense.\n\n==Champ Protection==\n\nThe scripts used by the server population are incredibly impressive. An automatic way to steal a PS in a blink of the eye. The script will automatically search anyones bag beside them and if there is a PS, it will auto steal it in a split second. (you will barely even see it in your bag) Hiding helps, but right before the boss dies, someone will detect hidden and you will be vulnerable. The best defense is right before the boss dies, run around like a crazy maniac. Remember, you do not need to be right beside the boss to get a PS. So stay away from any groups of people and stay on the move. Your only goal is to not be beside a thief when you get the PS or Relic. If you get one, immediately run a little further away then palm it on your cursor and have a friend gate you out. or just run and recall away from everyone (since your already on the move, you should be gone in a second) \n\nLastly, if you are doing the champ with a group. Anyone that did not get something should go immediately into defensive mode. Looking to see if thieves are chasing anyone or if anyone is currently grey.\n\n==Bank Protection==\n\nThere is nowhere safe in UO except in your house or inside brit bank. Bankers can be killed, you can be killed in town and thieves can disarm you right at the bank. It is based on an 8 tile rule. NPC's will not automatically call guards if you are 8 tiles or more away while committing a criminal act. So they can attack freely or steal freely at that distance. When doing any valuable transactions at the bank, make sure you are in brit bank to be 100% sure you are safe. Never go afk at a bank (edited)\n\n==Pet Thief Protection==\n\nObviously, your first course would be to either kill or run from the pet thief. If you don't want to fight, then recalling out while calling \"all follow me\" is your best bet. In town, they will just attack and lure your pet away if afk. (it gets expensive after awhile balling them back, never worth it to afk at a bank) \n\nDead pets are not safe either, so never leave one around. They will be netted onto a boat and sailed away to a trap. But it is more expensive for a pet to be stolen in this way, due to the net cost.\n\n==Thief Mindset==\n\nIf you have a thief standing a few tiles away from you, odds are they are sizing you up (if you have something of value) I.E. a good weapon or a pet. They are waiting for their moment, such as when you recall. Effectively removing your weapon from your hand to cast the spell or not giving you enough time to call \"All Follow Me\" when they attack your pet and getting a good headstart on getting away before you can come back.\n\nAlways be aware of your surroundings, if they are lurking around you specifically. You are most likely they target."
          }
        ]
      }
    }
  }
}