{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "2275": {
        "pageid": 2275,
        "ns": 0,
        "title": "Thieves Guild",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Quests]][[Category:Atlas]]\n[[File:VandorenthiefGM.png|thumb|300px|Vandoren the Thief Guildmistress can show you the ways of Thief trade.]]\n__TOC__\n\n\n\n\n\n\n=Description=\nBeing a member of the Thieves Guild allows you to use disguise kits and steal from other innocent characters. If you do not join the Thieves Guild you may still steal from enemy players, creatures and criminals freely.\n\n=Joining=\nGo to any Thieves Guild Master and say the Guild Masters Name + Join (e.g. Vandoren join). They will tell how you much. Simply drag the amount onto the NPC and enjoy your new guild benefits. To quit, simply replace the join with quit!\n\nWhile in the Thieves Guild, you will not be able to give [[Player_Killing#Murder_Counts|Player Killers Murder Counts]] if they kill you, also you will not be able to actively steal from other players while you are a declared a [[Player_Killing#Murder_Counts|Murderer]].\n\nThere is a Thief Guild Master conveniently located near West Britain Bank, as shown in the image to the right. As well as allowing you to join the Thieves Guild, the NPC can also teach you most common thief skills. \n\nThere are also not many Thief Guildmasters/Guildmistresses in the world, however you can find another in the [[Buccaneer%27s_Den#Points_of_Interest|Buccaneer's Den \"Pirates Den\"]]. Be cautious as this is a lawless town and you can be attacked on sight!\n\n[[File:Bucs_Den_Pirates_Den.png|500px]]\n\n==Requirements==\n* Your character '''must not have any current [[Player_Killing#Murder_Counts|Murder Counts]]'''.\n* Your character must be '''7 days old''', meaning was created 7 days ago'''.\n* Your character must have '''at least 60 skill points in [[Stealing]]'''\n* Your character must have '''at least 48 hours of in-game time''', meaning logged into the server with this character.\n[[File:ThievesGuildInGame2DayWarning.PNG]]\n[[File:ThievesGuild7DayTimer.PNG|280px]]\n\n=Disguise Kits=\nDisguise Kits can be purchased from the NPC Thief Guild Master for 700 gold by saying \"disguise\" near the Thief Guild Master and then dragging the payment onto the NPC.\n\n==Notes==\n* If you log out with a disguise active, the name of your disguised character in place of your character. This also creates a folder for that character in you UO Desktop without macros. It is recommended that you remove the disguise before logging out. The disguise can be removed by death.\n\n=Forgers Paints=\nForgers Paints are a resource that can be purchased for 10,000 gp from a Forger located in the [[Buccaneer%27s_Den#Points_of_Interest|Buccaneer's Den \"Pirates Den\"]]. This NPC is always considered a criminal and can be killed on sight. The Forgers Paints are a requirement for the [[Stealing#Decoys|Decoys]] that can be created with [[Inscription|Inscription skill]] and [[Forensic_Evaluation|Forensic Evaluation skill]] that will attempt to protect players from [[Stealing#Thefts|attempted thefts]].\n\n[[File:Thieves_Guild_Forger_Paints.PNG|300px|Forgers paints, a resource that can be purchased from the Forger in the Pirate's Den (Thieves Guild) in Bucceneer's Den. These are used to create counterfeit documentation.]]\n[[File:Thieves_Guild_Forger_NPC.PNG|300px|A Thieves Guild Forger NPC which sells forger paints. These can be used to counterfeit documentation.]]\n[[File:Thieves_Guild_Forger_Paints_Shop_Menu.PNG|300px|The Forgers Shop Menu showing the Forger Paints for sale.]]\n\n=Contributors=\nThe community would like to thank the following brave adventurers who contributed their time and experiences for others to enjoy:\n* Colin\n* igs-17\n* Sift\n* xScurryMcFlurry\n\n=See Also=\n* [[Buccaneer%27s_Den#Points_of_Interest|Buccaneer's Den \"Pirates Den\"]]\n* [[Stealing#Decoys|Decoys]]\n* [[Forensic_Evaluation]]\n* [[Inscription]]\n* [[Player_Killing#Murder_Counts|Murder Counts]]\n* [[Stealing]]\n* [[Stealing#Thefts|Thefts]]"
          }
        ]
      }
    }
  }
}