{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "1426": {
        "pageid": 1426,
        "ns": 0,
        "title": "Tinker Trapped Boxes",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Crafting]][[Category:Containers]]\n__TOC__\n\n\nA [[Tinkering|Tinker]] with adequate skill is able to create traps on lockable containers.  At 30 [[Tinkering|tinkering]] a Tinker can create Dart and Poison traps on containers.  At 55 [[Tinkering|tinkering]], they can make explosion traps.\n\n\n== Types of Traps ==\n\n* '''Dart Trap''' - This type of trap shoots a dart at the target of the trap.  ''Required resources to make:  1 Bolt, 1 Ingot''\n* '''Poison Trap'''- This type of trap releases poisonous gas at the target effectively poisoning them.  ''Required resources to make:  1 Poison Potion (any strength), 1 Ingot''\n* '''Explosion Trap''' - This type of trap releases a great explosion, damaging the target.  ''Required resources to make:  1 Explosion Potion (any strength), 1 Ingot''\n\n\n== Strength of Trap ==\n\nOpposite of public opinion, the strength of a trap is based upon the skill level of the tinker who created the trap.\n\n\n== How they Work ==\n\n# Once a trap has been created on a lockable container, the trap is not enabled <u>until the key is used on the container</u>. You must use the key a second time, as the owner, to make the box useable for putting items inside.\n# When enabled, a message will appear stating as such.  Once the trap is enabled, the trap will <u>always</u> be dangerous to everyone except the owner (the original person to use the key on the container), because \n# When the key is used upon the container, a message saying that the trap is disabled will be seen, but at this point the <u>trap is only disabled for the owner</u>! Anyone else that accesses the container after these steps will set off the trap. Crafter must make the box, apply the trap, but <u>NEVER</u> use the key as the purchaser of the box must be the one to lock/unlock the box with the key to enable the trap.  \n\n<small>'''All other players (non-owners) who attempt to access the container, whether by picking the lock or just opening the container -- will trigger the trap.'''</small>\n\n<small>'''The spell of telekenisis can be used to avoid the trap damage. Just place trapped box on ground, step several tiles away and cast telekenisis to remove active trap.'''</small>\n\n== Common Uses ==\n\n[[Tinkering|Tinker]] traps can be used for a variety of reasons, but the below are the most common:\n\n* As a thief deterrent. After the trap is enabled, but container is unlocked, the owner (you) can access the contents without triggering the trap, however any thief that snoops that container will trigger the trap on it (upon themselves as they are not the owner).\n* To PK other players.  A well-placed container out in the open brings out the curiosity in players.  Those that are not careful may find that what they thought was a great find is really their death.\n* To protect assets.  Although a murderer or enemy may have killed you, if they are not careful when looting, their over-zealousness may kill them too, and prevent them from getting away with your personal items."
          }
        ]
      }
    }
  }
}