{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "1468": {
        "pageid": 1468,
        "ns": 0,
        "title": "Tracking",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[File:Flag_tracking.gif|thumbnail]]\n__TOC__\n==Description==\nTracking is a skill that allows the character to know if invisible or hidden characters, monsters, or other NPCs are around. The things detected do not become visible, but can be located and followed around (by an arrow constantly pointing in the target's direction).\n\nHaving higher Tracking skill allows characters to track characters with higher Hiding or Stealth skills, allows objects in a broader ranger to be detected, and allows objects to be detected more reliably.\n\nIt is currently most useful in PvP combat. Even with very little skill it is possible to reliably track most other visible characters, making it far more difficult for them to flee. It's also useful at Sea when trying to find other Ships, using the Scan The Horizons command on a boat with 100 tracking will increase the maps overall range by 50 tiles.\n\n==Usage==\n:Use the Tracking skill\n:Select the type of Mobile (Player, creature, etc) from the menu\n:Select the target/\n:Follow the arrow on your screen.\n\n==Recommended Leveling==\n:0-50: Train from NPC in Ranger Guild next to Skara Brae Bank [[File:Rangerguildskara.png|right|200px]]\n:50-100: Use the skill!\n\nIt does not matter if you select a target to track or not you will still gain as long as the tracking window opened.\n\n==See Also==\n*[[Random Dungeon Adventure]]\n*[[Ship Commands]]\n*[[Detect Hidden]]\n\n[[Category:Skills]]"
          }
        ]
      }
    }
  }
}