{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "1644": {
        "pageid": 1644,
        "ns": 0,
        "title": "UOSteam",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[image:Uosteam_launcher.png|thumb|250px|The connection and directories options]]\n__TOC__\n==Description==\nUOSteam is a launcher and assistant for the Ultima Online Classic client. It features a scripting language which is easy to use and requires very basic programming knowledge. It provides a lot of power and flexibility which can streamline a lot of your everyday repetitive UO tasks.\n\n==Connecting==\nWhen you first launch UOS, you will be presented with a window allowing you to specify your client directories and server information. Selecting the Auto Detect option usually works, if it doesn't, navigate to the directory with the browse button and specify it. \n\nIn the Shard section, you specify the server ip and port number. In this case we will use the following:\n:login.uoforever.com\n:2599\n\nWe can also search for updates but this is not required. Simply click start to launch your client.\n\n==Logging in==\n[[image:Uosteam_login.png|thumb|250px|Login from here using your username and password or create an account by entering the desired username and password]]\nYou will be presented with the main UOS window and your usual client. If you are creating an account for the first time, simply enter the desired username and password in the appropriate locations inside of the client. \n\n==Options==\nOptions are changed by selecting the tabs at the top of the UOS window. There is General, Options, Hotkeys, Skills, Snapshots, Agents and About. Below will be a list of these with descriptions.\n\n===General===\n[[image:uos_general_options.png|thumb|250px|This is the window that will be displayed after launching the client.]]\n:'''Always on Top''': This option will cause UOS to stay on top of the Ultima Online window. \n:'''Negotiate Features with Server''': This option is required to play on this server. It sends packets to the server when performing certain actions to check if they :are valid. This prevents people from using certain illegal scripts or features.\n:'''Minimize to Tray''': Minimizes UOS to the tray instead of the task bar.\n:'''Loot System''': Changes between what you see when you open a corpse. \n:'''Save Passwords''': If enabled, you will not need to enter your password when logging in.\n:'''Profiles''': Allows you to switch between profiles, so that you can use different hotkeys or macros.\n\n:'''Filters''': Filters are things in the game that can be prevented from happening such as Light Levels or certain Sounds. Checking the \"Filter\" in the filters menu will block it.\n\n:'''MapUO''':Turning on the map will create a mini map overlay that is capable of tracking you, your party members and even your guild mates. This can be bound to a key for easier access and interacted with by right clicking the actual map.\n\n===Options===\n\n====General====\n:'''Command Prefix''': Allows you to change the command prefix used before entering a command.\n:'''Delay Between Actions''': The amount of time that the client will use to delay the next action.\n:'''Use Objects Queue''': Queues objects and movement of objects.\n:'''Always Accept Party Invitations''': Automatically always accepts party invites when sent.\n:'''Display New Corpses Names''': Shows the name of a dead corpse above it's head when it has recently died or is approached.\n:'''Count Stealth Steps''': Shows messages for how many steps you have taken while stealthed.\n:'''Show Coordinates on Title''': Shows your coordinates in the title bar.\n:'''Turn spell fields into''': Changes between static or tile spell fields.\n:'''Search new containers''': Changes the exemptions for when the client should automatically check a new container.\n:'''Open Doors''': Enables automatically opening doors and when it should do so.\n:'''Open Corpses''': Enables automatically opening corpses and when it should do so.\n:'''Game Window''': Forces the client to use the resolution specified here.\n\n====Combat====\n[[image:Uos_combat_options.png|thumb|250px|A demonstration of the Combat sub tab]]\n:'''Display Spell Mode''': Whether spell names or power words should be displayed when casting. \n:'''Share Spell Target on''': Allows friends to share the same target.\n:'''Color Spell Text''': Colors the spell text above heads to show the type of spell.\n:'''Clear Hands Before Casting''': Clears any weapons or items in your hands when casting a spell.\n:'''Check hands before potions''': Clears any weapons or items in your hands when drinking a potion (Feature disabled)\n:'''Health above people and creatures''': Shows the health in text above players and creatures heads.\n:'''Flags above people and creatures''': Shows the notoriety in text above players and creatures heads.\n:'''Paralyze and poison highlight''': Highlights a target with the appropriate color when they have these effects.\n:'''Smart last target''': Automatically targets enemies or friends based on the spell casted.\n:'''Share enemy target on''': Shares enemy targets with your friends.\n:'''Highlight current target''': Highlights your target in color.\n:'''Limit target range to''': Will disallow targeting at this range.\n:'''Block heal if poisoned or yellow hits''': Prevents casting heal on a poisoned or invincible target so not to waste it.\n:'''Dismount''': Prevents dismounting in warmode and automatically remounts specified mounts.\n\n====Friends====\nAdding and removing friends effects targeting, attacking, healing and more. You can add or remove friends from this sub tab. [[image:Uos_friends_options.png|thumb|250px|A demonstration of the Friends sub tab]]\n:'''Include party members''': Includes party members as friends automatically.\n:'''Consider only this as valid friends''': Uses only this list as valid friend targets.\n:'''Prevent attacking friends in warmode''': When in warmode, this will prevent you from attacking your friends or party members (If specified)\n:'''Healing''': Enables automated healing of self, friends or pets based on these options.\n\n====Title Bar====\n[[image:Uos_titlebar_options.png|thumb|250px|A demonstration of the Titlebar with a sample of what it can look like]]\nThe title bar allows you to insert counters with graphics in it. It can display whatever object that you insert. \n:'''Custom title bar mode''': Chooses whether or not to display and with or without graphic icons.\n:'''Shortcuts''': Using this menu will insert these shortcuts into the display bar at the bottom of this window.\n:'''Warn amount below''': Warns you with client text when you're below this amount.\n:'''Highlight spell reagents on cast''': Highlights the reagents in the title bar with red when casting a spell that uses those reagents.\n:'''Display counter name before amount''': Shows the name of the counter before the amount you have left in the title bar.\n:'''Display image with counters''': Displays graphical images of the counters in the title bar.\n:'''Draw status bar outline''': Creates an outline around your health bar in the title bar.\n\nThe bottom portion of this Options > Title Bar section in UOS is what is displayed in your title bar in a coded format. You can insert default items in it by using the Shortcuts menu above. Simply scroll through the list to the code you want to insert (What you want to be displayed) and click insert.\n\nFor example, Clicking the Weight in the menu and clicking insert the code \" $weight \" into the box below. Navigating through and selecting Max Weight and clicking insert will insert the code \" $maxweight \". You can add titles, dashes or lines as you see fit. In this case I'm going to add the word Weight with a colon and a / in between the weight and max wight so that my final result is Weight: $weight / $maxweight\n\nNow in my title bar, it will show \" Weight: 102/250 \" and I can watch it carefully when looting to know how close I'm getting before I need to drop my loot.\n\nThis is often used for reagents, bandages, statuses, etc. If you would like to copy and paste this one into your code area of the title bar tab, you can use:\n\n:UO - $name $statusbar - $hits/$mana/$stam  $bandagetimer%cntr / %cntr-2 / %cntr-3 / %cntr-4 / %cntr-5 / %cntr-6 / %cntr-7 /  %cntr-9/ %cntr-8    $weight / $maxweight\n\n===Hotkeys===\n[[image:Uos_hotkeys_options.png|thumb|250px|A demonstration of setting hotkeys in the Hotkeys tab]]\nThis tab allows you to define hotkeys within the client. Setting hotkeys is simple and macros are not required to use them. On the left there is a whole expandable list of potential actions and spells. Simply select the action, skill, etc you wish to perform, click the empty \"Hotkey:\" field, press the desired button, and click \"Save\". \n\nI recommend adding a \"Toggle Hotkeys\" hotkey, this will allow you to turn off and on hotkeys so that you do not accidentally cast spells or perform actions while typing a regular sentence.\n\n===Macros===\n[[image:uos_macros_options.png|thumb|250px|In this image, you can see a list of macros and a sample of a simple healing macro to train healing on a ghost for levels]]\nThis tab allows you to write, record and use macros. Macros are repeatable actions that are written in a script format. These are legal as long as the actions being performed are within the rules of the server. \n\nOn the left you will see a list of Macros followed by a remove, new and save button. Clicking remove will delete the currently selected macro from the list, clicking new will create a new macro which you can name, clicking save will save any changes you have made to that macro.\n\nIn the middle of this tab there is an empty box. This is where you macro or script will go. You can use the \"Commands\" button to choose those actions, so you do not need any coding knowledge to create a macro.\n\nFor example. If I go to Commands a menu will appear. I could go to Actions > Bandage > Self and click insert. The resulting code is just \"bandageself\". Playing this script or macro will then use a bandage on myself. It's as simple as that.\n\nOff to the right of this window there is a play and record button. Clicking record will record your actions in game and converted to a script. Clicking play will play that macro or any macro you have inserted manually.\n\nThe loop checkbox will cause the macro to repeat itself once it's reached the end of the script. The Do not auto interrupt checkbox will prevent the macro from interrupting itself.\n\nIn the \"Hotkey\" area, there is an empty field. Pressing a the desired hotkey with that field focused will give the macro a default hotkey. Don't forget to \"save\" the macro with the save button after this is done.\n\n===Skills===\n[[image:Uos_skills_options.png|thumb|250px|This is a demonstration of the skills tab]]\nThe skills tab allows you to view your skills, their values, their total cap and their status (up, down or locked). This is very useful for setting all of your skills up or down at once. This can be done on the right side of this window by selecting the drop down menu under \"All Skills\", selecting up or down, and clicking set.\n\n===Snapshots===\n[[image:Uos_snapshot_options.png|thumb|250px|This is a demonstration of the Snapshots tab, used for taking screenshots automatically]]\nThis tab is for controlling screenshots. The client can be set to automatically take screenshots and crop them based on death events.\n\n:'''Pictures''': On the left side there is a picturing viewer that allows you to delete or open images, as well as manually take a snapshot. \n:'''Image output format''': Allows you to change the generated extension for snapshots. (Jpg, png or bmp)\n:'''Delay before snapshot''': How many milliseconds before the snapshot should be taken.\n:'''Include date and time''': Includes the date and time in a stamp on the screenshot.\n:'''Snap my own death''': Automatically takes a screenshot when you die.\n:'''Snap other players death''': Automatically takes a screenshot when another player dies within your view.\n:'''Automatically crop pixels''': Automatically crop images.\n\n===Agents===\n====Autoloot====\nThis feature is disabled.\n\n====Counters====\n[[image:Uos_counters_options.png|thumb|250px|This is a demonstration of the counters tab located under the agents tab.]]\nThis area under Agents > Counters allows you to add counters to your title bar manually. Click the insert button and target the desired item you wish to be displayed in the title bar. Make sure it is checked in the Counters menu. Now take note of the Format code, such as \"cntr-2\", this will be used inside the Options > Titlebar tab we talked about earlier. You would paste the code \"%cntr-2\" to show that item.\n\nSome of these items are preset and you do not need to re-add them. Check the Options > Title bar area prior to adding any custom items to this Agents > Counters menu.\n\n====Dress====\n[[image:Uos_dress_options.png|thumb|250px|This is a demonstration of the Dress tab located under the Agents tab. In it, you can see that I have some plate armor as my outfit.]]\nThe dress tab lets you create outfits and equip / un-equip them. Click the New button, click new item, target the piece of armor or clothing you wish to be part of this outfit and optionally set the undress container. All of this is done by pressing the button in UOS and targeting the object (Clothing, Armor or Container).\n\nNow when you click Dress or Undress, you will equip or un-equip the listed items. You can make multiple outfits and you can also bind these to hotkeys in the Hotkeys tab of UOS.\n\n====Organizer====\n[[image:Uos_organizer_options.png|thumb|250px|This is an example of a restock macro, removing 100 of each reagents from a container]]\nThe organizer tab under the agents tab is used to create automated organizing tasks as well as restocking tasks. You can set the items you wish to move and set containers for where you want to move them from and to.\n\nThis can be achieved by creating a new organizer by clicking the New button in the bottom left, clicking \"insert\" on the right, and selecting the objects in game. You can then set the amounts you wish to move in the organizer window. Then select the \"Select Containers\" button and set your containers as prompted in game.\n\n====Scavenger====\n[[image:Uos_scavenger_options.png|thumb|250px|This is an example of the Scavenger tab under the Agents tab.]]\nThe scavenger tab under agents allows you to enable and disable scavenger. Scavenger is a setting that allows you to automatically pick up objects as you pass them. Simply click the \"Enable\" check box, click \"Insert\" and select the item.\n\nNow when you pass the object, it will grab it and bring it to your backpack.\n\n====Vendors====\n[[image:Uos_vendors_options.png|thumb|250px|This is an example of purchasing recall scrolls 100 at a time.]]\nThe vendors tab allows you to automate the buying and selling process at shops, to allow bulk transactions. Many people use this to buy all of the reagents at once. This is done by clicking \"New\" with \"Buy\" selected, Click the insert button and target the item you wish to buy, edit the amount in UOS and check \"Enabled\" for that agent.\n\nNow when you visit the shop keeper, clicking him and clicking buy from the context menu will automatically purchase the desired amount of items if you have enough gold. Be warned that as long as that agent is enabled it will always attempt to purchase the item from the shop.\n\n==Script Repository==\nVisit the Script Repository for scripts that can be pasted into the Macros area."
          }
        ]
      }
    }
  }
}