{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "1678": {
        "pageid": 1678,
        "ns": 0,
        "title": "Young Player Status",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "__TOC__\n==Description==\nWhen entering the server for the first time, a player is granted the [[Young Player Status]]. This status grants special permissions and offers some leeway while you learn the game and it's mechanics. They are also aided by [[Companions]] during their journey. You may cancel your young player status at any time by typing \"I renounce my young player status\".\n\n==Benefits==\n*Young players have the [Young] tag in their name.\n*Access to the Young Player Dungeon \"The Defiled Crypt\", a unique Young Player dungeon located within Britain. There are four difference points in Britain where you can enter the dungeon.\n\n<gallery mode=\"packed\" class=\"right\">\nFile:Youngdungeon0.PNG|Starting Inn\nFile:Youngdungeon1.PNG|Inspector Cave\nFile:Youngdungeon2.PNG|Bank Guardhouse\nFile:Youngdungeon3.PNG|Britain Graveyard\nFile:Youngdungeon4.PNG|Inside Dungeon\n</gallery>\n\n*Able to participate in the Young Player Quest in the Young Player Dungeon\n*Able to teleport to Britain and the Young Player Dungeon.\n*You will gain access to the <span style=\"color:red\">'''\"[c\"'''</span> command which gives the ability to chat with other companions and young players. This will be helpful in communication with the companion and young player to assist with questions and other assistance.\n\n[[File:Youngchat1.PNG|center|Young Command Menu]]\n\n*Your possessions will not drop when you die.\n*You are protected from aggressive actions from players only, not pets or summons. You cannot steal from other players.\n\n*Companions will work primarily out of the Elder Hall and Companion Help Center, which is the building located directly northeast from Britain main bank. This will help to work as a good meeting place for the Companion and young player.\n\n<gallery mode=\"packed\" class=\"right\">\nFile:Younghall.PNG|Second Floor\nFile:Younghall1.PNG|Main Floor\nFile:Younghall2.PNG|Basement\n</gallery>\n\n==Starting Items==\n*Young Player Ticket\n*500 Gold\n*50 of each Reagent\n*Leather suit of Armor\n\n==Restrictions==\n*Young Players cannot loot monsters they did not kill.\n*Young Players may not participate in RDAs or Champ Spawns.\n*Young Player Status may be removed if seen frequently participating in IDOCs."
          }
        ]
      }
    }
  }
}