{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "2903": {
        "pageid": 2903,
        "ns": 0,
        "title": "ZombieLand",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "[[Category:Quests]][[Category:Player vs Monster]]\n__TOC__\n==Description==\n\n\n\n[[File:ZombieJoin.png|right|500px|How to join]]\n\nZombie Land is a regular feature in the UOForever Events Calendar. In the event, you are given control of a new character with the same name but a fresh set of skills. You will be placed randomly in the middle of the Zombieland map which is filled with zombies and other nasty creatures. Your primary objective is to survive and build up your skills but don't worry if you die ... this will happen often! Each time you die, you will re-spawn in a different location. You will have lost your items but skills continue to build up. The combat system used is also different from the main server, using more arcade like controls to swing weapons in a specific direction.\n\n\n\n===Joining the fun===\n[[File:Zombieland map.png|right|500px|Zombieland Map]]\nOnce you are ready to bash some zombie heads, you can join the event using the commands: '''[zombieland''' or just '''[z'''.  If the event is active, there will be an option to Join the Event at the bottom right of the Zombie Land menu. When you spawn you will receive a random location on the T2A map, some are much less ideal then others. You will just have to go through periods of dying till you get a good one. If you spawn in a stuck spot just say “I dont want to live” and it will instantly kill your toon.\n\nIt does not matter what toon you pick only the character name goes over with you. Most skills are set to values of 85.0, some skills are set to zero (music skills, hiding, stealth stealing, taming, etc). It is recommended that you start training Hiding straight-away as you will often find yourself running away from mobs of zombies and other creatures.\n\nYou will start out with a dagger, clothes and very few bandages so you will want to get a good boxed in spot quickly (See Navigating and Surviving). Then you will just start smashing zombies, this will be your bread and butter. You will gain score faster just smashing hordes of zombies then hunting down “the big kills”. You will only want to hunt the big monsters for obtaining points and ingredients for the cure.\n\n\n===Combat in Brief===\nYou must use the UOForever Client to play Zombieland. Upon entering a new abilities gump will appear with your Zombieland Controls. This is your directional attack targeting. You will find you can swing faster in Zombieland than in the original UO game but it requires a correct rhythm that once you get the hang of can be quite satisfying! You can manually click the Zombieland Controls gump with your cursor or you can assign them to hotkeys under Options > Macros > Active Abilities by Slot\n[[File:6qlse1D.png|left|200px|Zombieland Controls]] [[File:CTrBKFhh.jpg|center|800px|Active Abilities by Slot]]\n\n\n\n===Macros===\nSome in-game macros you will want to setup in the UOForever Client to play Zombieland are the basics to get started. You will need a bandage self, hiding macro, teleport macro and if you desire keybinding the active abilities you will need to set up macros for those as well. \nSuggested macros for Num PAD ability active ability slots:\n* NUM 7 - Slot 1, Ability 1 (WEST)\n* NUM 8 - Slot 1, Ability 2 (North West)\n* NUM 9 - Slot 1, Ability 3 (North)\n* NUM 4 - Slot 2, Ability 1 (South West)\n* NUM 6 - Slot 2, Ability 3 (North East)\n* NUM 1 - Slot 3, Ability 1 (South)\n* NUM 2 - Slot 3, Ability 2 (South East)\n* NUM 3 - Slot 3, Ability 3 (East)\n\n\n\n===Navigating and Surviving===\n\nMobs will drop crafting items which will give you the ability to craft bows, and blacksmith items once you have gathered the necessary resources. Exceptional armor and weapons do help out, but some mobs do drop power/vanq weapons to keep your item ID skill ready.\n\n\n\n====Monsterpedia====\n* Zombie: Hits like a wet noodle, chance to drop Undying Flesh.\n* Zombie Remnant: Chance at appearing upon death of a zombie, can confuse you and reverse your targeting.\n* Mummy: Hits slightly harder than a zombie.\n* Zombie Spider: Poisoning magic caster\n* Treefellow: Magic caster\n* Daemon: Magic caster that heals a lot\n* Creeper: Fast-moving and hits with max level poison\n* Abomination: Firebreath and heavy damage but can be kited\n* Fey Warrior: Reflects melee and archery but not magic spells\n* Tentacle: Moderate melee hits\n* Horrifying Tree: Magic caster, can only be damaged with an axe.\n\n\n\n===Rewards and Objectives===\n[[File:DSjqJ5Q.png|right|500px|Zombieland Rewards]]\n[[File:Rewards.png|right|500px|Zombieland Rewards]]\nThe rewards, objectives and duration of the Zombieland events can vary. Please keep an eye on the forums and Discord for information about any active Zombie Land events. Prior to the October 2022 event, collecting zombie heads rewarded you with event fragments and top scorers received special prizes. This have been reverted to your total score being used as currency to obtain rewards.\n\n\n'''Points Rewards'''\n\nIn regular game you can browse rewards and redeem points by navigating to [z and clicking \"OKAY\" at the top next to \"Zombieland Rewards\".\n\n\n\n====The Cure====\n[[File:ZombieLand_Seer_Rodney_Part_5_Cure.png|right|500px|Example Recipe]]Aside from racking up points by killing monsters, you can also try to obtain The Cure. This is obtained by gathering certain ingredients and combining them in a specific order. There are various \"Sages\" that can be double-clicked to receive a hint about a single step in the process. Please be aware that every ZombieLand recipe is randomized each time the ZombieLand Event is restarted, so previous recipes will most likely not be useful between events!\n\nMobs drop all the items you need, you will want to look for the following:\n* Pewter bow\n* mortar and pestle (not a normal one it will give you a target cursor)\n* a green colored knife. \n* Special Drops from the [[ZombieLand#Monsterpedia|Monsterpedia]]\n</br>\n</br>\n</br>\n</br>\n</br>\n</br>\n</br>\n</br>\n\n==FAQ==\n\n===Do I need to bring a finished character, regs and stuff for this?===\nNo, a character is provided with a particular starting skill set and gear.\n\n===Can I wear special clothing into the event?===\nYes you can, but by doing so, you accept full responsibility for the clothing if it goes missing. We will not replace lost clothing.\n\n===How do I chat with other players?===\nType [ZC MESSAGEGOESHERE\n\n===Do I need to toggle my skills and stats to up?===\nYes. There is no skill cap while in zombieland. All of your skills start very low and you must train them up.\n\n===What keys do I need to bind?===\nYou must bind Active Abilities by Slots 1-3 (Ability 1-3) to your directional numbered keypad located near your right hand. Bind Slot 1, Ability 1 (West) to NUM 7 and so on.\n\n===Why am I attacking so slow? I can't even kill a single zombie!===\nThis event relies on an arcade-like approach to fighting where you actually have to AIM your attacks. All weapons attack super slow by default for this event because you can press or keybind your Active Ability Slots to attack in that direction. You can swing quite fast this way, but the slower the weapon, the slower you swing. If you try to swing too fast, you simply create extra delay for yourself.\n\n===What do I do if I spawned on a cliff or in a wall and can't get out?===\nSay \"I don't want to live\" and you will respawn. YOU MUST INCLUDE THE APOSTROPHE (i.e. \"I dont want to live\" will NOT work!)\n\n===Where do I get gear?===\nGear spawns on zombies and corpses, with a low chance to spawn magical weapons and armor (NOTE: WEAPONS AND ARMOR MUST BE ID'ed USING Item Identification SKILL FOR YOU TO GET THE BONUS!)\n\n===Why do I only spawn with 5 bandages?===\nThe zombie apocalypse happened fast and you didn't have time to prepare for it, sorry.\n\n===I just keep dying over and over and over.===\nYes, lots of casualties happen in a zombie apocalypse... BUT eventually you will be somebody who happened to appear in a more defensible position and you will be able to get a foothold and survive (and after getting some gear and possibly friends, zombies will be a much smaller threat)!\n\n===What can I do about the gank squads running around killing me a lot.===\nSome players decide to hunt other players, and this is allowed. Teaming up is your best bet. Remember, skills aren't lost when you die, so you are always progressing!\n\n===Are there any mounts?===\nNo mounts at all!\n\n===I'm not bandaging===\nUnlike regular UO, in Zombieland your bandage can be interrupted. Every time you reapply a bandage the timer restarts. You must pay attention to when you finish applying before your try re-applying a bandage!\n\n==Tips and Tricks==\n* Loot everything you need to put ALL spells into your spellbook when you see scrolls. Important ones are Energy Bolt, Explosion, Magic Reflect and Chain Lightning.\n* You can bury your items by getting a green shovel and a wooden chest. REMEMBER where you buried it AND REMEMBER other players can find it.\n* REACTIVE ARMOR & MAGIC REFLECT IS YOUR FRIEND. Cast it whenever possible when facing hordes of zombies or magic casting monsters/pks.\n* While 2handers do a lot of damage it seems best to run shield and slower strong one handers (warforks are great because you always start with dagger).\n* You can use Blacksmithing, Fletching and Carpentry to make weapons. \n* Bows are devastatingly strong against mobs and people as you can use the Active Abilities attack to spam arrow shots. Birds are hard to come by later on so take advantage early\n* It is good to train hiding as your running around as you may want it for logging off.\n* When logging off you need to let your toon sit for 60 seconds so they log off properly, which is why hiding is a good idea. If you close your client for insta-log you will lose all your items and start as a new empty character, but always keep your Score progress.\n* A lot of players you encounter will not be able to handle a standard attack process. (explo, eb, pots, arrow shots, poisoned weapons, etc). Players will also do this to you as well, some people only troll other players during event and build zero score.\n* LOOT EVERYTHING. Regs, arrows, fill your spellbook, bandages, good potions, mortars to make more pots. Don’t go overweight though as you will die\n\n==Links==\n===Past Events===\n: 2018 https://www.uoforum.com/threads/halloween-2018-events.105765/\n: 2016 https://www.uoforum.com/threads/ultima-online-forever-zombie-land-2016.87727/\n: 2015 https://www.uoforum.com/threads/zombieland-mini-event-8-15-2015.64317/\n: 2014 https://www.uoforum.com/threads/zombieland-event-december-19-20th-2014.49343/\n: 2014 https://www.uoforum.com/threads/zombieland-event-september-20th-2014-starting-at-2pm-est.43327/"
          }
        ]
      }
    }
  }
}