{
  "batchcomplete": "",
  "warnings": {
    "main": {
      "*": "Subscribe to the mediawiki-api-announce mailing list at <https://lists.wikimedia.org/postorius/lists/mediawiki-api-announce.lists.wikimedia.org/> for notice of API deprecations and breaking changes."
    },
    "revisions": {
      "*": "Because \"rvslots\" was not specified, a legacy format has been used for the output. This format is deprecated, and in the future the new format will always be used."
    }
  },
  "query": {
    "pages": {
      "2353": {
        "pageid": 2353,
        "ns": 0,
        "title": "Zombie Land",
        "revisions": [
          {
            "contentformat": "text/x-wiki",
            "contentmodel": "wikitext",
            "*": "#REDIRECT [[ZombieLand]]\n__TOC__\n=LEGACY INFORMATION=\nThis information is being kept for historical purposes, you can find out information on the new process here: [[ZombieLand]]\n==Description==\nZombie Land is a regular feature in the UOForever Events Calendar. In the event, you are given control of a new character with the same name but a fresh set of skills. You will be placed randomly in the middle of the T2A lands which are filled with zombies and other nasty creatures. Your primary objective is to survive and build up your skills but don't worry if you die ... this will happen often! Each time you die, you will re-spawn in a different location. You will have lost your items but skills continue to build up. The combat system used is also different from the main server, using more arcade like controls to swing weapons in a specific direction.\n\n===Tutorial===\nYes, a tutorial before joining! RTFM ;) It is ''highly'' recommended that you at least scan across the information here and watch the tutorial. A video guide can be found here: https://www.youtube.com/watch?v=qxCjfUiZDMY and some configuration information can be found on this page. Of particular importance is the information on how to get setup for combat.\n\n===Joining the fun===\n[[File:ZombieJoin.png|right|100px|How to join]] Once you are ready to bash some zombie heads, you can join the event using the commands: '''[zombieland''' or just '''[z'''.  If the event is active, there will be an option to Join the Event at the bottom right of the Zombie Land menu. When you spawn you will receive a random location on the T2A map, some are much less ideal then others. You will just have to go through periods of dying till you get a good one. If you spawn in a stuck spot just say “I dont want to live” and it will instantly kill your toon.\n\nIt does not matter what toon you pick only the character name goes over with you. Most skills are set to values of 85.0, some skills are set to zero (music skills, hiding, stealth stealing, taming, etc). It is recommended that you start training Hiding straight-away as you will often find yourself running away from mobs of zombies and other creatures.\n\nYou will start out with a dagger, clothes and very few bandages so you will want to get a good boxed in spot quickly (See Navigating and Surviving). Then you will just start smashing zombies, this will be your bread and butter. You will gain score faster just smashing hordes of zombies then hunting down “the big kills”. You will only want to hunt the big monsters for the purpose of creating the cure.\n\n===Combat in Brief===\n[[File:ZombieBinds.png|right|100px|Keyboard Binds]]If you are using '''Razor''', you will need to set macros for swinging. You get your basic weapon swing attack that you are familiar with, but you gain super swings by key smashing (slower or faster depending on weapon speed). The picture to the right shows the general idea of the speak keys to set in game. You must bind !1 through !9 to your keyboard. Please watch the linked video tutorial for further information.\n\nIf you are using '''UOSteam''', the keybinds won't work in the same way but you can use the powerful macro system to automate your weapon swings. You will miss out on some of the nuance of swinging with slower/faster weapons but it should still cause enough damage to smash your way through the zombie masses.\n\n @setalias 'self1' 'self'\n @getenemy 'enemy' 'criminal' 'gray' 'closest'\n pause 750\n if @inrange 'enemy' '1'\n  attack 'enemy'\n  setalias 'vendor' 'enemy'\n  while @inrange 'vendor' 1\n    pause 850\n    if @x 'vendor' > x 'self1' and @y 'vendor' == y 'self1'\n      msg '!3'\n    endif\n    if @x 'vendor' < x 'self1' and @y 'vendor' == y 'self1'\n      msg '!7'\n    endif\n    if @x 'vendor' == x 'self1' and @y 'vendor' > y 'self1'\n      msg '!1'\n    endif\n    if @x 'vendor' == x 'self1' and @y 'vendor' < y 'self1'\n      msg '!9'\n    endif\n    if @x 'vendor' > x 'self1' and @y 'vendor' > y 'self1'\n      msg '!2'\n    endif\n    if @x 'vendor' < x 'self1' and @y 'vendor' > y 'self1'\n      msg '!4'\n    endif\n    if @x 'vendor' > x 'self1' and @y 'vendor' < y 'self1'\n      msg '!6'\n    endif\n    if @x 'vendor' < x 'self1' and @y 'vendor' < y 'self1'\n      msg '!8'\n    endif\n  endwhile\n endif\n\n===Navigating and Surviving===\n[[File:ZombieZones.png|right|100px|Zombie Zones]] The zombie destroyer Suidoken has provided an excellent overview of the spawns. Green zones below are essentially decent spots as they are predominately Zombies, but they still have creepers, demons, abominations, and treefellows. Yellow spots had shown to be more slightly packed with more of the higher mobs. Orange spots are more heavily packed with some higher mobs. The Red zone is the worse zone to spawn in as it is very hard to run out of there alive. It gets worse toward the end of the event. This is because as more mobs are killed in the easier “south” area and they eventually respawn over time in the zone less people want to be in - This is the desert, but the same applies to birds which you will want later on.\n\nOnce you receive an ideal location, you will instantly need to start running to find yourself a good 2-3 tiles zombie hit box. What this means is you want to block yourself on as many sides as you can either by mountain faces or trees and cliffs. This way you are only getting hit by 2-3 zombies and not all 8 that will kill a naked toon fast. This is when you will start swinging at zombies!\n\nMobs will drop crafting items which will give you the ability to craft bows, and blacksmith items once you have gathered the necessary resources. Exceptional armor and weapons do help out, but some mobs do drop power/vanq weapons to keep your item ID skill ready.\n\n====Monsterpedia====\n* Zombie Spider: Poisoning magic caster, chance to drop Spider Carapace.\n* Treefellow: Magic caster, chance to drop Seed of Renewal.\n* Daemon: Magic caster that heals a lot, chance to drop Daemon Claw.\n* Creeper: Fast-moving and hits with max level poison, chance to drop Crystal Flask.\n* Abomination: Firebreath and heavy damage but can be kited, chance to drop Vitriol.\n* Fey Warrior: Reflects melee and archery but not magic spells, chance to drop Fey Wing.\n* Zombie: Hits like a wet noodle, chance to drop Undying Flesh.\n* Tentacle: Moderate melee hits, chance to drop Vile Tentacle.\n\n===Rewards and Objectives===\nThe rewards, objectives and duration of the Zombieland events can vary. Please keep an eye on the forums and Discord for information about any active Zombie Land events. Prior to the October 2018 event, your total score would be used as currency to obtain rewards. This was replaced with a different system based on collecting zombie heads.\n\n====Zombie Heads====\n[[File:ZombiePortal.png|right|Zombie Head]]\n\n[[File:ZombieHead.png|right|Zombie Cauldron]]\n\nThe version of Zombie Lands for October 2018 changed the mechanism for obtaining rewards and the recipe for the cure was also changed. Prizes were no longer awarded based on points, they were for bragging rights only.\n\n'''Zombie Heads'''\n\nZombies had the chance to drop \"a rotting zombie head\". The rotting zombie head had to be taken to one of the zombie portal cauldrons scattered throughout Zombie Land. Double clicking the cauldron and any zombie heads converted them to event crystals and added the crystal to your bank in the normal world.\n\n====The Cure====\n[[File:ZombieLand_Seer_Rodney_Part_5_Cure.png|right|500px|Example Recipe]]Aside from collecting zombie heads and generally surviving, you can also try to obtain The Cure. This is obtained by gathering certain ingredients and combining them in a specific order. There are various \"Sages\" that can be double-clicked to receive a hint about a single step in the process. Please be aware that every ZombieLand recipe is randomized each time the ZombieLand Event is restarted, so previous recipes will most likely not be useful between events!\n\nMobs drop all the items you need, you will want to look for the following:\n* Pewter bow\n* mortar and pestle (not a normal one it will give you a target cursor)\n* a green colored knife. \n* Each of the Special Drops from the [[Zombie_Land#Monsterpedia|Monsterpedia]]\n</br>\n</br>\n</br>\n</br>\n==FAQ==\n\n===Do I need to bring a finished character, regs and stuff for this?===\nNo, a character is provided with a particular starting skill set and gear.\n\n===Can I wear special clothing into the event?===\nYes you can, but by doing so, you accept full responsibility for the clothing if it goes missing. We will not replace lost clothing.\n\n===How do I chat with other players?===\nType [ZC MESSAGEGOESHERE\n\n===Do I need to toggle my skills and stats to up?===\nYes. There is no skill cap while in zombieland. All of your skills start very low and you must train them up.\n\n===What keys do I need to bind?===\nYou must bind !1 through !9 to your directional numbered keypad located near your right hand. Bind !1 to 1 and so on.\n\n===Why am I attacking so slow? I can't even kill a single zombie!===\nThis event relies on an arcade-like approach to fighting where you actually have to AIM your attacks. All weapons attack super slow by default for this event because you can say !1, !2, !3, etc up to !9 to attack in that direction (as shown in the video). You can swing quite fast this way, but the slower the weapon, the slower you swing. If you try to swing too fast, you simply create extra delay for yourself.\n\n===When I press any key, Razor always executes the same macro.===\nThis is a Razor glitch that happens every once in a while. Unfortunately the only solution that I have found is to restart your computer.\n\n===What do I do if I spawned on a cliff or in a wall and can't get out?===\nSay \"I don't want to live\" and you will respawn. YOU MUST INCLUDE THE APOSTROPHE (i.e. \"I dont want to live\" will NOT work!)\n\n===Where do I get gear?===\nGear spawns on zombies and corpses, with a low chance to spawn magical weapons and armor (NOTE: WEAPONS AND ARMOR MUST BE ID'ed USING Item Identification SKILL FOR YOU TO GET THE BONUS!)\n\n===Why do I only spawn with 5 bandages?===\nThe zombie apocalypse happened fast and you didn't have time to prepare for it, sorry.\n\n===I just keep dying over and over and over.===\nYes, lots of casualties happen in a zombie apocalypse... BUT eventually you will be somebody who happened to appear in a more defensible position and you will be able to get a foothold and survive (and after getting some gear and possibly friends, zombies will be a much smaller threat)!\n\n===What can I do about the gank squads running around killing me a lot.===\nSome players decide to hunt other players, and this is allowed. Teaming up is your best bet. Remember, skills aren't lost when you die, so you are always progressing!\n\n===Are there any mounts?===\nNo mounts at all!\n\n===I'm using UOSteam and I can't bandage===\n[[File:ZombieBandage.png|right|100px|Bandageself]][[File:ZombieTargetting.png|right|100px|Targeting System]]Razor is the preferred client for this event but UOSteam will work in combination with some in-game client macros. The combat macro can be found in the \"Combat in Brief\" section. To get bandages to work, open the Options in your client (Options in Paperdoll or Alt-O) and then go to the macros and add a new macro to use the bandageself command. Save this and then make sure you also have the new targeting system enabled. Your setup should look like the two images provided to the right.\n\n==Tips and Tricks==\n* Loot everything you need to put ALL spells into your spellbook when you see scrolls. Important ones are Energy Bolt, Explosion, Invisibility, Magic Reflect and Chain Lightning.\n* Pulling massive packs of zombies and casting chain lighting on them will help you clear MASSIVE amounts of them quickly getting ahead of other players in score. They do not have diminished returns for the amount, all take 80 damage if not resisted.\n* Zombie Spiders drop music instruments which you can then set up a peacemaking macro to spam and make everything do nothing to you as you kill them.\n* You can bury your items by getting a green shovel and a wooden chest. REMEMBER where you buried it AND REMEMBER other players can find it.\n* REACTIVE ARMOR IS YOUR FRIEND. Cast it whenever possible when facing hordes of zombies.\n* While 2handers do a lot of damage it seems best to run shield and slower strong one handers (warforks are great because you always start with dagger).\n* You can use Blacksmithing, Fletching and Carpentry to make weapons. \n* Bows are devastatingly strong against mobs and people as you can use the ! attack keys to spam arrow shots. Birds are hard to come by later on so take advantage early\n* It is good to train hiding as your running around as you may want it for logging off.\n* When logging off you need to let your toon sit for 60 seconds so they log off properly, which is why hiding is a good idea. If you close your client for insta-log you will lose all your items and start as a new empty character, but always keep your Score progress.\n* A lot of players you encounter will not be able to handle a standard attack process. (explo, eb, pots, arrow shots, poisoned weapons, etc). Players will also do this to you as well, some people only troll other players during event and build zero score.\n* . LOOT EVERYTHING. Regs, arrows, fill your spellbook, bandages, good pots, mortars to make more pots. Don’t go overweight though as you will die\n* FIELD SPELLS do not work here. \n* AS A GUILD USE UOAutomap. While it might feel safer to farm together it will drastically slow down your building of score. UOAM will help if you attempt to help each other by staying in same zones, but different screens. \n\n==Links==\n===Past Events===\n: 2018 https://www.uoforum.com/threads/halloween-2018-events.105765/\n: 2016 https://www.uoforum.com/threads/ultima-online-forever-zombie-land-2016.87727/\n: 2015 https://www.uoforum.com/threads/zombieland-mini-event-8-15-2015.64317/\n: 2014 https://www.uoforum.com/threads/zombieland-event-december-19-20th-2014.49343/\n: 2014 https://www.uoforum.com/threads/zombieland-event-september-20th-2014-starting-at-2pm-est.43327/\n\n===Guide===\nThe ever-helpful Lady Skye of Trinsic compiled this excellent guide:\n: https://www.uoforum.com/threads/zombieland-practice.98899/"
          }
        ]
      }
    }
  }
}